[{"helpful": 1, "rating": "5", "body": "This wonderful bar of dark chocolate heaven is a close second to my favorite, the Scharffen Berger 70%. They are slightly different with the Ghiradelli having, for lack of a better word, a darker taste. Not richer. Not smoother. Maybe more mellow is a better way to describe it. It's like the difference between a brand new luxurious bedspread that you just brought home and unwrapped and are so excited to see how it looks on your bed ( the Scharffen Berger) and pulling out the comforting old quilt your grandmother made that you've loved your whole life (the Ghiradelli). They are both wonderful, will keep you warm and make you happy. You can't go wrong either way. This chocolate is yummy. If you like dark chocolate, you'll love this one!", "title": "My Second Favorite Dark Chocolate"}, {"helpful": 1, "rating": "5", "body": "I like dark chocolate, and I'm fine with chocolate with an even higher cocoa content than these have. Note: 'cacao' (which is on the label) is the original spelling for cocoa and is, in fact, cocoa. I suspect these bars use it to seem more... refined. Anyway, these are 72% cocoa, which is very chocolatey but still sweet enough to appease most who claim to like chocolate. Higher cocoa content will begin to be too bitter/unsweet for most. If someone says they like dark chocolate, these are a good bet to get them, as these are dark enough not to seem too sweet, and yet sweet enough so as not to seem too bitter. They are very smooth-melting and taste fantastic.", "title": "Dark chocolate, but not *too* dark"}, {"helpful": 1, "rating": "5", "body": "I drink my coffee black, I love a sharp cheese and a robust, full red wine - the drier the better.  This chocolate fits in perfectly with my type of taste.", "title": "Perfect blend of sweet and bitter - Complex when paired"}, {"helpful": 0, "rating": "4", "body": "This is good to eat one a day for health reasons.  It is so good for you.  I didn't want it real sweet so my sugar level would jump up, so it really serves the purpose.", "title": "Good for health"}, {"helpful": 0, "rating": "5", "body": "I love really dark chocolate but I think I like a higher content than 72%. Good for the heart.", "title": "Love"}, {"helpful": 0, "rating": "5", "body": "My husband its a one of the pieced after every meal.  He has for a long time and loves this brand and the 72% cacao.", "title": "Husband loves this dark chocolate bar"}, {"helpful": 0, "rating": "4", "body": "Good tasting chocolate very hard. Does not always break where you want it but it is good.", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "FRESH", "title": "WILL BUY AGAIN"}, {"helpful": 0, "rating": "5", "body": "If in doubt about Dark chocolates, or if you have never tried any, then just get one of these and then you can decide if you want to go richer or sweeter.", "title": "If in doubt about Dark chocolates, or if you ..."}, {"helpful": 0, "rating": "5", "body": "Excellent product, highly recommended!", "title": "Five Stars"}, {"helpful": 1, "rating": "1", "body": "I have ordered this chocolate from Ghiradelli for several months and was satisfied.  But in my last order I experienced what several other reviewers have described as \"old\" \"had a film on it\" or \"damaged by heat.\"  The bars were dry and brittle, had a white film on them and the flavor was definitely compromised.  Hope they can figure out what the problem is so that I can go back to ordering it.", "title": "Five Stars"}, {"helpful": 0, "rating": "1", "body": "First order of chocolate bars was thrown out as Amazon combined the chocolate in the same box with a completely separate order that I had placed for liquid household cleaning chemicals.  Amazon customer service was great and shipped another order of the chocolate bars at no charge.  However, the second order of chocolate bars were waxy and the chocolate had no taste.  Not sure if this is because the chocolate was old, was imitation Ghirardelli, or if the bars were exposed to hot temperatures in either the Amazon warehouse or during UPS shipping.  I don't think it is a Ghirardelli problem as I have bought these chocolate bars frequently at a local grocery store and found them to have a rich chocolate taste.  I bought the bars on Amazon as the price was better, but it ended up not being a bargain.  After tasting two bars we put the remaining four bars in the trash.", "title": "Waxy, no taste"}, {"helpful": 4, "rating": "1", "body": "Just buy this in store. This is usually a great tasting product, but it tastes awful after having been melted in the UPS box during shipping.", "title": "Melted = different taste/texture"}, {"helpful": 1, "rating": "5", "body": "Let it melt in your mouth with minimal chewing for the best flavor. Packed with freezer bags and with very quick delivery, it still wasn't quite enough to withstand the first 100+F degree day in downtown Phoenix and Scottsdale. One bar on the very outside of the stack of 6 bars was clearly melted at some point, and the chocolate oxidized at the very end of the bar, and was hard-textured for the first piece or two, where it re-solidified. I feared this would be the case on the other bars, but it was only minimally the case on the bar right next to the outside one. The rest were fine and delicious. I'm dying to know if the Godiva brand of 70+% cacao chocolate, which sells for about twice the price, is in any way better than this, but I'm seriously reluctant to pay the price to find out. So if anyone has tried both of these, I welcome your opinion about this.", "title": "Excellent quality - not too sweet or too bitter."}, {"helpful": 1, "rating": "2", "body": "I subscribed to this chocolate so that I could eat half of a bar each day to get a good dose of flavanols.  The first three shipments were fine.  I liked the chocolate.  However, in the last shipment each bar had white film on it (fat bloom) and did not taste good.  Since I use it for medicinal purposes, I still ate it every day for a while.  But, I believe it is giving me stomach upset as well.  So, am throwing the rest away and cancelling my subscription.", "title": "Mixed Results on Quality/Freshness"}, {"helpful": 1, "rating": "5", "body": "We eat a little dark chocolate every evening and this is one of our go to bars.  It is one of the most economical dark chocolates we can find.  Great with wine.  Quite a bit sweeter than the 86%.", "title": "Very good."}, {"helpful": 0, "rating": "5", "body": "I love really dark chocolate but I think I like a higher content than 72%. Good for the heart.", "title": "Love"}, {"helpful": 1, "rating": "5", "body": "I bought this dark chocolate because of the highly-rated health benefits, and although I've only been using for a couple  of weeks so", "title": "Ghiradelli Chocolate Intense Dark Bar 72%"}, {"helpful": 0, "rating": "4", "body": "Good tasting chocolate very hard. Does not always break where you want it but it is good.", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "My husband its a one of the pieced after every meal.  He has for a long time and loves this brand and the 72% cacao.", "title": "Husband loves this dark chocolate bar"}, {"helpful": 2, "rating": "2", "body": "Ghirardelli chocolates are wonderful; however the six bars I received were OLD.  The chocolate was light in color and the textures was not smooth and creamy but rather chalky and dry.  I eat one square of this chocolate daily so I am very familiar with the color and texture of a fresh bar.", "title": "Ghirardelli chocolates are wonderful; however the six bars I received were OLD"}, {"helpful": 0, "rating": "5", "body": "Excellent product, highly recommended!", "title": "Five Stars"}, {"helpful": 2, "rating": "5", "body": "Delicious. And presumably helps my brain. Good price on Subscribe & Save! Consumer Lab says contains good levels of flavanols; approved for lack of lead and cadmium.", "title": "My kind of treat!"}, {"helpful": 0, "rating": "5", "body": "FRESH", "title": "WILL BUY AGAIN"}, {"helpful": 1, "rating": "4", "body": "I would give this a 5 star because of value and taste, but now they changed the price... I bought the Ghirardelli Chocolate 72% Cacao 6 pack for 11.83 on Dec 2014. Now I see the current price which is $21. Nearly double the price...", "title": "Price constantly fluctuates, buy when low"}, {"helpful": 0, "rating": "5", "body": "good", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "Twilight Delight is my favorite of the Ghiradelli Intense Dark series!  I like the Midnight Reverie, as well, but it borders on too dark for me Twilight Delight is definitely my choice of dark chocolate, and I like being able to purchase the multi pack here on Amazon, so I never run out.", "title": "Twilight Delight - my favorite of the Intense Dark series"}, {"helpful": 0, "rating": "4", "body": "These are very good dark chocolate bars, with smooth, rich and intense chocolate flavor, as advertised. I felt a \"chocolate buzz\" after eating a couple of squares. The taste is only slightly sweet, with a bitter aftertaste characteristic of high cacao content chocolate. The taste is not as creamy as one might expect, given the fat content of 17 grams per 38 gram (1.4 oz.) serving--perhaps because of the bitter taste, and also because there is no added dairy fat. This is a good product for those who wish to avoid dairy and/or gluten, although according to the packaging, traces of dairy may be present. WARNING: consume with care. Both my wife and I experienced slight stomach cramping--me after eating half a bar, and she after eating only 1 square. It's potent chocolate!", "title": "A potent chocolate bar!"}, {"helpful": 1, "rating": "5", "body": "Not too bitter, not too sweet. Never grainy, just smooth melting perfect tasting.  I or two squares satisfies my craving and I can move on instead of say 1 or two entire bars of another brand.", "title": "Best Chocolate ever"}, {"helpful": 0, "rating": "5", "body": "Great for chocolate lovers.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "After reading about all the benefits of dark chocolate (the bitter cacao bean part, not the tons of sugar, milk, etc added to make it into candy), I found the 72% cacao a good place to start. If sugar is listed as the first main ingredient, then it's candy. Sugar is listed second on these. I plan to move up gradually to the higher percentage flavor eventually.", "title": "Good stuff"}, {"helpful": 0, "rating": "4", "body": "Delicious.  Marked it down a bit because it came slightly melted last time in a regular mailing box and one was a bit white in part where it had probably been refrigerated after getting too hot.  Before this it came in perfect condition in an insulated carton with a cold pack.  It was still delicious and I can forgive the imperfection to this tasty chocolate, but I hope they go back to packing it better.  The cooler box seemed like overkill, but it did arrive in perfect condition so maybe it was needed.", "title": "Love it, but there was a packing issue last time."}, {"helpful": 1, "rating": "2", "body": "This has been my favorite candy bar for many years.  Unfortunately, my last shipment had lost its glossy appearance and had a matte finish to it.  When I bit into it, there was no creaminess at all.  It was almost a grainy consistency.  I guess I will have to go back to purchasing my 'chocolate fix' locally.", "title": "This has been my favorite candy bar for many years"}, {"helpful": 0, "rating": "5", "body": "One square satisfies the craving for chocolate.  You get portion control and low sugar content.  I rarely still have the craving after one square so this bar lasts a long time.  I did my own taste test and prefer the Ghirardelli but everyone will have their own taste preferences of course. This is not bitter nor burnt tasting but very heavy chocolate.", "title": "Great for dieting, one square will do."}, {"helpful": 0, "rating": "5", "body": "What's not to love about this product.  DARK CHOCOLATE!  Great price! You can buy better chocolate and you can buy cheaper chocolate, but this product hits the sweet spot between quality and cost.  I subscribe to bimonthly delivers of this product to satisfy my habit.  Product arrives predictably and as described.  During the hot summer months, it was shipped in an insulated container packed with ice to keep the chocolate from melting at no additional cost to me.", "title": "What's not to love about this product"}, {"helpful": 0, "rating": "5", "body": "First time tasting a true dark chocolate bar and was a little weary. The first bar tasted a little bitter to me. (I was previously enjoying Dove dark chocolate, which I found out has no nutritional benefit.) The next week I was enjoying the second bar with no bitter taste and really savoring the sweetness. I thought it would take a little longer to adjust to the 72% cocoa. Going to order again soon.", "title": "Pleasantly surprised"}, {"helpful": 0, "rating": "5", "body": "If in doubt about Dark chocolates, or if you have never tried any, then just get one of these and then you can decide if you want to go richer or sweeter.", "title": "If in doubt about Dark chocolates, or if you ..."}, {"helpful": 1, "rating": "5", "body": "They're intense. They're dark. They're delicious. And - for the win - dark chocolate is good for you.", "title": "Best tasting health food ever"}, {"helpful": 0, "rating": "4", "body": "MY WIFE SAID SHE REALLY ENJOYED THIS CHOCOLATE. JUST ENOUGH SWEETNESS AND VERY SMOOTH.", "title": "Four Stars"}, {"helpful": 1, "rating": "5", "body": "I'm not into dark chocolate, but when I heard that eating one square of dark chocolate that has 70% and up amounts of cocao in it will not only suppress your sweets urge, but have health benefits, I tried it.", "title": "Helps suppress my sweet tooth"}, {"helpful": 1, "rating": "4", "body": "Hey!  It tastes like chocolate.  I enjoy having a piece of this with my morning coffee.  It is part of my heart-healthy regimen.  However, one may buy large 17 oz. blocks of dark chocolate at Trader Joe's for a much cheaper price.", "title": "Tasty but pricey"}, {"helpful": 0, "rating": "4", "body": "I am a repeat customer for this brand of product. I actually thought I ordered something else. I am still enjoying it. It is less intense than the 88 percent cacao that I previously ordered.", "title": "Ghiradelli makes good chocolate"}, {"helpful": 0, "rating": "5", "body": "Nothing left to say. LOVE it. LOVE it. LOVE my two squares every day. Wish I could eat the whole bar - hee hee! Just two squares is all you need of 72% cacoa for antioxidant protection. Anything less is just candy and anything more is like ex-lax. This is the best.", "title": "LOVE CHOCOLATE!"}, {"helpful": 0, "rating": "5", "body": "I usually buy them in the bags, they last longer for me.  I didn't realize they were the bars until I received them but that is OK, the price was very reasonable.  This time I doubled up on the bag order so I don't run out this time, I eat two pieces a day as my snack, and keep a candy dish full for guests to enjoy.  The individually wrapped pieces are great to take with you.  These are my favorites so I hope you continue to carry Ghirardelli chocolates.  Thank you.", "title": "Great price - Great product"}, {"helpful": 1, "rating": "1", "body": "I love Ghirardelli chocolate and thought a subscription would be a good way to be sure I have some on hand.  Bad idea.  First delivery was stale and tasteless. I cancelled the subscription and will buy at local stores when available.", "title": "Stale and tasteless, buy at local stores instead"}, {"helpful": 1, "rating": "5", "body": "This level of cacao is supposed to lower blood pressure, and it does that while tasting good too.", "title": "Good and good for you"}, {"helpful": 0, "rating": "5", "body": "Great product. I eat one piece a day for health reasons as well as a treat. Only pain is that they aren't individually wrapped and it always tastes best when freshly opened.", "title": "Great product. Just wish they had the individually wrapped ones."}, {"helpful": 3, "rating": "5", "body": "These are exact same chocolates you will find in stores, so you will know what to expect. What I didn't expect is that the bars are in vacuumed tight plastic bag, in another box with dry ice to keep it cool during shipping. Came in great condition!", "title": "nicely packed"}, {"helpful": 0, "rating": "5", "body": "Was surprised to find that the extra dark chocolate tasted as good as it does.  Was expecting it to be quite bitter, but it isn't for 92%.", "title": "Love it, the 72% much more than the 92%!"}, {"helpful": 0, "rating": "5", "body": "I love dark chocolate and I've been buying this in packs for myself and my parents. They generally do not like sweet things, but they love this dark chocolate. Especially since they heard that dark chocolate can be healthy for you. Quick shipping. The only complaint I have is that one time when I bought a pack of 6, I noticed when I opened a bar up, it was all broken in pieces. It was fine since I break it in pieces when I eat it anyway ;)", "title": "Mmm, drool, dark chocolate"}, {"helpful": 0, "rating": "5", "body": "OMG I hyperventilated when I first ate this! I get shivers each subsequent time. I normally eat Lindt, and I tried the 86% of this brand, but that was too strong for me (personal preference). This is just so awesomely delicious... smoky and fruity flavors make it so complex and stimulating!", "title": "So good"}, {"helpful": 0, "rating": "5", "body": "Dark, smooth, intense chocolate.  It's right at the edge where the concentration of cocoa solids would make it too dry if there were any more.  Great after dinner with a glass of red wine, or any time you feel the urge.", "title": "Marvelous dark chocolate"}, {"helpful": 0, "rating": "5", "body": "Excellent texture, excellent flavor balance.  Of all the brands we've tried, this is the best . . with the possible exception of Valor sugar free with coffee, which is no longer available. This would be the perfect breakfast chocolate for my diabetic wife if were only sugar-free!  But it's still an excellent proeuct.", "title": "Just Wish it Were Sugar Free!"}, {"helpful": 0, "rating": "5", "body": "This chocolate bar is particularly smooth and has a pleasant dark taste.  I am not sure that I would characterize it as \"intense\" as the label specifies since for intense dark chocolate I usually purchase blends with 85% cacao or higher.  These bars made great stocking stuffers over Christmas.", "title": "Smooth and Silky"}, {"helpful": 0, "rating": "5", "body": "I'm generally fan of dark chocolate and these definitely hit the spot.  Adding a square and some strawberries or cocoa powder to a bowl of ice cream really helps with the presentation.  Or add it to some milk for hot cocoa, you'll figure something out =)  Delicious and a great price on Amazon", "title": "Delicious!"}, {"helpful": 1, "rating": "2", "body": "This has been my favorite candy bar for many years.  Unfortunately, my last shipment had lost its glossy appearance and had a matte finish to it.  When I bit into it, there was no creaminess at all.  It was almost a grainy consistency.  I guess I will have to go back to purchasing my 'chocolate fix' locally.", "title": "This has been my favorite candy bar for many years"}, {"helpful": 0, "rating": "5", "body": "What's not to love about this product.  DARK CHOCOLATE!  Great price! You can buy better chocolate and you can buy cheaper chocolate, but this product hits the sweet spot between quality and cost.  I subscribe to bimonthly delivers of this product to satisfy my habit.  Product arrives predictably and as described.  During the hot summer months, it was shipped in an insulated container packed with ice to keep the chocolate from melting at no additional cost to me.", "title": "What's not to love about this product"}, {"helpful": 0, "rating": "1", "body": "First order of chocolate bars was thrown out as Amazon combined the chocolate in the same box with a completely separate order that I had placed for liquid household cleaning chemicals.  Amazon customer service was great and shipped another order of the chocolate bars at no charge.  However, the second order of chocolate bars were waxy and the chocolate had no taste.  Not sure if this is because the chocolate was old, was imitation Ghirardelli, or if the bars were exposed to hot temperatures in either the Amazon warehouse or during UPS shipping.  I don't think it is a Ghirardelli problem as I have bought these chocolate bars frequently at a local grocery store and found them to have a rich chocolate taste.  I bought the bars on Amazon as the price was better, but it ended up not being a bargain.  After tasting two bars we put the remaining four bars in the trash.", "title": "Waxy, no taste"}, {"helpful": 0, "rating": "5", "body": "As someone who likes dark chocolate, this is on par with some of the best - Cote D'Or comes to mind, as well as Swiss varieties. Delicious and not too high of a chocolate content to be bitter and tasteless", "title": "Great chocolate"}, {"helpful": 0, "rating": "5", "body": "I purchased these bars not for savory chocolate but for the purported dark chocolate provides.  As such I break each bar into separate bites and each one each day.  Does doing so do me any good?  I don't know but can only report that I have noticed no difference in how I feel", "title": "Ghirardelli Chocolate Intense Dark Bar, Twilight Delight 72% Cacao"}, {"helpful": 0, "rating": "5", "body": "Be advised, this chocolate is NOT semi-sweet so if you are looking for that candy craving sweetness you will not get it - that said, this chocolate IS sweetened so it's very good, more for a refined palate, it would go extremely well with wine or an after dinner drink, without overwhelming you.  Superior product.", "title": "YUM...and healthy"}, {"helpful": 0, "rating": "5", "body": "If your not into the real cocoa taste then this is for you. This is the minimum percent of cocoa you eat they say and be beneficial to you. If you get to the 85% to 90% (somewhat bitter) range and you really start tasting the cocoa. Once you eat dark chocolate you'll never go back to the milk chocolate. Enjoy!!", "title": "Enjoy!!"}, {"helpful": 0, "rating": "5", "body": "I usually buy them in the bags, they last longer for me.  I didn't realize they were the bars until I received them but that is OK, the price was very reasonable.  This time I doubled up on the bag order so I don't run out this time, I eat two pieces a day as my snack, and keep a candy dish full for guests to enjoy.  The individually wrapped pieces are great to take with you.  These are my favorites so I hope you continue to carry Ghirardelli chocolates.  Thank you.", "title": "Great price - Great product"}, {"helpful": 0, "rating": "4", "body": "Excellent flavor, better than many brands, subscribe and save is a really good value on chocolate that's actually good for you if you stick to just a few squares at a time. I eat it with organic cacao nibs to take away some of the bitterness of the raw cacao, which is the best for good health.", "title": "Ghirardelli Chocolate Intense Dark Bar is among the best"}, {"helpful": 1, "rating": "4", "body": "I have found this dark chocolate to be the best tasting.  Dark chocolate has many health benefits which is one of the reasons I am eating it. I have been eating this on a regular basis for 3 or 4 months.", "title": "Dark chocolates with benefits"}, {"helpful": 1, "rating": "2", "body": "Ugh.  This company cannot make tasty dark chocolate.  Too bitter and flavorless.  Better dark chocolates are made by Equal Exchange.  All of their dark varieties are tasty, balanced, and not too bitter.  So far I believe the ones from Colombia and Ecuador are best.", "title": "Intense Bland and Bitter Flavor"}, {"helpful": 1, "rating": "5", "body": "I love this dark chocolate.  I figured that 72% cacao is perfect for my taste.  Anything higher tastes too bitter to me, anything lower is too milky and sweet.  Ghirardelli 72% intense dark chocolate is perfect in my opinion.  I love both the taste and the texture.  Comparing this Ghirardelli to 72% Lindt that I also recently bought from Amazon, I believe that Ghirardelli has a better texture.  Lindt tasted a bit too \"waxy\" to me.", "title": "love it"}, {"helpful": 0, "rating": "4", "body": "I'm not too big of a dark chocolate fan.I brought it to try it out myself. It's tasty and it is also packaged well. Shipped out quickly too! Overall, it is a quality product and I would most likely buy it again.", "title": "Not bad"}, {"helpful": 0, "rating": "4", "body": "Always a fan of Ghirardelli, this chocolate is the perfect percent to satisfy a sweet tooth (while still feeling like you're enjoying the health benefits of dark chocolate!). The 6-pack isn't necessarily that much cheaper than if you were to purchase individual bars at the store...but the convenience of delivery is always a plus.", "title": "Perfectly Satisfying"}, {"helpful": 2, "rating": "5", "body": "Delicious. And presumably helps my brain. Good price on Subscribe & Save! Consumer Lab says contains good levels of flavanols; approved for lack of lead and cadmium.", "title": "My kind of treat!"}, {"helpful": 4, "rating": "5", "body": "TASTY chocolate from Ghirardelli.  I have one or two squares a day, with my tea.  It's a great treat that fulfills the chocolate cravings without a million calories.", "title": "Yes!  Chocolate!"}, {"helpful": 0, "rating": "4", "body": "I like to eat my dark chocolate in small nibbles, and the thinness of the Ghiradelli squares make that possible.  Some other chocolate brands had a very nice taste but had a much thicker shape, making it hard to nibble.  I was very happy with the Ghiradelli's and bought a set of approximately 12.", "title": "Nice to nibble"}, {"helpful": 0, "rating": "5", "body": "I am a chocolate lover and this bar fits the bill.  It's cacao content enhances the flavor and satisfies the need for a sweet chocolate treat.  I have tried lots of different chocolates but always return to Ghirardelli and will continue to do so in the future.", "title": "World Best Chocolate"}, {"helpful": 1, "rating": "5", "body": "I buy these bars 6 at a time. My husband and I share. We eat a few squares at night for our treat.  They have the right amount of dark cocoa to make them a healthier choice for chocolate.", "title": "Yum!"}, {"helpful": 1, "rating": "5", "body": "Just stick them in the freezer and when you feel the urge for something on the sweet side; at least being frozen it will be a satisfying melt in your mouth! And it is oddly good for you!", "title": "Freezing them makes them that much more delectable!"}, {"helpful": 0, "rating": "5", "body": "Is there is nothing bad to say about delicious, dark chocolate. We have bought this many times, and enjoyed it.", "title": "Gherardelli Chocolate Intense Dark Bar, Twilight"}, {"helpful": 1, "rating": "5", "body": "Ghirardelli is the best chocolate out there, no doubt about it.  the texture, the taste it is a quality you can fill in every bite.  Outstanding!!!", "title": "Ghirardelli is the best"}, {"helpful": 1, "rating": "5", "body": "Its Ghiradelli Chocolate.  What else needs to be said. I send this to my daughter monthly in college for her comfort food.  Works like a champ.", "title": "Works like a champ"}, {"helpful": 1, "rating": "5", "body": "Baking with these are great for the purity of chocolate. Hoping to make a mousse with just water - fills the need for good chocolate.", "title": "72% Dark Chocolate Bar"}, {"helpful": 1, "rating": "5", "body": "Ghiardelli intense dark is one of the few pleasures in life for us plant eaters.  Ghiradelli is Kobe to Hershey's Ground Chuck", "title": "Scrumdiliumptious and vegan"}, {"helpful": 1, "rating": "5", "body": "Great chocolate.  Not too sweet and very smooth.  Good for you too with 72% cacao.  Arrived on time and in great condition.", "title": "Love this chocolate."}, {"helpful": 0, "rating": "5", "body": "it s a good taste and it has  70% cocoa  which in fact it has been proven its healthy  it stimulates your endorhins,  a souce of anti", "title": "good tste"}, {"helpful": 1, "rating": "5", "body": "72% is the perfect blend of chocolate and sweetness. Ghiradelli brand tastes richer than other brands I have tried.", "title": "Perfect 72%"}, {"helpful": 1, "rating": "5", "body": "After coffee, this is my other addiction...  Love this stuff, the calorie to satisfaction ratio is wonderful...", "title": "Love this stuff"}, {"helpful": 1, "rating": "5", "body": "Very healthful...but nasty! I hate dark chocolate. If it weren't good for me, no way. It was my choice though.", "title": "Great for dark chocolate"}, {"helpful": 1, "rating": "5", "body": "We've tried many chocolates and always come back to these. The taste is smooth and they are not to bitter.", "title": "We've tried many chocolates and always come back to these ..."}, {"helpful": 1, "rating": "5", "body": "This level of cacao is supposed to lower blood pressure, and it does that while tasting good too.", "title": "Good and good for you"}, {"helpful": 1, "rating": "4", "body": "Chocolate had a long best by date. It taste great. Wasn't use to eatting this kind but I like it.", "title": "Chocolate had a long best by date"}, {"helpful": 1, "rating": "5", "body": "Large bars of very dark chocalate packed in cold wrap keeps them solid for your first bite", "title": "Delicious very dark large chocolate bars wonderfully packed to keep cool"}, {"helpful": 1, "rating": "5", "body": "It's chocolate...what more can you say?  Dark, so a little bitter...but I love it!", "title": "Yum!"}, {"helpful": 1, "rating": "4", "body": "a little too sweet, could make a middle ground 78% the 86% it's a bit too much", "title": "Four Stars"}, {"helpful": 1, "rating": "5", "body": "My favorite - no too bitter, not too sweet. Can't start the day without it :-)", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "Perfect for afternoon snack with a milk tea or a coffee.  A little bitter.", "title": "Health snack"}, {"helpful": 1, "rating": "5", "body": "Very good very dark chocolate. It's meant for eating, not baking with it.", "title": "for dark chocolate lovers"}, {"helpful": 1, "rating": "5", "body": "This stuff is awesome! Rich, strong, dark chocolate! A good price too!", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "wow this extremely intense you must REALLY like chocolate to eat this", "title": "nice and extreme chocolate"}, {"helpful": 1, "rating": "5", "body": "I love this chocolate bar.  It is tasty and good for your health.", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "Yummy chocolate. Yay!  And it's very satisfying too.", "title": "Yay!"}, {"helpful": 1, "rating": "5", "body": "Great Dark Chocolate. Price OK but could be better!", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "Great chocolate not bitter at this ratio!", "title": "Great!"}, {"helpful": 1, "rating": "5", "body": "If you like chocolate, you'll love this.", "title": "Great stuff"}, {"helpful": 1, "rating": "4", "body": "not so sweet but that is what I wanted.", "title": "Four Stars"}, {"helpful": 1, "rating": "5", "body": "very good-very pleased with my purchase", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "Rich smooth chocolate and not bitter.", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "Exquisite chocolate good service", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "As advertised!  Would buy again!", "title": "Awesome!"}, {"helpful": 0, "rating": "4", "body": "This is great chocolate.  Not a five-star review because I have had better chocolate, honestly, but I have sampled a lot of expensive brands.  For a drug store available chocolate, this is very good.", "title": "Great but not the best"}, {"helpful": 0, "rating": "5", "body": "This chocolate is my favorite. I like dark chocolate, and this is dark, but not too bitter, like some others can be that are higher than 72%. I am a repeat buyer of this and will continue to be", "title": "This chocolate is my favorite. I like dark chocolate"}, {"helpful": 0, "rating": "5", "body": "I like the dark chocolate health benefits. This good tasting chocolate has soy instead of milk as it's base. I am lactose intolerant and this top of the line chocolate I would highly recommend.", "title": "Nice chocolate."}, {"helpful": 0, "rating": "5", "body": "Really nice, creamy dark chocolate.  I am allergic  to dairy so milk chocolate is out but no problem with this great dark chocolate.  Chiradelli lives up to it's reputation as one of the best.", "title": "If you like you chocolate dark this is the one."}, {"helpful": 0, "rating": "4", "body": "my friend was very happy to receive this item", "title": "Four Stars"}, {"helpful": 1, "rating": "5", "body": "Thank you,", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "I love this chocolate bar.  It is tasty and good for your health.", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "nice rich chocolate 72%", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "I have tried higher percentages and don't find them tasty.  The 72% is just fine for me!", "title": "Very good"}, {"helpful": 0, "rating": "5", "body": "Arrived on hot, hot day.  When I opened box the bars were cool. Awesome.", "title": "When I opened box the bars were cool. Awesome"}, {"helpful": 0, "rating": "5", "body": "Exactly as described", "title": "Yumm"}, {"helpful": 0, "rating": "5", "body": "Dark, smooth, intense chocolate.  It's right at the edge where the concentration of cocoa solids would make it too dry if there were any more.  Great after dinner with a glass of red wine, or any time you feel the urge.", "title": "Marvelous dark chocolate"}, {"helpful": 0, "rating": "5", "body": "Be advised, this chocolate is NOT semi-sweet so if you are looking for that candy craving sweetness you will not get it - that said, this chocolate IS sweetened so it's very good, more for a refined palate, it would go extremely well with wine or an after dinner drink, without overwhelming you.  Superior product.", "title": "YUM...and healthy"}, {"helpful": 0, "rating": "5", "body": "Really nice, creamy dark chocolate.  I am allergic  to dairy so milk chocolate is out but no problem with this great dark chocolate.  Chiradelli lives up to it's reputation as one of the best.", "title": "If you like you chocolate dark this is the one."}, {"helpful": 1, "rating": "5", "body": "Exquisite chocolate good service", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "Great Dark Chocolate. Price OK but could be better!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "I have a small piece of dark chocolate every day.  It's supposed to be healthy.  This is yummy.  I've been having Ghirardelli for years and look forward to my daily chocolate.", "title": "Delish and good price."}, {"helpful": 0, "rating": "4", "body": "Delicious dark chocolate with a slightly bitter aftertaste.", "title": "Sweet and bitter"}, {"helpful": 0, "rating": "5", "body": "This is my favorite dark chocolate. Just sweet enough.", "title": "Perfect mix of dark and sweet"}, {"helpful": 0, "rating": "4", "body": "I like to eat my dark chocolate in small nibbles, and the thinness of the Ghiradelli squares make that possible.  Some other chocolate brands had a very nice taste but had a much thicker shape, making it hard to nibble.  I was very happy with the Ghiradelli's and bought a set of approximately 12.", "title": "Nice to nibble"}, {"helpful": 0, "rating": "5", "body": "Everyone should have a daily bite of dark chocolate.  Great additions to gifts.", "title": "Never enough dark chocolate!"}, {"helpful": 1, "rating": "5", "body": "Great chocolate not bitter at this ratio!", "title": "Great!"}, {"helpful": 0, "rating": "5", "body": "yummy", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Arrived as described. These are really smooth.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "I love this chocolate and at 72% cocoa it is very good for you (in moderation).  I prefer the bags of chocolate squares and have already order them.", "title": "I love this chocolate and at 72% cocoa it is very ..."}, {"helpful": 0, "rating": "5", "body": "It's dark, dark chocolate (72% coco) - take a small bit and let it melt in your mouth. Not cluttered with fruit or nuts, just dark, dark chocolate.", "title": "Dark Dark Chocolate"}, {"helpful": 0, "rating": "5", "body": "I'm very health conscious but I love this product because of the minimal sugar, I guess we all cheat sometimes. I hope I don't cheat too much. 😉", "title": "Great taste for me."}, {"helpful": 0, "rating": "5", "body": "This is really wonderful chocolate and it helps keep me on my diet. I can have a piece of this and not crave massive sweets like I usually do.", "title": "So yummy"}, {"helpful": 0, "rating": "5", "body": "Very good dark chocolate.  I would recommend this dark yummy chocolate to anyone.  This is not bitter like some of the other dark chocolates.", "title": "Mmmmmmmmmmm"}, {"helpful": 0, "rating": "5", "body": "What a great deal on subscribe 'n' save.  Way cheaper than buying individually at CVS, perfect for the daily 3 PM square of dark chocolate.", "title": "Good Deal"}, {"helpful": 0, "rating": "5", "body": "I've tried all kinds of dark chocolate, and this is my all-time favorite! Great price, too! It's about time to order another box...", "title": "My favorite chocolate!"}, {"helpful": 0, "rating": "5", "body": "This chocolate is delicious and just hits the spot when I need a little extra TLC. I definitely recommend this luxurious product.", "title": "Need some TLC?"}, {"helpful": 0, "rating": "5", "body": "Got great price. And tastes really good. Not very sweet, just enough. Not bitter at all.", "title": "Great tasting chocolate."}, {"helpful": 0, "rating": "5", "body": "It's chocolate so how can it get bad reviews. Just keep in mind that this is the large bars, not individually wrapped pieces.", "title": "It's chocolate."}, {"helpful": 0, "rating": "5", "body": "I love dark chocolate and this is one of my favorites.", "title": "Good stuff"}, {"helpful": 0, "rating": "5", "body": "As someone who likes dark chocolate, this is on par with some of the best - Cote D'Or comes to mind, as well as Swiss varieties. Delicious and not too high of a chocolate content to be bitter and tasteless", "title": "Great chocolate"}, {"helpful": 0, "rating": "5", "body": "If you're looking for something to stave your cravings during the work day, look no further. This dark chocolate is intense, delicious, and hits the spot.", "title": "Stave your cravings during the work day!"}, {"helpful": 1, "rating": "5", "body": "Loved the chocolate", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "Tastes good!", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "Ghiardelli intense dark is one of the few pleasures in life for us plant eaters.  Ghiradelli is Kobe to Hershey's Ground Chuck", "title": "Scrumdiliumptious and vegan"}, {"helpful": 0, "rating": "5", "body": "Great Product Great Seller", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Just as stated in the picture and it was not bitter at all.", "title": "Love chocolate!"}, {"helpful": 0, "rating": "1", "body": "they all came broken into pieces", "title": "Good but broke up"}, {"helpful": 0, "rating": "4", "body": "Really good, I prefer a darker chocolate, but this was yummy and I may order again.  I am still in stage of looking for the best dark chocolate for the price.", "title": "Pretty good and rich"}, {"helpful": 0, "rating": "4", "body": "This is a little better than the 82%, not quite as bitter and a tiny bit sweeter, but I have had better.", "title": "This is a little better than the 82%"}, {"helpful": 0, "rating": "5", "body": "I use dark chocolate in most recipes so I buy this in bulk. Melts nicely, Also good just for snacking.", "title": "Great for cooking and great price"}, {"helpful": 0, "rating": "5", "body": "Ghirardelli chocolate dark bars are always good.  Price on Amazon was why I added them to my order.", "title": "Five Stars"}, {"helpful": 0, "rating": "3", "body": "Last shipment was shipped without cooling pads and melted.  Chocolate was no good after it melted.", "title": "Chocolate was no good after it melted"}, {"helpful": 1, "rating": "5", "body": "Tastes good!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Seriously smooth and silky chocolate at just the right level of darkness. Highly recommended.", "title": "Smooth and Delicious"}, {"helpful": 0, "rating": "3", "body": "I like dark chocolate but this is DARK chocolate. Too much for me and I'd say for most people", "title": "Three Stars"}, {"helpful": 0, "rating": "5", "body": "My wife's favorite, and it was less expensive through Amazon Prime than we can get locally.", "title": "Good chocolate."}, {"helpful": 0, "rating": "5", "body": "I have tried higher percentages and don't find them tasty.  The 72% is just fine for me!", "title": "Very good"}, {"helpful": 0, "rating": "4", "body": "I think I like Trader Joe's 72% dark chocolate better, but I wanted to give this a try.", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "Everyone should have a daily bite of dark chocolate.  Great additions to gifts.", "title": "Never enough dark chocolate!"}, {"helpful": 0, "rating": "5", "body": "Goes great with coffee! Don't forget your HEALTHY flavonoids and anti-oxidants!", "title": "Should be a food group"}, {"helpful": 0, "rating": "5", "body": "I love dark chocolate, I love Ghirardelli so this is a match made for me.", "title": "Great chocolate"}, {"helpful": 0, "rating": "4", "body": "Really good for those that love chocolate but can't have too much sugar.", "title": "Really good for those that love chocolate but can't have too much sugar."}, {"helpful": 0, "rating": "5", "body": "Arrived on hot, hot day.  When I opened box the bars were cool. Awesome.", "title": "When I opened box the bars were cool. Awesome"}, {"helpful": 0, "rating": "5", "body": "Very good and we like it. Best price only find it lower rarely on sale.", "title": "Best price"}, {"helpful": 0, "rating": "5", "body": "Excellent for dark chocolate lover for part of Valentine's day gifts", "title": "Excellent for dark chocolate lover"}, {"helpful": 0, "rating": "5", "body": "My favorite dark chocolate!  One square a night and all is well.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Great treat for all occasions, especially when recouperating !!!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Very satisfying taste, smooth and rich without excessive sugar.", "title": "Dark Chocolate Delight"}, {"helpful": 1, "rating": "5", "body": "Baking with these are great for the purity of chocolate. Hoping to make a mousse with just water - fills the need for good chocolate.", "title": "72% Dark Chocolate Bar"}, {"helpful": 0, "rating": "5", "body": "Very good dark chocolate.  I would recommend this dark yummy chocolate to anyone.  This is not bitter like some of the other dark chocolates.", "title": "Mmmmmmmmmmm"}, {"helpful": 0, "rating": "5", "body": "This is really wonderful chocolate and it helps keep me on my diet. I can have a piece of this and not crave massive sweets like I usually do.", "title": "So yummy"}, {"helpful": 0, "rating": "5", "body": "nice flavor if it lowers cholesterol that's a bonus", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "It's chocolate so how can it get bad reviews. Just keep in mind that this is the large bars, not individually wrapped pieces.", "title": "It's chocolate."}, {"helpful": 0, "rating": "5", "body": "It will make your tongue slap your brains out.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Delicious. Bought with a coupon and Subscribe and Save... totally worth the money. Place in the fridge for extra crunch.", "title": "delicious"}, {"helpful": 0, "rating": "5", "body": "I use dark chocolate in most recipes so I buy this in bulk. Melts nicely, Also good just for snacking.", "title": "Great for cooking and great price"}, {"helpful": 0, "rating": "5", "body": "Very satisfying taste, smooth and rich without excessive sugar.", "title": "Dark Chocolate Delight"}, {"helpful": 0, "rating": "5", "body": "Got great price. And tastes really good. Not very sweet, just enough. Not bitter at all.", "title": "Great tasting chocolate."}, {"helpful": 0, "rating": "5", "body": "Great treat for all occasions, especially when recouperating !!!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Yummy one of the best tasting 72% bars I have tasted.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Nothing to dislike here. This stuff, in moderation, is very good for you. Tastes great, too. Would buy it again.", "title": "A Chocolate Lovers Dream"}, {"helpful": 0, "rating": "5", "body": "Good stuff for a low-carb diet like Atkins.", "title": "Anti-oxidants rule!"}, {"helpful": 0, "rating": "5", "body": "One of my favorite!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Very good chocolate", "title": "I love chocolates."}, {"helpful": 0, "rating": "5", "body": "got to love those bars", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Great chocolate.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Bought this numerous times, quite good", "title": "Five Stars"}, {"helpful": 0, "rating": "4", "body": "if you prefer dark, this might be too sweet, but tasty", "title": "if you want more to the sweet side, but not too sweet, you will enjoy"}, {"helpful": 0, "rating": "5", "body": "excellent and healthy in moderation", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Great price. Fast delivery. THANKS", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "This is a perfect dark chocolate!!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "62% chocolate, what's not to love?", "title": "what's not to love?"}, {"helpful": 0, "rating": "5", "body": "as advertised and hipped quickly", "title": "Five Stars"}, {"helpful": 0, "rating": "1", "body": "they all came broken into pieces", "title": "Good but broke up"}, {"helpful": 0, "rating": "5", "body": "great chocolates at good price.", "title": "Five Stars"}, {"helpful": 0, "rating": "4", "body": "The Chocolate was very good!!", "title": "Good  chocolate"}, {"helpful": 0, "rating": "1", "body": "I either got a fake or Ghirardelli really screwed things up.", "title": "Terrible chocolate. It tastes very little like chocolate.."}, {"helpful": 0, "rating": "4", "body": "good deal for dark chocalate", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "Great Product Great Seller", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "great!  My wife loves it!", "title": "great chocolate!"}, {"helpful": 0, "rating": "5", "body": "Excellent, will reorder", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Yummy and arrived soon", "title": "72% is Best"}, {"helpful": 0, "rating": "5", "body": "got to love those bars", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Exactly as described", "title": "Yumm"}, {"helpful": 0, "rating": "5", "body": "Excellent chocolate", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "One of my favorite!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Very good chocolate", "title": "I love chocolates."}, {"helpful": 0, "rating": "5", "body": "LOVE DARK CHOCOLATE", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Just what I wanted", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Absolutely yummy!", "title": "Five Stars"}, {"helpful": 0, "rating": "3", "body": "product was fine.", "title": "Three Stars"}, {"helpful": 0, "rating": "5", "body": "Great chocolate.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Love this bar!", "title": "Favorite chocolate bar"}, {"helpful": 0, "rating": "5", "body": "Its delicious.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "I am happy. ;)", "title": "I am happy. ;)"}, {"helpful": 0, "rating": "5", "body": "Excellent!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Taste good", "title": "Taste good!"}, {"helpful": 0, "rating": "5", "body": "I like it!", "title": "Excellent!"}, {"helpful": 2, "rating": "5", "body": "Dark chocolate at its' best.  One square will quench the craving, but you WILL eat two ( or more). I would certainly buy these again.", "title": "Me like !!!"}, {"helpful": 0, "rating": "5", "body": "it s a good taste and it has  70% cocoa  which in fact it has been proven its healthy  it stimulates your endorhins,  a souce of anti", "title": "good tste"}, {"helpful": 0, "rating": "5", "body": "Is there is nothing bad to say about delicious, dark chocolate. We have bought this many times, and enjoyed it.", "title": "Gherardelli Chocolate Intense Dark Bar, Twilight"}, {"helpful": 0, "rating": "5", "body": "I prefer the chocolate with nuts or fruit but this is good dark chocolate. Not bitter. I eat a bit at night and it provides a healthy and self nurturing end to the evening meal.", "title": "Yummy"}, {"helpful": 0, "rating": "3", "body": "72% cacao solids? Really? It didn't impress me at all. I think this is just marketing talk. These bars (x6) didn't taste like much of anything, really. I wasn't impressed.", "title": "Honestly, this stuff is not that good"}, {"helpful": 0, "rating": "5", "body": "Being a big fan of dark chocolate I couldn't  resist trying this and I didn't regret it. Taste great and not bitter like so other 70%+ dark chocolates I've tried.", "title": "Tastes Great"}, {"helpful": 1, "rating": "5", "body": "Dark. Chocolate. What's not to like?", "title": "What's not to like?"}, {"helpful": 0, "rating": "2", "body": "What they are selling is \"bitter sweet\" chocolate.  Because latest health reports speak of the benefits of this 72 % cacao chocolate, I purchased it.  Whether or not I cancel future orders will depend on whether or not it adds significantly to my feeling better.  If I see no difference, I'll be putting a stop on my reorders....", "title": "A little too bitter for my taste to continue buying it.  I'll keep the remaining bars but will not be purchasing any more of it."}, {"helpful": 1, "rating": "5", "body": "dark chocolate. need I say more?", "title": "dark chocolate. need I say more?"}, {"helpful": 0, "rating": "5", "body": "What can I say....it's Ghiradelli.  The dark chocolate is good for you and subscribe & save is going to keep it coming at a very good price.", "title": "Chirardelli chocolate"}, {"helpful": 0, "rating": "1", "body": "Really awful. I got it because it's sugar-free, but I'll never eat all of it - upsets my stomach and tastes like chalk.", "title": "If it's chocolate, just get the real thing!"}, {"helpful": 0, "rating": "4", "body": "I eat dark chocolate daily and these bars are priced reasonably.  Keep in the fridge until opened and you'll be glad you have them.", "title": "Delicious and priced right"}, {"helpful": 0, "rating": "3", "body": "It is not a good idea to order chocolate to be sent by mail. It melts and then it is not very good.", "title": "Don't order by mail"}, {"helpful": 1, "rating": "5", "body": "Fabulous, my favorite!", "title": "my favorite!"}, {"helpful": 0, "rating": "5", "body": "except don't buy it cuz then you have 6 chocolate bars and you eat 6 chocolate bars. #thestruggle", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "yummy", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Hi thee greatest dark chocolate going. The best chocolate you will ever buy. Youwill have to buy more than 1 bar.", "title": "Chiradelli Choc. 72%cacao"}, {"helpful": 0, "rating": "5", "body": "Very strong chocolate taste.  I feel like I am doing something good for my health when I eat this chocolate.", "title": "Good for you"}, {"helpful": 1, "rating": "5", "body": "Yum.!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "We use it in sauces and to eat. Love the intense dark flavor. Great with strawberries and red wine dessert", "title": "Great chocolate"}, {"helpful": 0, "rating": "5", "body": "This is the one I really like the best.  It's not bitter and it makes my wife happy.", "title": "Cha-Ko-Let"}, {"helpful": 0, "rating": "5", "body": "This is good for me - I like the semi bitter taste and lack of major sugar.  Decent price as well.", "title": "Great Taste, low sugar"}, {"helpful": 0, "rating": "5", "body": "really good price for excellent health food.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Tasty big squares 'o chocolate.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Good chocolate for dark chocolate lovers.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "I love these and order them monthly", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "I love this chocolate!#", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Yum! multiple uses.", "title": "Yum"}, {"helpful": 0, "rating": "4", "body": "Yummy chocolate", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "Great dark chocolate.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "very  enjoyable", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "a favorite", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Perfect for me.", "title": "Five Stars"}, {"helpful": 0, "rating": "4", "body": "Good one", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "Excellent!!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "wonderful!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "A+++", "title": "Five Stars"}, {"helpful": 0, "rating": "1", "body": "I either got a fake or Ghirardelli really screwed things up.", "title": "Terrible chocolate. It tastes very little like chocolate.."}, {"helpful": 0, "rating": "4", "body": "yummy！and i think the price is quite good .maybe i will get more after i eat all of 12 bars", "title": "nice"}, {"helpful": 0, "rating": "1", "body": "When I worked for United Airlines for many years, I went to SFO often, and often purchasing this brand of chocolate. What I got then was a very good version of chocolate, its not having much if any competitions from elsewhere. Today's version has no taste whatsoever, relative to what you can get in your local grocery store. Don't know what happened, but this may taste reasonable if you have had nothing but Hershey's....", "title": "NOT The Ghirardelli I remember"}, {"helpful": 0, "rating": "4", "body": "yummy！and i think the price is quite good .maybe i will get more after i eat all of 12 bars", "title": "nice"}, {"helpful": 5, "rating": "4", "body": "Lindt is a great chocolate bar, but one should be wary of which Lindt bar you choose if you are also seeking the health benefits of eating chocolate.", "title": "Great Chocolate Bar"}, {"helpful": 1, "rating": "5", "body": "The 100g (3.5 oz) bars of Lindt Excellence Chocolate labeled simply as, \" 70% Cocoa Smooth Dark\", \"85% Cocoa-Extra Dark\", \"90% Cocoa-Supreme Dark\", and \"99% Cocoa Dark-Noir\" on their black and white cardboard labels have been *my* go-to chocolates for dessert for more than 5 years. Although dairy and salt are not added, the labels do state, \"may contain traces of... milk....\"  I've NO need to swallow Lactaid caplets.  I pair a small rectangle of the smooth sweetest bar (70%) with a similar piece from one of the other three; my spouse pairs a rectangle w/ Cab or Merlot wines. As you've guessed, the sweetness decreases and the chocolate taste intensifies as the cocoa percentage increases. The 70% is not cloyingly sweet & I do not find any of these bitter. Unfortunately, DAIRY IS ADDED to ALL OTHER Lindt Excellence chocolates, including 50% cocoa, chili, sea salt, citrus flavors, almond, etc. BTW, I was not paid in any way to promote this delicious product : )", "title": "_FOUR_ Lindt Dark Chocolate bars that adult-onset lactose Intolerant GI systems may enjoy together"}, {"helpful": 0, "rating": "5", "body": "Great dark choco with a bittersweet edge to it", "title": "great taste and quality"}, {"helpful": 0, "rating": "5", "body": "Excellent service, great chocolate.", "title": "Five Stars"}, {"helpful": 9, "rating": "5", "body": "I am not sure why so many folks are so bitter about this chocolate. I might not be a chocolate expert, but I definitely love good Swiss chocolate and I think this product is great (even though it is made in the USA - by a Swiss company). This stuff tastes great, is not too bitter for a 70% bar and gives me my chocolate fix without sending me into a sugar shock. The reason it melts in warm weather is because it is real chocolate - that's what it does. Anyhow, wanted to put in a good word for my favorite snack.", "title": "I like it!"}, {"helpful": 2, "rating": "5", "body": "I don't know what the low raters are whinging about but I know chocolate. I've had chocolate from all over the world and can tell you this is QUALITY chocolate. The price, calories and fat content nearly killed me. But that's beside the point. I got the 70% and it is wonderful. Enough cocao to be healthy but not so much you want to spit your teeth out.", "title": "70% Chocolate; 100% Heaven"}, {"helpful": 0, "rating": "4", "body": "As an experiment, my family conducted a taste test of six different 70-90% chocolate bars. We concluded that the 85+% were a little too dark for our tastes. In the 70% range, Lindt's came in second place, behind only the 72% Godiva bar. The Godiva is slightly more dark tasting, if you know what I mean, and the Lindt's is slightly smoother. I making this review 4 stars only so I can delineate between it and the Godiva bar. Both are very smooth and delicious, so you can't really go wrong with either.", "title": "Came in 2nd in taste test"}, {"helpful": 0, "rating": "5", "body": "Love this 70 % cocoa chocolate as much as life itself!! Arrived with cold packs (reusable) to prevent melting in transit as well as intense insulation. My local Safeway charges $3.99 per bar. This case is $2.41 per bar. Score !!!!!! This is now a permanent part of my survival. The pig-out continues. I will be hiding these from my husband whose middle name is \"whole package\". I share with him when I eat, bit by bit.", "title": "Sublime Chocolate ! Packaged Perfectly, Awesome Price !!"}, {"helpful": 1, "rating": "4", "body": "I really SHOULD give this 5 stars, but the truth is, I don't LOVE dark chocolate.  But I love chocolate.  This is vegan, believe it or not (other Lindt bars that are higher in cocoa are also vegan).  That's why I purchased.  The good thing is that it will satisfy a chocolate craving without needing to eat a large quantity.  I still miss milk chocolate, but I won't go into all the reasons I'm vegan in this review.", "title": "VEGAN!"}, {"helpful": 0, "rating": "5", "body": "Very happy with this chocolate.  It's really delicious and is just the right amount of sweetness.  The packing was fantastic....tons of padding and a couple of cool packs.  The bars arrived in perfect condition.  Highly recommend!", "title": "Wonderful!"}, {"helpful": 0, "rating": "5", "body": "a very fine chocolate which is smooth, just bitter enough, and great for just eating and baking. i just rec'd this in the mail and i could not be more pleased.  i am a caterer and  i use this chocolate a lot.  i find the chocolate from Amazon is much fresher than buying it a store.  there is a big difference in texture and quality when the chocolate is fresh.  outstanding.  highly recommend.", "title": "one of the best"}, {"helpful": 0, "rating": "5", "body": "This is very good chocolate.  I am on a very low-carb diet, so I can't have much sugar.  But I love chocolate.  This has a high cocoa content and just enough sugar to bring out the chocolate taste.  Each square is 10 grams of chocolate (just right for a good \"taste\" - I let nibbles melt on my tongue) with only 3 grams of sugar per square. I ordered it in cool weather, not the summer, and it arrived fine.", "title": "great"}, {"helpful": 0, "rating": "5", "body": "Love this chocolate as it only has a few grams of sugar.  This is my \"treat\" when I want something not to sweet but very creamy and chocolaty.  I am try to lose a few pounds and I don't feel guilty after eating a couple of squares of this chocolate as it is only has 6 net grams of sugar.", "title": "Now I don't have to do without chocolate."}, {"helpful": 0, "rating": "4", "body": "This is my second order for Lindt Dark Chocolate 70% Cocoa, 3.5 ounce package of 12. After ordering the first order of Lindt Dark Chocolate 70%, we found the excellant taste and flavor of this product is and will more than likely continue to be ordered. Good chocolate!", "title": "Lindt Excellence Dark Chocolate 70% Cocoa, 3.5-Ounce Packages (Pack of 12)"}, {"helpful": 1, "rating": "1", "body": "I'm trying to eat healthier so I bought these.  Uck.  For me, they are definitely not something you can just eat like a candy bar.  I may try using them in some home-made ice cream, but that may be too much work.  One other problem ... I think they were adversely affected by the weather, during transit.  The bars are discolored and they look like they melted.", "title": "Uck!"}, {"helpful": 2, "rating": "2", "body": "second time I ordered.....they are old-tasting. They have lost flavor and are brittle. Perhaps they have been at too high of a storage temperature. Good luck!", "title": "beware"}, {"helpful": 0, "rating": "5", "body": "Perfect balance of rich smooth cocoa and a hint of sweet.  Avoid cold drinks while enjoying this chocolate else it will not melt in your mouth.  Goes great with your favorite whiskey or brandy, served neat.", "title": "Perfect balance of rich smooth cocoa and a hint of sweet."}, {"helpful": 1, "rating": "5", "body": "Great taste and 70% cocoa which is good for your health. Everyone should have some chocolate every day for good health!!", "title": "great taste"}, {"helpful": 1, "rating": "5", "body": "Arrived super packed for freshness, and boy did it make a difference in taste.", "title": "Way more fresh than buying from the supermarket or club..."}, {"helpful": 1, "rating": "2", "body": "Great chocolate but expiration date is only a couple months out for a 12 pack.", "title": "expiration date close"}, {"helpful": 0, "rating": "4", "body": "This is my second order for Lindt Dark Chocolate 70% Cocoa, 3.5 ounce package of 12. After ordering the first order of Lindt Dark Chocolate 70%, we found the excellant taste and flavor of this product is and will more than likely continue to be ordered. Good chocolate!", "title": "Lindt Excellence Dark Chocolate 70% Cocoa, 3.5-Ounce Packages (Pack of 12)"}, {"helpful": 9, "rating": "5", "body": "I am not sure why so many folks are so bitter about this chocolate. I might not be a chocolate expert, but I definitely love good Swiss chocolate and I think this product is great (even though it is made in the USA - by a Swiss company). This stuff tastes great, is not too bitter for a 70% bar and gives me my chocolate fix without sending me into a sugar shock. The reason it melts in warm weather is because it is real chocolate - that's what it does. Anyhow, wanted to put in a good word for my favorite snack.", "title": "I like it!"}, {"helpful": 0, "rating": "5", "body": "the best chocolate for snacking.  satisfying to your sweet tooth but not too heavy in calories", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Best dark chocolate ever. Melts in your mouth delicious.", "title": "Can't Beat Lindt"}, {"helpful": 0, "rating": "5", "body": "Taste good good size to carry on", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "was a gift - receipient was pleased", "title": "Kindt dark chocilate"}, {"helpful": 0, "rating": "5", "body": "Soo good!!!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Love this chocolate. Great price too", "title": "Delicious"}, {"helpful": 0, "rating": "5", "body": "Really good dark chocolate! The best I've had.  And its pretty good for you so eat yum eat yum!", "title": "Five Stars"}, {"helpful": 0, "rating": "1", "body": "All of them melted.", "title": "One Star"}, {"helpful": 0, "rating": "5", "body": "Really good dark chocolate! The best I've had.  And its pretty good for you so eat yum eat yum!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "the best chocolate for snacking.  satisfying to your sweet tooth but not too heavy in calories", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Absolute favorite! I buy them on a regular basis. They are sooth and creamy. Not waxy at all", "title": "Wonderful dark chocolate"}, {"helpful": 0, "rating": "5", "body": "Box was open when it was reached however count is complete. No issues. Great product.", "title": "Great product."}, {"helpful": 0, "rating": "5", "body": "These are an excellent dark chocolate for the price; very smooth; great taste.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Just love it. Hope someday international shipping is available!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Best dark chocolate ever. Melts in your mouth delicious.", "title": "Can't Beat Lindt"}, {"helpful": 0, "rating": "5", "body": "Great product.  As advertised.  Delivered as promised.", "title": "Five Stars"}, {"helpful": 3, "rating": "1", "body": "I thought everyone was overeacting. I WAS WRONG!!!!!!!! This is the worst chocolate. Tastes like lard. Please do not waste your money. You cannot send it back.", "title": "They have ruined a great product"}, {"helpful": 6, "rating": "1", "body": "They will send you 70% cocoa lindt chocolate but it has a \"new recipe\".  It's 30 calories more a serving, all sugar, and takes like crappy milk chocolate you'd get in a cheap easter bunny.  Has none of the cocoa bite that it used to.  This is kind of sad, since this chocolate used to be the best readily available dark chocolate on the market.", "title": "wrong product"}, {"helpful": 0, "rating": "1", "body": "Expiration date a few months later.  Old inventory.", "title": "One Star"}, {"helpful": 0, "rating": "4", "body": "Satisfied.  Howver, we prefer it is 78%Cocoa", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "Very, very good.  My daily indulgence.", "title": "very good. My daily indulgence"}, {"helpful": 0, "rating": "5", "body": "Delicious just like you would expect.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Love this chocolate. Great price too", "title": "Delicious"}, {"helpful": 0, "rating": "4", "body": "Who does not like dark chocolate :)!", "title": "Who does not like dark chocolate :)!"}, {"helpful": 0, "rating": "5", "body": "was a gift - receipient was pleased", "title": "Kindt dark chocilate"}, {"helpful": 0, "rating": "5", "body": "Excellent flavor and packaged well.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Taste good good size to carry on", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Love this chocolate very smooth", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Wonderful, very well packaged.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Great price, great product!", "title": "Bet buy in chocolates"}, {"helpful": 0, "rating": "5", "body": "Wife Loves this cocoa bars", "title": "Five Stars"}, {"helpful": 0, "rating": "4", "body": "very good dark choclate", "title": "good 70% chocolate"}, {"helpful": 0, "rating": "1", "body": "All of them melted.", "title": "One Star"}, {"helpful": 0, "rating": "5", "body": "excellent product", "title": "Five Stars"}, {"helpful": 0, "rating": "4", "body": "Very very good.", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "Great stuff.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Soo good!!!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Excellent", "title": "Five Stars"}, {"helpful": 2, "rating": "5", "body": "One of the few Vegan chocolate bars I have found and these are Excellent!  Very creamy and smooth.  Some are too dark for me but these are perfect.", "title": "Excellent, Creamy and VEGAN"}, {"helpful": 0, "rating": "5", "body": "Perfect balance of rich smooth cocoa and a hint of sweet.  Avoid cold drinks while enjoying this chocolate else it will not melt in your mouth.  Goes great with your favorite whiskey or brandy, served neat.", "title": "Perfect balance of rich smooth cocoa and a hint of sweet."}, {"helpful": 0, "rating": "5", "body": "Excellent, I also purchased the 90% but I preferred the 70%. This is REAL, not that diluted milk chocolate.", "title": "great when you need the fix"}, {"helpful": 0, "rating": "5", "body": "Very good product. Price can vary from one seller to another so check closely.", "title": "Five Stars"}, {"helpful": 0, "rating": "4", "body": "Good but a little bitter.  Brittle does not break at lines very well.", "title": "Good"}, {"helpful": 0, "rating": "5", "body": "fine for eating", "title": "Five Stars"}, {"helpful": 3, "rating": "1", "body": "I thought everyone was overeacting. I WAS WRONG!!!!!!!! This is the worst chocolate. Tastes like lard. Please do not waste your money. You cannot send it back.", "title": "They have ruined a great product"}, {"helpful": 6, "rating": "1", "body": "They will send you 70% cocoa lindt chocolate but it has a \"new recipe\".  It's 30 calories more a serving, all sugar, and takes like crappy milk chocolate you'd get in a cheap easter bunny.  Has none of the cocoa bite that it used to.  This is kind of sad, since this chocolate used to be the best readily available dark chocolate on the market.", "title": "wrong product"}, {"helpful": 1, "rating": "1", "body": "Melts and spoils in shipping. Very disappointing in texture and flavor. You're better off buying this locally at full retail.", "title": "Does not travel well"}, {"helpful": 1, "rating": "1", "body": "What a surprise when I only received 3 bars total!  The seller blamed it on Amazon putting in the wrong information.  The ad was marked as sold out for a few days.  Yesterday I was checking and the same ad was back on.  When I contacted the seller they again blamed Amazon.  They were again offering a pack of 12 for $[...].  Today they have changed it to a pack of 12 for $[...].  I will be keeping a close eye on them and hope you do too!  An honest seller would have checked their listing and honored their ad. They are saying that Amazon confused thier listing with other sellers of this same product.  They are the only ones selling Lindt Excellence Dark Chocolate 70-Percent Cocoa Bars, 3.5-Ounce Bars (Park of 12).  How could Amazon have gotten this confused! The seller should always check their listing.", "title": "Misrepresentation and blaming others."}, {"helpful": 0, "rating": "5", "body": "Bought it for my sister-in-law as a Christmas presents. She's a GODIVA fiend and loved it. She got her chocolate fix and I got to look good finally getting a gift she couldn't help but like", "title": "When is chocolate ever a bad choice?"}, {"helpful": 0, "rating": "5", "body": "This is good tasting chocolate.  If you want a treat, then try this one out when you want a small reward for a job well done.", "title": "Good chocolate!"}, {"helpful": 0, "rating": "2", "body": "A bit waxy and not nearly up to normal Godiva taste quality.", "title": "Not very good chocolate"}, {"helpful": 0, "rating": "5", "body": "good. as advertised  shipped on time", "title": "Five Stars"}, {"helpful": 0, "rating": "3", "body": "I though it would be best candy ever.  hersheys is better  and a lot cheaper", "title": "Three Stars"}, {"helpful": 8, "rating": "5", "body": "Great flavor and texture; not too sweet. \"Cocoa solids 56% min.\"  Real chocolate, no PGPR. 1/2 bar = 145 cal.", "title": "Excellent"}, {"helpful": 6, "rating": "4", "body": "This was good chocolate and a good value but it was not fantastic as other reviewers had rated. It tasted too much like general store brand semi sweet morsels rather than fine dark chocolate. Love Trader Joes generally but not this time", "title": "Good but not great"}, {"helpful": 2, "rating": "5", "body": "I don't eat chocolate. Females in the house had a feeding frenzy with these.", "title": "For dark chocolate fiends"}, {"helpful": 1, "rating": "5", "body": "Great value...the chocolate flavor is amazing. I eat an entire bar in one sitting.....sooo good! I would buy them again.", "title": "Wonderful value and great product"}, {"helpful": 0, "rating": "5", "body": "Item delivered on time, was as described,", "title": "Five Stars"}, {"helpful": 0, "rating": "2", "body": "I really expected more for the price.", "title": "Nothing Special"}, {"helpful": 0, "rating": "5", "body": "Trader Joe's Chocolate rocks", "title": "Trader Joe's chocolate"}, {"helpful": 0, "rating": "5", "body": "very tasty need more soon", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "very good chocolate.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Makes a great gift", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Good stuff.", "title": "Good deal."}, {"helpful": 0, "rating": "1", "body": "chocolate is stale and hard. did not eat", "title": "One Star"}, {"helpful": 0, "rating": "5", "body": "Good chocolate. good price.", "title": "Good and Good"}, {"helpful": 1, "rating": "2", "body": "Disappointing: chalky mouth feel, overly sweet taste lacking any complexity.", "title": "overly sweet taste lacking any complexity"}, {"helpful": 2, "rating": "5", "body": "This was very dark chocolate. I could not eat very much at on time.  Just wish they had peanut butter in them.", "title": "Very rich"}, {"helpful": 0, "rating": "5", "body": "Good candy to buy in bulk. I like to pair the special dark kisses with Hershey's peppermint candy cane kisses; the latter is a seasonal candy only sold around Christmas and requires stocking up.", "title": "Special Dark Kisses +  Peppermint Kisses = Delicious"}, {"helpful": 1, "rating": "5", "body": "Hershey's Dark Chocolate Kisses is a perfect food.  I could live off these.  I love dark chocolate, but didn't know I could eat several (ok, a handfull) at a time.  Yes, they are that good.  Addicting.  I finally had to hide them from myself for a while so I'd stop eating them non-stop.  They are beyond amazing.  So, if you like dark chocolate, you will love these.  I really wish I didn't love these so much.  They are excellent.", "title": "Hershey's Dark Chocolate Kisses is a perfect food. I could live off these"}, {"helpful": 2, "rating": "5", "body": "Dark chocolate is supposed to be healthy in small amounts.  Hubby has taken to storing them", "title": "Healthy dark chocolate."}, {"helpful": 2, "rating": "5", "body": "I found that since I determined I had a problem with milk chocolate I switched to dark chocolate.  It is great and no more problems. will continue since I found that Amazon carries the dark chocolate I will continue to buy it from Amazon.", "title": "Wonderful product."}, {"helpful": 1, "rating": "5", "body": "Okay, how does someone go wrong with the Party Bag of Dark Chocolate Kisses??!! They are what they are and go quickly out of my candy jar on my desk at work. I mix them with Wether's so i have the perfect Purple & Gold combo for JMU! Go Dukes!", "title": "Best prize value around"}, {"helpful": 3, "rating": "5", "body": "Great price on hard to find party bag size. Tastes good, will last a long time and healthier than milk chocolate.", "title": "Hershey dark chocolate party bag"}, {"helpful": 5, "rating": "5", "body": "The recipient was thrilled with the idea that Hershey’s Special Dark chocolate came in the kisses size.  She is a huge Hershey’s fan. If mom's happy then everybody's happy.  'Nuf said.", "title": "A sweet surprise."}, {"helpful": 0, "rating": "5", "body": "My wife and kids say this is a good product, the really enjoy them.  It was nice to get them at a good price.  Met all my expectations.  Will buy again.", "title": "Like the product"}, {"helpful": 0, "rating": "5", "body": "Husband's favorite  adding another review  just received our 5th purchase and it arrived packed so nice with isolation and ice  packs so not to melt  how cool is that", "title": "yummmmm"}, {"helpful": 0, "rating": "5", "body": "We keep a secret \"stash\" of these in our office...love them.  Small, simple...just the right dose of dark chocolate after a stressful day.  Two thumbs up!", "title": "Great buy, great chocolate, happy employees!"}, {"helpful": 0, "rating": "5", "body": "Husband's favorite  adding another review  just received our 5th purchase and it arrived packed so nice with isolation and ice  packs so not to melt  how cool is that", "title": "yummmmm"}, {"helpful": 3, "rating": "5", "body": "Love Special Dark Chocolate!  These are haaaaard to find locally except maybe on the 'high holidays.'", "title": "Five Stars"}, {"helpful": 2, "rating": "5", "body": "One can never go wrong with Hershey kisses.  Yummmm", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "These are great dark chocolate Hershey's kisses. Better than the milk chocolate ones. Great snack. Also good for table favors for the holidays.", "title": "Better than milk chocolate kisses"}, {"helpful": 0, "rating": "5", "body": "We keep a secret \"stash\" of these in our office...love them.  Small, simple...just the right dose of dark chocolate after a stressful day.  Two thumbs up!", "title": "Great buy, great chocolate, happy employees!"}, {"helpful": 0, "rating": "4", "body": "Just the right touch of sweetness to end a meal, with the benefit of the dark chocolate.", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "dark chocolate kisses, packed too stay cool during shipping, how could I not be happy?", "title": "dark chocolate kisses...'nuff said"}, {"helpful": 0, "rating": "5", "body": "My wife really loves this dark chocolates, she like dark chocolates very much and this fits the bill.", "title": "Try it you will like it."}, {"helpful": 2, "rating": "1", "body": "The chocolate was incredibly stale. I was afraid to eat it.", "title": "One Star"}, {"helpful": 0, "rating": "5", "body": "love these, very creamy, with a little bite.", "title": "Five Stars"}, {"helpful": 0, "rating": "3", "body": "I love the purple packaging. I use these mixed with the milk chocolate in the silver wrapping in my Christmas gifts. Very pretty.", "title": "Love the purple foil!"}, {"helpful": 1, "rating": "5", "body": "I Love The Dark Chocolate.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "In controllable sizes when you need a chocolate fix but don't dare open a whole bar!", "title": "Yummy"}, {"helpful": 0, "rating": "5", "body": "My favorite Hershey chocolate.", "title": "reminds me of chocolate pie."}, {"helpful": 0, "rating": "5", "body": "OMG!!! what's not to love!", "title": "what's not to love!"}, {"helpful": 0, "rating": "5", "body": "Excellent way to get one's daily dose of tasty dark chocolate and antioxidants. I'll order again next Christmas.", "title": "Delicious!"}, {"helpful": 0, "rating": "5", "body": "Tasted yummy.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Yummy! Perfect!", "title": "Chocolicious!"}, {"helpful": 0, "rating": "5", "body": "Hard to find in stores the taste compares with expensive dark chocolate. Great Deal and product.", "title": "Great Deal and product"}, {"helpful": 0, "rating": "4", "body": "It's a good value to purchase in bulk over the regular store sizes.", "title": "Great dark chocolate"}, {"helpful": 0, "rating": "5", "body": "Great price and got it just before the price increases due to the cocoa crop problems.", "title": "Good for my Heart"}, {"helpful": 0, "rating": "5", "body": "good candy. Hard to eat just one", "title": "Chocolate is good for you!"}, {"helpful": 0, "rating": "5", "body": "It's Hershey Kisses and dark chocolate...what's not to love about it.  The party bag is a great value.  At the time of my purchase, the price was on par with Walmart.", "title": "Kisses + Dark Chocolate = Awesome"}, {"helpful": 0, "rating": "5", "body": "Worth every cent", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "dark", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Great value and they came packaged very well with ice packs so they didn't melt.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Sent to my husband in Afghanistan and the troops loved them and have requested more.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "They are Kisses. You know how good they are.", "title": "You know how good they are"}, {"helpful": 0, "rating": "5", "body": "Wonderful dark chocolate. Fresh and tasty!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Loved dark chocolate. These are the perfect size.", "title": "Dark chocolate Kisses"}, {"helpful": 0, "rating": "5", "body": "Worth every cent", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "great dark chocolate. not bitter", "title": "Five Stars"}, {"helpful": 0, "rating": "3", "body": "I didn't like as well but they were good", "title": "Three Stars"}, {"helpful": 0, "rating": "5", "body": "Good chocolate and excellent price.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "It's dark chocolate, need I say more.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "The taste is wonderful", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "dark", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Mom lives dark chocolate so perfect gift.", "title": "Hershey kiss"}, {"helpful": 0, "rating": "5", "body": "Big hit at wedding", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "My wife loves these kisses.", "title": "Wonderfull taste"}, {"helpful": 0, "rating": "5", "body": "a", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Good Kisses!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Who doesn't like chocolate? This chocolate is dark (good for you) and is individually wrapped in bite size pieces.", "title": "Sweet treat that's good for you!"}, {"helpful": 0, "rating": "5", "body": "Seriously came in the perfectly sized insulated box with 2 ice packs (still frozen!). Not a single kiss melted while I was away at work. Extremely pleased!", "title": "Perfect!"}, {"helpful": 0, "rating": "4", "body": "as advertised.", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "Quite likely overpriced, but they got the job done, were delicious, and came in some super heavy duty refrigerated packaging.", "title": "and came in some super heavy duty refrigerated packaging"}, {"helpful": 0, "rating": "2", "body": "Price to high.", "title": "High price!"}, {"helpful": 1, "rating": "5", "body": "I Love it.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Love Hershey Kisses (Dark) & love the price & great price we received.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Getting my portion control and antioxidant fix without so much guilt.", "title": "Five Stars"}, {"helpful": 0, "rating": "2", "body": "Price to high.", "title": "High price!"}, {"helpful": 1, "rating": "5", "body": "I Love it.", "title": "Five Stars"}, {"helpful": 1, "rating": "4", "body": "I liked it", "title": "I liked it"}, {"helpful": 2, "rating": "4", "body": "will order again", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "These were for my wife and she loves them, nothing else needs to be said.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Saves my mother a few trips to the store to buy bags of these.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "I love Hershey dark chocolate kisses, they are great.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Hey ... it's chocolate.  What's not to like?", "title": "What's not to like?"}, {"helpful": 0, "rating": "1", "body": "can't get it to work  no instruction", "title": "One Star"}, {"helpful": 0, "rating": "5", "body": "I gifted it and they loved it.", "title": "Hersheys Dark kisses are great."}, {"helpful": 0, "rating": "5", "body": "Very yummy! No melted pieces", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Nice, I like dark chocolets", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "These were dark chocolate and were delicious.", "title": "Great candy"}, {"helpful": 0, "rating": "5", "body": "Can't go wrong with a party bag of dark chocolate", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "this is a sweet deal", "title": "sweeet"}, {"helpful": 0, "rating": "5", "body": "great", "title": "Five Stars"}, {"helpful": 0, "rating": "4", "body": "fine", "title": "Four Stars"}, {"helpful": 0, "rating": "2", "body": "Just what I wanted real good", "title": "Two Stars"}, {"helpful": 0, "rating": "5", "body": "Love it", "title": "Love it"}, {"helpful": 1, "rating": "3", "body": "Usually puchase these at Walmart and will do so in the future. All of the bars arrived all broken in pieces, and also prefer the 6.8 oz bars at Walmart. Pricewise due to the size of the larger bars, Walmart has the better buy. Also, no broken pieces on those as I found in each and all 12 bars that I received today.", "title": "Walmart has the better buy. Also"}, {"helpful": 2, "rating": "5", "body": "I ordered this in June, and since we were having 90degree days where I live I was a little worried about UPS delivering it and leaving it in my non-airconditioned garage (I work during the day so I wasn't able to be there when delivered).", "title": "Nicely packed for the season"}, {"helpful": 0, "rating": "5", "body": "A tasty way to put some dark chocolate in your diet.", "title": "Yummy"}, {"helpful": 0, "rating": "5", "body": "Cheaper than the grocery store.  But you have to control yourself having this many bars in the house.", "title": "Love dark chocolate."}, {"helpful": 0, "rating": "5", "body": "good deal", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Super delicious!  Lots of chocolate bar and they are big!", "title": "Super delicious! Lots of chocolate bar and they are ..."}, {"helpful": 0, "rating": "5", "body": "great", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "What can I say it's chocolate", "title": "Yummy"}, {"helpful": 0, "rating": "5", "body": "Good", "title": "Five Stars"}, {"helpful": 7, "rating": "5", "body": "Shipped fast. I love chocolate and this product is great and fresh. I would buy this product again and again and again...", "title": "Great"}, {"helpful": 2, "rating": "5", "body": "I have at least an ounce every day......love it.....and I am so healthy at 91!!!", "title": "love it."}, {"helpful": 3, "rating": "5", "body": "Our new favorite candy.  The almonds are crushed just right so there are bites throughout.  The bars are big enough for sharing without being too large and having to store leftovers.", "title": "Favorite almond-chocolate bar"}, {"helpful": 0, "rating": "5", "body": "What can I say it's chocolate", "title": "Yummy"}, {"helpful": 0, "rating": "5", "body": "Good", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Super delicious!  Lots of chocolate bar and they are big!", "title": "Super delicious! Lots of chocolate bar and they are ..."}, {"helpful": 0, "rating": "5", "body": "Cheaper than the grocery store.  But you have to control yourself having this many bars in the house.", "title": "Love dark chocolate."}, {"helpful": 0, "rating": "3", "body": "Just your standard chocolate. A little sweet for my taste if just eating chocolate and not using it in cooking or to make hot chocolate. It is not as velvety as some other better chocolates too.", "title": "A little sweet for my taste"}, {"helpful": 0, "rating": "5", "body": "When I was a kid, around 1960, my favorite candy bar was Hershey's Semi-Sweet candy bar. This item tastes exactly the same. The item was also at a favorable price when bought in quantity, which is no problem because it is the only candy product that I eat.", "title": "Childhood revisited."}, {"helpful": 1, "rating": "5", "body": "Fantastically rich and delicious.Amazongly fresh.On my love carb diet  ..this is my cheat..A 1×1 inch bite satisfies the chocolate craving completely.I would definitely purchase again", "title": "Just buy this!!"}, {"helpful": 0, "rating": "5", "body": "Of course, what could possibly be wrong with chocolate? My chocolate WAS white but I think it's because the UPS driver left it outside in the Texas hat, and then after I got them (melted) I froze them, but they still treated smashing, so I wasn't tripping.", "title": "Good chocolate"}, {"helpful": 1, "rating": "5", "body": "I had an Amazon gift card from someone I needed to use.", "title": "A sweet Deal"}, {"helpful": 0, "rating": "5", "body": "chocolate was very fresh. just wished the price was lower or they added more chocolate bars. each piece is 1.50 and that's before shipping :(", "title": "chocolate was very fresh. just wished the price was ..."}, {"helpful": 0, "rating": "5", "body": "What can I say I'm a chocolate junkie. This dark slightly sweet chocolate soothes my craving. I have a square each night after dinner. It makes my meal complete. Recommend to all chocolate lovers.", "title": "Chocolate Lovers."}, {"helpful": 0, "rating": "5", "body": "these are cheaper here than they are in the local supermarket, so that's awesome.  my mom goes absolutely ape for them, so it's pretty darned handy to just order a ton on amazon and have stoked on life in a dark chocolate dream", "title": "sweet price on mildly sweet chocolate..."}, {"helpful": 1, "rating": "5", "body": "The \"adult\" chocolate we crave.  Smooth, rich, with the richness of Hershey's, in a bar you can share.  Share? Maybe.", "title": "To share or not to share...."}, {"helpful": 1, "rating": "5", "body": "you get exactly what you pay for plus the box the send it in is insulated with icepacks in it so the bars don't melt in heat", "title": "great!!!!!"}, {"helpful": 1, "rating": "5", "body": "Good, well packaged.", "title": "Five Stars"}, {"helpful": 1, "rating": "5", "body": "Product - delicious. Seller - great. No problems with delivery or freshness of product. I like the price and experience and would recommend.", "title": "Seller - great. No problems with delivery or freshness of product"}, {"helpful": 0, "rating": "5", "body": "Great chocolate, definitely different texture and flavor than Hershey's milk chocolate IMO- harder and just slightly more bitter.  Love it.", "title": "Great chocolate, definitely different texture and flavor than Hershey's ..."}, {"helpful": 0, "rating": "5", "body": "I really appreciate that this product was perfect,and the price was Fair! Highly recommend!", "title": "Thanks again for subscribe and save items!!"}, {"helpful": 1, "rating": "5", "body": "I had an Amazon gift card from someone I needed to use.", "title": "A sweet Deal"}, {"helpful": 1, "rating": "1", "body": "Some bars (8) were stale - uneatable....", "title": "One Star"}, {"helpful": 0, "rating": "5", "body": "OK, around the world everyone recognizes a Hershey bar - and for good reason - it's among the best worldwide. And these Special Dark bars travel well, too, but Customs always wants to know \"why so many?\" so I say, So I have enough for friends, like you! And I ask them to choose one - they gladly do, and it always brings a smile. Once in country, I trade a bar for some local treat which always creates excitement. Fun, fun, fun! This is a 4.25 ounce bar containing 540 calories, 36 grams fat, 69 carbs, 45 mg sodium, and 6 grams protein.", "title": "around the world everyone recognizes a Hershey bar - and for good reason - it's among the best worldwide"}, {"helpful": 0, "rating": "5", "body": "What can I say I'm a chocolate junkie. This dark slightly sweet chocolate soothes my craving. I have a square each night after dinner. It makes my meal complete. Recommend to all chocolate lovers.", "title": "Chocolate Lovers."}, {"helpful": 0, "rating": "3", "body": "Just your standard chocolate. A little sweet for my taste if just eating chocolate and not using it in cooking or to make hot chocolate. It is not as velvety as some other better chocolates too.", "title": "A little sweet for my taste"}, {"helpful": 0, "rating": "5", "body": "Great buy, great Dark chocolate, great shipping just wish I could stay within the size guidelines. Latest shipping used UPS with insulated packing. Very good for summer delivery..", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Bought this as a gift for a dark chocolate lover. One came broken in half but other than that, perfect. I was a little worried because I ordered them in the middle of July but they were packaged well to keep them cold and they were not melted at all. The quality of the chocolate is very good, too. I am not usually a fan of Hershey's chocolate (usually chalky to me), but this stuff is GOOD! Not chalky, good flavoe, not bitter.", "title": "Great gift for dark chocolate lovers!"}, {"helpful": 1, "rating": "5", "body": "Good, well packaged.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Love this chocolate!  It's cocoa content is not quite high enough to make it totally healthy but it certainly isn't as unhealthy as a normal chocolate bar.", "title": "Love this chocolate"}, {"helpful": 0, "rating": "5", "body": "I keep these always on hand.  Wonderful feeling of security. Knowing a sweet almost coconut chocolate treat is there waiting for me when I need it.", "title": "Almost like coconut?"}, {"helpful": 0, "rating": "5", "body": "Great buy, great Dark chocolate, great shipping just wish I could stay within the size guidelines. Latest shipping used UPS with insulated packing. Very good for summer delivery..", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "I bought these as a gift for my grandma. She really loved them.", "title": "Delicious"}, {"helpful": 0, "rating": "5", "body": "My go-to treat.  I would buy better dark chocolate, but it's too expensive.  This is affordable and delicious.", "title": "I would buy better dark chocolate"}, {"helpful": 0, "rating": "3", "body": "love the candy, buy the shipping left several bars melted.", "title": "Three Stars"}, {"helpful": 0, "rating": "2", "body": "One of the bars was attached to the box and was open", "title": "Two Stars"}, {"helpful": 0, "rating": "5", "body": "I really like this chocolate. It is not too sweet or bitter. Has always been on time and usually in a cold pack. Just have to watch the price.", "title": "yum"}, {"helpful": 0, "rating": "4", "body": "Nice healthy item for carry on snack. Still adjusting to the dark chocolate bitterness, but it's a worthwhile adjustment.", "title": "Dark chocolate w/ almonds, so it's ok to buy this much."}, {"helpful": 0, "rating": "5", "body": "My daughter as happy to open these up for Christmas. .her favorite candy bar.  No problems with shipping.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "You think I'm going to write something bad about chocolate? I just wish they had a bigger box.", "title": "Five Stars"}, {"helpful": 0, "rating": "2", "body": "Chocolates arrived partially melted despite cool weather outside, and very dehydrated (white).  Not a good idea to purchase online.", "title": "Chocolates arrived partially melted despite cool weather outside"}, {"helpful": 0, "rating": "5", "body": "Great price!  AND dark chocolate... a little each night is healthy for your body!", "title": "Yummy and good for your tummy"}, {"helpful": 0, "rating": "5", "body": "makes all frowns turn upside down", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "we like to have some dark chocolate at night and this was the right amount at a perfect price!!", "title": "Yummy!!"}, {"helpful": 0, "rating": "5", "body": "Great Item! Is as described on site. purchased for my daughters adult friends for Halloween 2015. Was a hit. Highly recommend.", "title": "Great Item! Is as described on site"}, {"helpful": 0, "rating": "5", "body": "What's not to like? It's a lot of Hershey's dark chocolate. The bars are nice and big too.", "title": "12 delicious chocolate bars!"}, {"helpful": 0, "rating": "5", "body": "Sooo good! At 4 in a hour lol", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Product shipped very quickly and was exactly as advertised. The chocolate is fresh and delicious. Very satisfied customer.", "title": "Mmmmm good"}, {"helpful": 0, "rating": "5", "body": "What's not to like its chocolate but not too sweet", "title": "saves a lot of trips to store"}, {"helpful": 0, "rating": "5", "body": "Great deal, especially when it was on the flash sale. Not melted, not stale.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "The bars were delicious (of course, it's chocolate) and were much larger than I expected!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "I really like it.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Great for price", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "taste of heaven", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "I love dark chocolate.  It's my bedtime snack a couple of hours before I actually go to bed.", "title": "Great Chocolate"}, {"helpful": 0, "rating": "5", "body": "good excellent", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "I'm in love with this chocolate. It was so worth it buying the 12 pack.", "title": "Amazingly delicious chocolate"}, {"helpful": 0, "rating": "5", "body": "Arrived in time and perfectly", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Sweet treat", "title": "Hershey's Special Dark Chocolate"}, {"helpful": 0, "rating": "5", "body": "Nice price", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "GREAT!!!!!", "title": "Soo  Good"}, {"helpful": 0, "rating": "5", "body": "Everyone loves these. I bought with coupon so price better than stores", "title": "I bought with coupon so price better than"}, {"helpful": 0, "rating": "5", "body": "Better price than anywhere else, and these are really yummy chocolate.", "title": "Best price for dark chocolate anywhere!"}, {"helpful": 0, "rating": "5", "body": "So yummy!!! Friends and family all have big smiles on after eating.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Even though it's extremely unhealthy; it was completely worth it.", "title": "Greatest things EVER invented"}, {"helpful": 0, "rating": "5", "body": "I bought these as a gift for my grandma. She really loved them.", "title": "Delicious"}, {"helpful": 0, "rating": "5", "body": "I love dark chocolate, especially dark chocolate with raisins.", "title": "Good dark chocolate"}, {"helpful": 0, "rating": "5", "body": "It is soooooooooo good just so much money but it was worth it", "title": "soooo good"}, {"helpful": 0, "rating": "3", "body": "love the candy, buy the shipping left several bars melted.", "title": "Three Stars"}, {"helpful": 0, "rating": "4", "body": "Not a big fan of white chocolate , but this is delicious", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "Bought for my girl, she loved them and at a good price.", "title": "Great"}, {"helpful": 0, "rating": "5", "body": "Difficult to find in stores and always limited supply.", "title": "My hubby's favorite snack."}, {"helpful": 0, "rating": "5", "body": "Always good - it's CHOCOLATE!  Good deal thru Amazon!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "a few sticks and my craving for chocolate is satified", "title": "Five Stars"}, {"helpful": 0, "rating": "2", "body": "One of the bars was attached to the box and was open", "title": "Two Stars"}, {"helpful": 0, "rating": "5", "body": "they bumped the price up a lot after i bought it lol", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "I really like these bars and they are a good price.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "What's not to like its chocolate but not too sweet", "title": "saves a lot of trips to store"}, {"helpful": 0, "rating": "5", "body": "Hershey's is the best.  Nothing more need be said.", "title": "Hershey's is the best. Nothing more need be said"}, {"helpful": 0, "rating": "5", "body": "Came cold and none was broken, it was also good.", "title": "Yum"}, {"helpful": 0, "rating": "5", "body": "Always good and good price through Amazon.com.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "CHEAPER THAN THE GROC STORE, AND GOOD FOR YOU", "title": "AND GOOD FOR"}, {"helpful": 0, "rating": "5", "body": "Really its Dark Chocolate - Hershey's - GOOD!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Good dark chocolate flavor at budget pricing", "title": "A classic to be enjoyed all the time"}, {"helpful": 0, "rating": "5", "body": "It was full of delicious chocolaty goodness", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Great price and very good dark chocolate.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Great deal when it was on lighting deals", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Good price, Fast delivery, Wife pleased!", "title": "Surprise Gift"}, {"helpful": 0, "rating": "5", "body": "Just as expected and tastes awesome too!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Great purchase. Happy. No complaints.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Everything about this item was great.", "title": "Five Stars"}, {"helpful": 0, "rating": "3", "body": "They be perfect if made with Almonds", "title": "Three Stars"}, {"helpful": 0, "rating": "5", "body": "Always fresh and delivered on time.", "title": "Five Stars"}, {"helpful": 0, "rating": "3", "body": "Not as dark as I would have liked.", "title": "Three Stars"}, {"helpful": 0, "rating": "4", "body": "a great poroduct and a great treat", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "makes all frowns turn upside down", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Some of the best dark chocolate.", "title": "Tipically Hershey."}, {"helpful": 0, "rating": "5", "body": "Good value and fresh chocolate.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "GREAT.  Shipped in cooler box.", "title": "GREAT!"}, {"helpful": 0, "rating": "5", "body": "Great taste and great packing.", "title": "YUM"}, {"helpful": 0, "rating": "5", "body": "Sooo good! At 4 in a hour lol", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Arrived in time and perfectly", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "as advertised, timely arrival", "title": "Five Stars"}, {"helpful": 0, "rating": "4", "body": "good chocolate, we like dark.", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "on time and just as described", "title": "Five Stars"}, {"helpful": 0, "rating": "4", "body": "I love this product too much.", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "Good stuff, fast shipping.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "good deal, good chocolate", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "great price great service", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Great price and shipping", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Very good chocolate!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "great", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Hershey bar", "title": "Bitter sweet"}, {"helpful": 0, "rating": "5", "body": "GREAT THANK YOU", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Always has been one of my favorite, came quickly, not melted, tasted great.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "i love this", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "on time and just as described", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Great", "title": "Five Stars"}, {"helpful": 0, "rating": "4", "body": "yummy and fresh", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "Great price and very good dark chocolate.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Great deal", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "aaa", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "they bumped the price up a lot after i bought it lol", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "tasty", "title": "Five Stars"}, {"helpful": 0, "rating": "4", "body": "I love this product too much.", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "I like chocolate....", "title": "If you do not know Hershey's Dark chocolate... you live in a cave..."}, {"helpful": 0, "rating": "5", "body": "Delicious.", "title": "Five Stars"}, {"helpful": 0, "rating": "3", "body": "Not as dark as I would have liked.", "title": "Three Stars"}, {"helpful": 0, "rating": "5", "body": "Came cold and none was broken, it was also good.", "title": "Yum"}, {"helpful": 0, "rating": "5", "body": "Good - Good - Good", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Good stuff, fast shipping.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "great", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "taste good", "title": "Five Stars"}, {"helpful": 1, "rating": "1", "body": "Some bars (8) were stale - uneatable....", "title": "One Star"}, {"helpful": 0, "rating": "5", "body": "Very good.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "a few sticks and my craving for chocolate is satified", "title": "Five Stars"}, {"helpful": 0, "rating": "4", "body": "umm  good,real good", "title": "good"}, {"helpful": 0, "rating": "5", "body": "Great taste and great packing.", "title": "YUM"}, {"helpful": 0, "rating": "5", "body": "great price great service", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Great price and shipping", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "love it", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Ok.. lets get this party started, uh huh...", "title": "Chocolate... chocolate... chocloate.. Yummmm"}, {"helpful": 0, "rating": "4", "body": "Good lIke always", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "It was full of delicious chocolaty goodness", "title": "Five Stars"}, {"helpful": 0, "rating": "4", "body": "a great poroduct and a great treat", "title": "Four Stars"}, {"helpful": 0, "rating": "5", "body": "Very good chocolate", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Perfect.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "LOVE DARK CHOCOLATE.", "title": "BUY HERSHEY'S DARK CHOCOLATE"}, {"helpful": 0, "rating": "5", "body": "This is of course great chocolate. I was worried about the heat. We are about 40 minutes from downtown San Diego, and seem to be the last ones on delivery routes.", "title": "Still cold!"}, {"helpful": 0, "rating": "5", "body": "OK, around the world everyone recognizes a Hershey bar - and for good reason - it's among the best worldwide. And these Special Dark bars travel well, too, but Customs always wants to know \"why so many?\" so I say, So I have enough for friends, like you! And I ask them to choose one - they gladly do, and it always brings a smile. Once in country, I trade a bar for some local treat which always creates excitement. Fun, fun, fun! This is a 4.25 ounce bar containing 540 calories, 36 grams fat, 69 carbs, 45 mg sodium, and 6 grams protein.", "title": "around the world everyone recognizes a Hershey bar - and for good reason - it's among the best worldwide"}, {"helpful": 1, "rating": "5", "body": "We love these Special Dark chocolate bars and I was a little worried when I ordered them this summer. Figured they would possibly melt in transit. Imagine my surprise when I opened the box and it was insulated and had cold packs that were still mostly frozen when they arrived. Saved quite a bit buying through Amazon too.", "title": "These are the best!"}, {"helpful": 0, "rating": "5", "body": "great", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Great", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "tasty", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "great", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Delish. What more can you say about hersheys dark chocolate in a huge bar for really cheap with subscribe and save? Bought to add to holiday presents ..and myself.", "title": "Delish. What more can you say about hersheys dark ..."}, {"helpful": 0, "rating": "5", "body": "Very well packaged, including cold packs.  Other then that, what can I say, it is hershey's delicious dark chocolate.", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "It is in the 90s and you would never know that from the packaging. The insulated cold packing was pretty awesome.", "title": "Great packing even in summer"}, {"helpful": 0, "rating": "1", "body": "used to be able to get them for 24 dollars..for whatever reason..past few months cant find them for less then 30", "title": "used to be able to get them for 24 dollars ..."}, {"helpful": 0, "rating": "5", "body": "aaa", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "They even include a cold pack so they don't melt on hot days. Convenient!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "Everything Ok. Thanks!", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "k", "title": "Five Stars"}, {"helpful": 1, "rating": "1", "body": "DO NOT BUY! This bag is a small bag- you can get at CVS or grocery store for $2.49!!!! And it is not returnable! I wasted my money! Don't waste yours!", "title": "I wasted my money"}, {"helpful": 2, "rating": "1", "body": "Definitely was \"old\" chocolate.  Chocolate had a white color and tasted very stale.  Should have returned it, but it seemed too much of a hassle.", "title": "Old...stale"}, {"helpful": 0, "rating": "5", "body": "I have these set out in a candy dish at work. The dark chocolate ones always go first. Dove chocolate is smooth, delicious, and the perfect little square for an afternoon pick-me-up. Will buy again.", "title": "and the perfect little square for an afternoon pick-me-up"}, {"helpful": 1, "rating": "5", "body": "Yummy! to the tummy! Can't help but love Dove's smooth rich chocolaty taste. I had friends keep asking for more!", "title": "Yummy!"}, {"helpful": 1, "rating": "5", "body": "Only 2 a day and you have your daily dose of chocolate and 2 a day is not fattening, it has the best taste ever", "title": "Dark Chocolate"}, {"helpful": 0, "rating": "5", "body": "I use these as a treat in coffee.  Try them!  You'll love them!", "title": "You'll love them!"}, {"helpful": 0, "rating": "5", "body": "My favorite and none broken", "title": "Yummy and heathy and heahty because it is Dark Chocolate"}, {"helpful": 0, "rating": "4", "body": "Got the silky this time as a trial.  I like a little more crunch, so like the regular (was same price) better.  With the silky, put in the freezer and eat frozen.  Yum.  Best \"vitamin pill\" on the market.", "title": "I like the regular better"}, {"helpful": 0, "rating": "5", "body": "It is a bag of dark chocolate. How do you write thirteen words or more about dark chocolate? I guess I just did.", "title": "Dark Chocolate"}, {"helpful": 0, "rating": "5", "body": "So smooth and good", "title": "Five Stars"}, {"helpful": 0, "rating": "5", "body": "I like dove chocs", "title": "Five Stars"}, {"helpful": 0, "rating": "4", "body": "smooth and great taste.", "title": "great chocolate flavor."}, {"helpful": 0, "rating": "5", "body": "Its chocolate, what can be said.", "title": "Dove Silky Chocolate"}, {"helpful": 0, "rating": "5", "body": "I LOVE DARK CHOCOLATE!", "title": "TASTES YUMMY."}, {"helpful": 0, "title": "Darl choclate M & M", "rating": "4", "body": "These are just great"}, {"helpful": 0, "title": "Four Stars", "rating": "4", "body": "Tastes like milk chocolate"}]