[{"helpful": 1, "title": "Easiest 5 star review ever", "body": "I love this stuff. I have taken antibiotics every day for the past 4 years for a bacterial infection disease I was born with. About once or twice a year the Dr gives my body a break from the aggressive antibiotic therapy, but my immune system is completely shot. I full heartedly swear by this stuff. Even while on antibiotics I sometimes get sick if it's not bacterial, or when I'm on break I ALWAYS get sick. When I start to feel a little more under the weather than usual, I bring out my echinacea 1 pill twice a day for a week and it works miracles. Sometimes I even empty the capsules to make a tea with some local honey I was lucky to find someone sold right here in the middle of the city. Echinacea is a must have in my huge medication/first aid drawer and is the first thing I grab when I or someone around me starts feeling off and under the weather.", "rating": "5"}, {"helpful": 4, "title": "Nature's Bounty Echinacea", "body": "I started these products not to long ago, but I know for a fact there great!! Pure, not like the ones in your market, I can feel the greatness, purity, and differences in the quality and how my body feels, I'm a picky person, I'm very happy I gave these products a try. keep up the good work! I recommend these and all of them 100 percent!!! Thank you!", "rating": "5"}, {"helpful": 4, "title": "The closest thing to a Miracle Drug.", "body": "I started looking for Echinacea when my Aunt told me the magical \"functions\" of these little things. Told me how she and my grandma was sick the other day and after taking these pills two days straight, they had recovered. Now that might sound just like them recovering normally, but knowing my aunt and grandma for so long, they usually take 1-2 weeks to recover.", "rating": "5"}, {"helpful": 4, "title": "It really works", "body": "Never would have thought to pick this up until I was under the weather with a cold for over a week, and was introduced to Echinacea... after trying someone, I immediately felt the best I had in a week in the morning. Coincidence? I wasn't sure, so I ordered a bottle on Prime - 2 days later it arrived, and I took it for a week. Back to 100% in no time. I had been plugging Airborne and Emergency to no avail. My counter is now permanently stocked with Echinacea anytime I even catch a hint of an oncoming cold. This is a must for Oregon weather, and my international trips which put me in contact with all sorts of airborne virus parties I'd rather not attend. In my experience, most certainly effective.", "rating": "5"}, {"helpful": 0, "title": "Rabbits?? Doesnt work", "body": "I used this for my rabbits and I don't see much of a difference for their respiratory infections. It's a great quality product though. The capsules are easy to open and spread the powder. It just doesn't work on rabbits like they say it does.", "rating": "3"}, {"helpful": 0, "title": "For me it's better to use before than after I start having symptoms", "body": "This works.  I used it all year, off and on, when I felt I was an jeopardy of getting a cold.  For me it's better to use before than after I start having symptoms.", "rating": "5"}, {"helpful": 0, "title": "I use Echinacea, when I have been around a ...", "body": "I use Echinacea, when I have been around a crowd. Or when I feel I am coming down with something. I usually take it about 7 days. I don't take it on a daily basis. I have not been sick. So it would seem to me, so far, they must be helping.", "rating": "4"}, {"helpful": 1, "title": ":LOVE Echinacea", "body": "I don't care the brand, as long as it is Echinacea.  I take it when someone is sick around me, or if I feel that I am getting sick.  I recommend it to everyone.. it truly does help!", "rating": "5"}, {"helpful": 0, "title": "4 star", "body": "I am not sure that it works.But I am keeping drink it", "rating": "4"}, {"helpful": 0, "title": "Happy!", "body": "Great product! !! Not expensive and Great delivery!", "rating": "5"}, {"helpful": 1, "title": "Echinacea 400 mg", "body": "I'm right now taking this product an I'm not yet able to say it is good or not.", "rating": "5"}, {"helpful": 0, "title": "Happy!", "body": "Great product! !! Not expensive and Great delivery!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent product and transaction.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good stuff. I always keep on hand.", "rating": "5"}, {"helpful": 0, "title": "Echinacea, cheaper than a doctor visit!", "body": "I take Echinacea, Olive Leaf Extract and extra vitamin c around fall through spring to boost my immune system. So far that combination has kept me well. If I do get sick at all, it doesn't last long. I recommend anyone take this product especially during flu season. If you don't, don't say I didn't warn you! Another good reason is, it's not expensive!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great deal! I love this stuff, especially during cold season", "rating": "5"}, {"helpful": 0, "title": "Good Supplement!", "body": "Good supplement!", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "these are great", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great, thanks!", "rating": "5"}, {"helpful": 5, "title": "Wouldn't be without it !!", "body": "I have been taking Echinacea now for 16 years. I started when my late husband became ill and was told this would help keep colds away from me. And it has. I have a weak immune system and this seems to give it a boost. I have not had a bad cold since I started taking it. Sniffles yes.", "rating": "5"}, {"helpful": 0, "title": "Great Product!", "body": "Quick delivery is much appreciated! Thanks!", "rating": "5"}, {"helpful": 1, "title": "Excellent product! Very Fresh and Great for Immune System", "body": "I start taking echinacea any time I start feeling the slightest bit sick or end up being around people that are sick or with the flu.I take about 4 a day and boom!  I don't get sick!!", "rating": "5"}, {"helpful": 5, "title": "Wouldn't be without it !!", "body": "I have been taking Echinacea now for 16 years. I started when my late husband became ill and was told this would help keep colds away from me. And it has. I have a weak immune system and this seems to give it a boost. I have not had a bad cold since I started taking it. Sniffles yes.", "rating": "5"}, {"helpful": 6, "title": "I love this brand", "body": "I travel for work and when I am not traveling, I am in a center with lots of staff.  I try to always take echinacea and vitamin c before and during any travel I have to beef up my immune system.  I love this brand.  I can honestly say that most of coworkers that travel as much as I do are always getting sick and I rarely do!  I credit Echinacea for it!", "rating": "5"}, {"helpful": 1, "title": "Say goodbye to cold medicine,  say hello to healthier days..", "body": "These vitmans did the job. I read somewhere that you need about 900mg daily.. I take only two when ppl around me are getting sick and since I been taking these, I stop taking all cold medicine..and my cold never lasted more than 3 days. I absolutely adore this.", "rating": "5"}, {"helpful": 0, "title": "Effective immune booster", "body": "I've been taking echinacea as an immune system booster since I was a child, taking a couple whenever I started to feel sick. This has worked well my whole life, and if that's how you choose to use this product, you can. However, I got sick 3 times this past winter after moving to a new, colder climate. So I bought some more echinacea and started taking it daily. And it has been working like a charm! I've been on it daily for a month now and not so much as a sniffle, and I have more energy overall! This particular brand's capsules are easy to take, and have no bitter taste or aftertaste.", "rating": "5"}, {"helpful": 5, "title": "Great stuff", "body": "Works well on drying out my sinuses. I use it anytime I'm starting to come down with a sore throat and it knocks it right outta me!", "rating": "4"}, {"helpful": 5, "title": "really does a good job of keeping his runny nose and eyes to ...", "body": "Using this as a herbal medication for my pet rabbit which has the chronic snuffles after none of the antibiotics worked, really does a good job of keeping his runny nose and eyes to a minimum.  Just mix half the contents of a pill into his water mug which will last a few days, break one day, and repeat.", "rating": "5"}, {"helpful": 1, "title": "Works Well For Me", "body": "During my recovery from pnamonina, I purchased my usual winter cold/flu weather supplement supplies without knowing of their effectiveness, as I usually begin taking this supplement, along with Goldenseal, prior to ever being ill with any sort of cold or flu. Yet, desperate to become well from being so ill with pnamonina, I ordered my supplies anyway and immediately began taking them once received. These are capsules, which are, in my opinion, be easily taken individually with liquids. I feel this product has proven to be a good quality brand of supplement for the price, and plan to continue to purchase once supplies need replenishing. To my understanding, these particular supplements have been recommended to take no more than 4 months per year. I continue to take these supplements along with Goldenseal Root to boost my immune system toward the prevention of future colds and flus...I am not a medical professional so I am unable to recommend this product, and, with the introductionof any supplement or medication, it is always best to consult your medical doctor.", "rating": "5"}, {"helpful": 1, "title": "Echinacea 400 mg", "body": "I'm right now taking this product an I'm not yet able to say it is good or not.", "rating": "5"}, {"helpful": 0, "title": "Excellent herb for flu and colds", "body": "Excellent herb for flu and colds. Do not take this for more that a week or so since it loses effectiveness. Take immediately after noticing first sign of flu symptoms or colds.", "rating": "5"}, {"helpful": 0, "title": "I take 5 of these when i feel a cold ...", "body": "I take 5 of these when i feel a cold coming on. Sometimes, if taken soon enough, I think they really help stave off the cold.", "rating": "5"}, {"helpful": 0, "title": "I work in public. When people come in sick ...", "body": "I work in public. When people come in sick, I take a capsule right away and never get sick. I always carry it with me.", "rating": "5"}, {"helpful": 0, "title": "Immune support", "body": "I highly recommend this product. I use it sporadically, but consistently, twice a day a few weeks at a time. Boosts my immune system every time I use it.", "rating": "5"}, {"helpful": 0, "title": "but these seem to be as good as any", "body": "with pills its always hard to tell how effective they are, but these seem to be as good as any. I take a few if I am feeling sick and it usually is gone after a good night sleep.", "rating": "5"}, {"helpful": 5, "title": "really does a good job of keeping his runny nose and eyes to ...", "body": "Using this as a herbal medication for my pet rabbit which has the chronic snuffles after none of the antibiotics worked, really does a good job of keeping his runny nose and eyes to a minimum.  Just mix half the contents of a pill into his water mug which will last a few days, break one day, and repeat.", "rating": "5"}, {"helpful": 0, "title": "Wonderful Product", "body": "Keeps me from getting sick every time I feel like I'm catching a cold or some virus I take one and I don't get sick. I love it! I'm always buying this product, it never lets me down.", "rating": "5"}, {"helpful": 6, "title": "I love this brand", "body": "I travel for work and when I am not traveling, I am in a center with lots of staff.  I try to always take echinacea and vitamin c before and during any travel I have to beef up my immune system.  I love this brand.  I can honestly say that most of coworkers that travel as much as I do are always getting sick and I rarely do!  I credit Echinacea for it!", "rating": "5"}, {"helpful": 0, "title": "Didn't realize you need to take SEVEN times a day ...", "body": "Didn't realize you need to take SEVEN times a day! Also seemed to upset my stomach even only taking twice a day.", "rating": "4"}, {"helpful": 0, "title": "I take one bottle of echinacea in the fall to ...", "body": "I take one bottle of echinacea in the fall to help boost my immune system and stave off a cold/flu.  So far it's working!", "rating": "5"}, {"helpful": 0, "title": "Avoid a cold!", "body": "Great for the immune system. I often avoid or shorten a cold if I take this at the first sign of a sniffle.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "I bought it many times to manage my health condition.", "rating": "5"}, {"helpful": 0, "title": "Miracle Herb!", "body": "Value-haven't had a cold since I started taking  twice a day  5 years ago", "rating": "5"}, {"helpful": 0, "title": "works great.", "body": "Used this for years to boost my immune system, works great.", "rating": "5"}, {"helpful": 2, "title": "Immune Booster, Wound Healing", "body": "Since Started Taking Vitamin C,E, Zinc and echinacea ( I rotate between Vit E and echinacea) I have not been sick for more than a day or maybe half a day, usually I am the person who get sick for a whole week and have residual cough for a few more weeks ..that was 2-3 years ago!", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Great Price. Seems to be just as good as the brands we've purchased.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great price, good brand, fast shipping, thanks", "rating": "5"}, {"helpful": 0, "title": "winner", "body": "good choice to head off a bacteria infection", "rating": "5"}, {"helpful": 1, "title": "Works Well For Me", "body": "During my recovery from pnamonina, I purchased my usual winter cold/flu weather supplement supplies without knowing of their effectiveness, as I usually begin taking this supplement, along with Goldenseal, prior to ever being ill with any sort of cold or flu. Yet, desperate to become well from being so ill with pnamonina, I ordered my supplies anyway and immediately began taking them once received. These are capsules, which are, in my opinion, be easily taken individually with liquids. I feel this product has proven to be a good quality brand of supplement for the price, and plan to continue to purchase once supplies need replenishing. To my understanding, these particular supplements have been recommended to take no more than 4 months per year. I continue to take these supplements along with Goldenseal Root to boost my immune system toward the prevention of future colds and flus...I am not a medical professional so I am unable to recommend this product, and, with the introductionof any supplement or medication, it is always best to consult your medical doctor.", "rating": "5"}, {"helpful": 0, "title": "Nice, trusted brand with quality pills.", "body": "Nice, trusted brand with quality pills.", "rating": "5"}, {"helpful": 0, "title": "Magic?", "body": "Seems to help prevent colds.  Magic?", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I haven't had a cold in a couple of years.  Knock on wood.....", "rating": "5"}, {"helpful": 0, "title": "great product!", "body": "Work as advertised! great product!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good quality packaged well", "rating": "5"}, {"helpful": 0, "title": "Product as advertised. I'm using it to supplement the ...", "body": "Product as advertised.  I'm using it to supplement the Geens+ that I've been taking for years.  The new RAW Greens+ not longer has Echinacea in it. Thanks for having this product available.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I used this when I feel a cold or sore throat starting.  It works!", "rating": "5"}, {"helpful": 2, "title": "Great herbal", "body": "I started changing my health 4 years ago. I have MS.  I was always sick. I was at my dr's office at least once a month all year long. It has been 4 years since I have been sick. I have used this brand for awhile. It works as well as any of the more expensive brands. I will never use an antibiotic from my dr. again. If I start getting a sore throat, I start taking them.  For me, it works best if I use it 3-4 days and then wait about 3 days before starting back on it if I am still feeling under the weather. . I learned the hard way what drs are now saying about antibiotics. There are none that I can take anymore. Thank you for a great product.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "A good way to fight a cold", "rating": "5"}, {"helpful": 0, "title": "Two Stars", "body": "Raised heart rate too high", "rating": "2"}, {"helpful": 0, "title": "Five Stars", "body": "Great, thanks!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great Price. Seems to be just as good as the brands we've purchased.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Have been using this product for over 2 years and never disappointed", "rating": "5"}, {"helpful": 0, "title": "Enchinacea tablets", "body": "Great product to boost your immune system to keep from getting sick", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I used this when I feel a cold or sore throat starting.  It works!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I haven't had a cold in a couple of years.  Knock on wood.....", "rating": "5"}, {"helpful": 0, "title": "works great.", "body": "Used this for years to boost my immune system, works great.", "rating": "5"}, {"helpful": 0, "title": "Cold Prevention", "body": "Great Product to help prevent illness such as colds etc.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I love taking Echinacea to help boost my immune system.", "rating": "5"}, {"helpful": 0, "title": "Good product", "body": "Good product, hoping to keep away viruses for winter", "rating": "5"}, {"helpful": 0, "title": "Echinacea Immune Builder", "body": "Purchased for my son, great for your immune system.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great price, good brand, fast shipping, thanks", "rating": "5"}, {"helpful": 0, "title": "Great stuff", "body": "Works like a charm - when I am a bit run down.", "rating": "5"}, {"helpful": 0, "title": "winner", "body": "good choice to head off a bacteria infection", "rating": "5"}, {"helpful": 0, "title": "Nice, trusted brand with quality pills.", "body": "Nice, trusted brand with quality pills.", "rating": "5"}, {"helpful": 0, "title": "Magic?", "body": "Seems to help prevent colds.  Magic?", "rating": "5"}, {"helpful": 0, "title": "great product!", "body": "Work as advertised! great product!", "rating": "5"}, {"helpful": 0, "title": "great to keep you healthy", "body": "I love this stuff it really works", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "As expected. Have not been sick.", "rating": "5"}, {"helpful": 0, "title": "works great", "body": "I would recommend this product.", "rating": "5"}, {"helpful": 0, "title": "great. I feel better already", "body": "great.  I feel better already.", "rating": "5"}, {"helpful": 0, "title": "I love it", "body": "This is just what I wanted.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product! Thank you!!!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good quality packaged well", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "A good way to fight a cold", "rating": "5"}, {"helpful": 0, "title": "Two Stars", "body": "Raised heart rate too high", "rating": "2"}, {"helpful": 0, "title": "Five Stars", "body": "Happy with my purchase!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Amazing for the price!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Exactly as expected", "rating": "5"}, {"helpful": 0, "title": "healthy", "body": "keeping me healthy", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Keeps ya healthy.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Will buy again...", "rating": "5"}, {"helpful": 0, "title": "Echinacea vitamins", "body": "Wonderful price.", "rating": "5"}, {"helpful": 0, "title": "great daily", "body": "I use this often", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Love these ones", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Very satisfied.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "It is excelent!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great, thanks!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product", "rating": "5"}, {"helpful": 0, "title": "will order again", "body": "as described", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "GREAT BUY!!!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good,,AAAAA+", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "as expected", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Works well.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great price", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent!", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Excellent", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "very good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "It works.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Thank you", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I love it", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "superb!!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good buy", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Love it", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great", "rating": "5"}, {"helpful": 0, "title": "Echinacea by Nature's Bounty", "body": "Haven't been able to find echinacea in my local drug stores lately so tried Amazon.  The price is great for the quantity & this is a brand  I've used for years.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "I eat every day", "body": "I eat every day , we have eaten for two weeks , and I 'm looking forward to results", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "I bought this for my Aunt, she has chronic asthma, hopefully this will help her.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Great price for the amount. I swear by Echinacea to prevent and shorten colds.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Echinacea is one of those extra supplements that actually does work", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good price. Seems to work in terms of boosting immune system.", "rating": "5"}, {"helpful": 1, "title": "Good Quality", "body": "Lower temperatures can cause me to need  IMMUNE  SUPPORT.", "rating": "3"}, {"helpful": 1, "title": "It will protect you", "body": "Echinacea is helpful if the dose is suffiicient, I take 2 caps 2 times daily. I think this is a sufficient dose. The cost was very low.", "rating": "3"}, {"helpful": 0, "title": "Excellent brand.", "body": "Received and using. Will recommend.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Good price and prompt delivery.", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "I'm satisfied.", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "Good product!", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "Looks good", "rating": "4"}, {"helpful": 0, "title": "Recommend", "body": "Recommend", "rating": "4"}, {"helpful": 0, "title": "good price", "body": "The price was good on this and the product is good quality.  Natures Bounty has always been a good deal.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "a", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "good product", "rating": "4"}, {"helpful": 0, "title": "Three Stars", "body": "Good", "rating": "3"}, {"helpful": 0, "title": "Three Stars", "body": "It's good", "rating": "3"}, {"helpful": 2, "title": "Good for improving your immune system", "body": "I have some seasonal allergies and get a severe sinusitis due to that. It helps relieve the symptoms. I usually take around 3-4 tablets a day to get some relief with a interval of 4 hours. I usually get relief within 30 min or so", "rating": "5"}, {"helpful": 5, "title": "Good Supplement", "body": "This has helped me battle many sicknesses. When I feel I am getting sick I take five throughout the day and am better in no time! You can't take it as a supplement though, only when your sick.", "rating": "5"}, {"helpful": 3, "title": "NATURE'S BOUNTY NATURAL WHOLE HERB ECHINACEA", "body": "This is a great product. I don't use it every day but if I feel like I might be coming down with something I take it and it never fails to ward off colds, sore throats, etc. I have not come down anything since starting to use this!", "rating": "5"}, {"helpful": 2, "title": "Good product", "body": "I like to keep the Nature's Bounty Echinacea on hand.  I use it if I am feeling run down and when sick.  This product works very well for me, I am not sure if it is because it is the whole herb echinacea or that it is from Nature's Bounty, a trusted company (or both).  I feel better quicker than with other brands and combination products that I have used.", "rating": "5"}, {"helpful": 2, "title": "Quality Echinacea at about 60% off", "body": "I use echinacea for allergies and the occasional cold. Taking 8 - 10 caps a day, I can go through a bottle quickly. The subscribe and save price is ridiculously cheap and now I never run out.  I have tried nearly every brand, plant types and delivery method - and the Nature's Bounty Echinacea works as well as any of the others. Btw, the secret to using echinacea to prevent a cold is take it early and often - 2 to 4 caps every 2 hours...right when you recognize the first symptoms of a sneeze, throat tickle or drainage. You might need to keep up the dosage for 2 to 4 days - until the symptoms go away.", "rating": "5"}, {"helpful": 1, "title": "Makes me feel better", "body": "I've been taking these supplements for a few months now -- I normally take about 4 every day. I know this is anecdotal evidence but I think I feel more energetic when I take these supplements and I haven't really gotten sick all winter.", "rating": "5"}, {"helpful": 1, "title": "good product great price", "body": "Great Product works well better than described Would recommend to purchase if your looking for a quality product.  Will buy more in the future.", "rating": "5"}, {"helpful": 1, "title": "Perfect!!", "body": "Have been taking it and (knock on wood) seems to be staving off the flu so many others are catching.  I was skeptical about echinacea at first, but was tired of getting sick and tried it upon the recc. of a friend.  I've been healthy ever since.  I take this if people around me are sick, when I feel I'm getting sick or I am actually not feeling well.  This seems to be a magic pill for keeping my immune system strong.  Will never be without it!", "rating": "5"}, {"helpful": 1, "title": "No idea for fact if these helped or not...", "body": "I have no concrete proof that these Herbal capsules did anything to help prevent or shorten a cold I had.  But they are as described and don't believe they could cause things to be worse unless someone has an allergy to this herb.", "rating": "5"}, {"helpful": 1, "title": "Ok", "body": "Came on time or early nice item why do I have a word limit own items to rate good item", "rating": "5"}, {"helpful": 1, "title": "Flu Cure", "body": "I loaded up with this and a lot juice and I got over the flu very quickly.  Surprised more people don't use this.", "rating": "5"}, {"helpful": 2, "title": "VERY BAD PRODUCT", "body": "This herb makes my wife sick  (nauseated0  and we would like a refund  !!!!!  MANY THANKS!!!!  Harvey  PLEASE ISSUE A CREDIT TO MY ACCOUNT!!!!!  THANKS", "rating": "1"}, {"helpful": 4, "title": "Purpurea Root", "body": "Most of the Echinacea on the market consist of flower parts and stems, which have the least amount of the beneficial ingredients you buy Echinacea for.  The \"now\" product uses the root which is much harder to find when you check the ingredient list on other manufacturers.  I believe this is why many people do no see the results one hopes for when using Echinacea.  This product has been the best I've used and the cost to benefit ratio can't be beat, in my estimation. \"Now\" also makes a \"Dry E\" which is Tocopheryl Succinate, another hard to find product whose benefits are backed by quite a bit of research.  I would recommend this product to anyone looking for high quality Echinacea at a reasonable price.", "rating": "5"}, {"helpful": 4, "title": "It works.", "body": "On three different occasions I've had my husband and another visiting family member get extremely ill (common cold, URI, flu etc). From the onset of their symptoms I began taking the supplement twice a day for a week or so and never got more than a sniffle when they were so deathly ill. Something in this actually works. I'm normally the one who gets dog sick b/c someone sneezed near me, so the fact most of my family was so sick and I never had more than a slight runny nose speaks volumes to me.", "rating": "4"}, {"helpful": 0, "title": "Great quality of Echinacea. Indispensable!", "body": "Great product. I was used to an effervescent product which had a great taste and other powerful ingredients, besides Echinacea, but the company I work with refuses to ship to my location. So, I needed a replacement, and I bought this product by Now Foods. Well, I miss my refreshing fizzy drink, but this product is fully working. I take these capsules every time I have a headache and I feel something is coming. You know, the kind of pain that makes you feel as if you'd caught the flu. I couldn't find anything else than Echinacea that works for me.", "rating": "5"}, {"helpful": 0, "title": "Love the Now Foods products", "body": "Love all of the Now Foods products and have been buying them for years!! A family owned business that takes pride in manufacturing without all the unnecessary added ingredients. Ordering them on Amazon has made it even easier to obtain them and saves me a trip to the store!  Has definitely helped my nails stay strong and grow longer!  Will reorder.", "rating": "4"}, {"helpful": 0, "title": "Did nothing for me :-(", "body": "I began taking this product weeks before I started my musical of Titanic - about a good 4 or 5 weeks before the opening nite; there was NO way I could come down sick.  I was told take 3 to 4 tablets of this product daily to prevent colds.  On opening nite of the musical I was playing J. J. Astor, I had the worse severe headcold of my life - on opening nite!  I hardly made it to the theater with a headcold so bad in my eyes but made it there and made it thru the play.", "rating": "1"}, {"helpful": 0, "title": "Good to have on hand in the flu seasons to ...", "body": "Good to have on hand in the flu seasons to rev up the immune system. A must have for anyone looking to keep their health in check", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Us in the winter to help not get a cold etc. No problems.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Perfect to help with repelling any upcoming illness.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great price for necessary product.", "rating": "5"}, {"helpful": 0, "title": "Great Product", "body": "The family and I typically take this when we start to feel sick (or one of us gets sick) and it works swimmingly.", "rating": "5"}, {"helpful": 1, "title": "Good product", "body": "I vary products based on price and comparable quality.  Two companies I find make the best vitamins -- Nature's Bounty and NOW.  Whether Echinacea works at helping my immune system or not, I don't know but I tend not to catch colds when others have them.  Quality capsules.  Easy to swallow.  I'd buy this again.", "rating": "5"}, {"helpful": 1, "title": "Where did all the supplements go?", "body": "I've been using Echinacea for YEARS!  This product has a higher milligram number, although the first bottle purchased YEARS ago, IN  A  STORE, had 1140 mg per capsule and 250 caps per bottle!  This will do for now.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Us in the winter to help not get a cold etc. No problems.", "rating": "5"}, {"helpful": 0, "title": "Good to have on hand in the flu seasons to ...", "body": "Good to have on hand in the flu seasons to rev up the immune system. A must have for anyone looking to keep their health in check", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Perfect to help with repelling any upcoming illness.", "rating": "5"}, {"helpful": 0, "title": "Made a difference", "body": "I have a poor immune system. I was a premature baby and did not receive immunities from my mom. This has definitely helped. I haven't gotten any bad colds or flu. What I do get goes away quickly. I also take vitamin C with this.", "rating": "5"}, {"helpful": 1, "title": "Good immune system booster!", "body": "Great product, works as advertised! I always take this when I feel im coming down with something or when everyone around me at work is sick. Has kept me from getting sick the last two winters!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great price for necessary product.", "rating": "5"}, {"helpful": 0, "title": "Great product for colds", "body": "Great product to amp up the immune system and stave off colds. Daily requirement during cold season and when I feel a cold coming on any time of year. I am partial to the NOW brand. I've purchased several NOW items and found them to be high quality!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Use it all the time", "rating": "5"}, {"helpful": 2, "title": "I was feeling pretty sick and decided to order these pills", "body": "I was feeling pretty sick and decided to order these pills. I took about 4 pills the day I received them, split into two doses.  I did feel somewhat better the following morning and I think I may have recovered quicker than usual.  I will use this as soon as I start to feel sick in the future and update on whether  it works prophylactically.", "rating": "4"}, {"helpful": 2, "title": "I've done a lot of research on the health benefits ...", "body": "I've done a lot of research on the health benefits of herbs.  I keep this in my \"cold meds\" box in the cupboard and the minute I feel a scratchy or sore throat coming on, I grab echinacea and take 2 a day.  I swear it shortens colds.  Now Foods is a very reputable and reasonably priced brand and I will always have this echinacea on hand to help me and my family survive the winter!", "rating": "5"}, {"helpful": 0, "title": "Works for me.", "body": "Whenever I catch a virus my first symptom is a sore throat. So, I started taking one Echinacea capsule plus a vitamin C pill twice a day till it goes away, and have never gotten sick since.  If I take this regimine too late and the cold progresses, then I start taking Zinc throat candies; this keeps the virus in check and all I feel is a runny nose.  I've read that the above only works for some people, and either to some degree or not at all for others.  So, I guess you just have to try it and see if you're one or not.", "rating": "5"}, {"helpful": 5, "title": "A good foos supplement", "body": "It is a very good supplement for everyday specially in the winter time or when the climate is more severe. It is easy to swallow and no side effects have been observed.", "rating": "5"}, {"helpful": 0, "title": "Made a difference", "body": "I have a poor immune system. I was a premature baby and did not receive immunities from my mom. This has definitely helped. I haven't gotten any bad colds or flu. What I do get goes away quickly. I also take vitamin C with this.", "rating": "5"}, {"helpful": 1, "title": "Good product", "body": "I vary products based on price and comparable quality.  Two companies I find make the best vitamins -- Nature's Bounty and NOW.  Whether Echinacea works at helping my immune system or not, I don't know but I tend not to catch colds when others have them.  Quality capsules.  Easy to swallow.  I'd buy this again.", "rating": "5"}, {"helpful": 1, "title": "Where did all the supplements go?", "body": "I've been using Echinacea for YEARS!  This product has a higher milligram number, although the first bottle purchased YEARS ago, IN  A  STORE, had 1140 mg per capsule and 250 caps per bottle!  This will do for now.", "rating": "4"}, {"helpful": 1, "title": "Great against colds and viruses.", "body": "Was taking these when my boyfriend brought home a pretty bad sickness. I took 3 a day but I was taking 1 a day prior to that so it had already build up in my system. The worst of the virus I had was the first night. In 3 days, I was back to healthy again. He was too stubborn to try them so he had whatever it was for nearly 3 weeks and 2 doctor visits later.", "rating": "5"}, {"helpful": 0, "title": "Great product for colds", "body": "Great product to amp up the immune system and stave off colds. Daily requirement during cold season and when I feel a cold coming on any time of year. I am partial to the NOW brand. I've purchased several NOW items and found them to be high quality!", "rating": "5"}, {"helpful": 0, "title": "easy to take", "body": "We have used Echinacea for years, this is a quality product, easy to take, the capsule is not very large, effective and gives me peace of mind for my families health. Good seller, ships fast and arrives well before expected.", "rating": "5"}, {"helpful": 0, "title": "love it", "body": "definitly a life changer. noticed i felt healthier after taking. i usually take them according to instructions on the back of bottle fyi...but ya this has helped alot. been to the doctors, dealt with terrible antibiotics for uti which caused various health issues. echinacea has improved my immune system tremendously since i found this product n have been taking it for about a few months now", "rating": "5"}, {"helpful": 0, "title": "Good as usual", "body": "Good product with fast shipping.", "rating": "4"}, {"helpful": 1, "title": "Good for healing of spder bites!", "body": "Was recommended for some bad spider bites (brown recluse). Took 2 caps 2x daily and it really helped. Thanks.", "rating": "5"}, {"helpful": 1, "title": "A must have for everyone", "body": "Powerful immunity booster! I am a huge fan of NOW supplements and echinacea is a must have for cold and flu season!", "rating": "5"}, {"helpful": 0, "title": "Great Echinacea & The Real Thing", "body": "Despite news stories that claim herbal remedies are made of wood chips or parsley or some such garbage, I can attest that this is not fake, oregano, dust, wood chips or other substitutes. It's the real thing and it works! Why would anyone want you to stop taking Echinacea or become fearful of swallowing lawn trimmings?", "rating": "5"}, {"helpful": 0, "title": "Great Product", "body": "The family and I typically take this when we start to feel sick (or one of us gets sick) and it works swimmingly.", "rating": "5"}, {"helpful": 2, "title": "2 pills a day keeps the doctor away", "body": "I have been taking 2 of these pills a day for the last 7 years and have not been ill or sick even ONE TIME in the 7 years. Not once. I contribute it to my taking this pill and high doses of Vitamin C.", "rating": "5"}, {"helpful": 0, "title": "Did nothing for me :-(", "body": "I began taking this product weeks before I started my musical of Titanic - about a good 4 or 5 weeks before the opening nite; there was NO way I could come down sick.  I was told take 3 to 4 tablets of this product daily to prevent colds.  On opening nite of the musical I was playing J. J. Astor, I had the worse severe headcold of my life - on opening nite!  I hardly made it to the theater with a headcold so bad in my eyes but made it there and made it thru the play.", "rating": "1"}, {"helpful": 0, "title": "Quality supplements at a great price", "body": "My wife swears by this stuff. NOW supplements have always been good quality. Price was slightly less than online supplement stores, but Prime shipping definitely sealed the deal for me.", "rating": "5"}, {"helpful": 1, "title": "great product", "body": "helps support illness control", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent quality product, at an excellent price.", "rating": "5"}, {"helpful": 5, "title": "A good foos supplement", "body": "It is a very good supplement for everyday specially in the winter time or when the climate is more severe. It is easy to swallow and no side effects have been observed.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I take them when I think I am getting sick", "rating": "5"}, {"helpful": 1, "title": "Great", "body": "Echinacea keeps me healthy.", "rating": "5"}, {"helpful": 0, "title": "I take it and I hope it works fine.", "body": "I take it and I hope it works fine.", "rating": "5"}, {"helpful": 0, "title": "Be aware. Echinacea is not intended to be taken ...", "body": "Be aware.  Echinacea is not intended to be taken over long periods.  It can cause harm.", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "Product as expected. Fast ship", "rating": "5"}, {"helpful": 1, "title": "Take it every day", "body": "I take this every day and it keeps the colds away.", "rating": "5"}, {"helpful": 1, "title": "Four Stars", "body": "Haven't gotten sick in years sooo I guess it works?", "rating": "4"}, {"helpful": 1, "title": "Five Stars", "body": "Actually, this seems to work quite well for staving off a cold.", "rating": "5"}, {"helpful": 0, "title": "Quality supplements at a great price", "body": "My wife swears by this stuff. NOW supplements have always been good quality. Price was slightly less than online supplement stores, but Prime shipping definitely sealed the deal for me.", "rating": "5"}, {"helpful": 0, "title": "Good brand!", "body": "Love this supplament. I've noticed a big difference in my health since I started taking this product. I've not experienced any side effects and it has seemed to help quite a bit.", "rating": "5"}, {"helpful": 0, "title": "Great stuff.", "body": "Use for my kids and myself at 1st signs of any cold symptoms and must say this stuff works fast and very effectively.  Would highly recommend to keep in your medicine cabinet.", "rating": "5"}, {"helpful": 2, "title": "Great product", "body": "This supplement really did help me to hold off a cold when we were expecting guests and I didn't want to infect anyone.", "rating": "5"}, {"helpful": 0, "title": "NOW brand quality does not seem to be as good as the traditional name brands", "body": "NOW brand quality does not seem to be as good as the traditional name brands.  I have take more tablets to get it work as good as one tablet from a older name brand.", "rating": "3"}, {"helpful": 0, "title": "year round", "body": "year round help for the whole family. Don't wait for the sore throat feeling! Very good price and great product. Will do business with them again.", "rating": "5"}, {"helpful": 0, "title": "healthy vitamins", "body": "yea i was recommended to buy this product for his benefits healthy i like the price too and y recommended it for you're on venefits", "rating": "5"}, {"helpful": 0, "title": "Highly recommended.", "body": "Another product I subscribe to monthly through Amazon, another product I highly recommend. A great price. Great for your health.", "rating": "5"}, {"helpful": 0, "title": "echinacea", "body": "I can't imagine surviving the winter colds and flu season without this product being handy in my family medicine cabinet.", "rating": "5"}, {"helpful": 0, "title": "It worked well as I expected. I take this ...", "body": "It worked well as I expected.  I take this product at the beginning of summer to wrought off heat pimples.  I must have!", "rating": "5"}, {"helpful": 0, "title": "Great product", "body": "Cheaper than most, seems to be a quality product. I have had no issues and they are easy to swallow.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I love the ease of shopping at Amazon and products such as this contribute to my overall well being.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I always like NOW products.  I think it's working since I haven't been sick since starting them.", "rating": "5"}, {"helpful": 0, "title": "Be aware. Echinacea is not intended to be taken ...", "body": "Be aware.  Echinacea is not intended to be taken over long periods.  It can cause harm.", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "I've used Echinacea for the past few years and I do believe it helps keep me healtier.", "rating": "5"}, {"helpful": 0, "title": "Good Quality and Price", "body": "Easily digested (no burping or foul taste) and so far, so effective.  Price is right.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent quality product, at an excellent price.", "rating": "5"}, {"helpful": 0, "title": "Have tried many companies and brands - this one is the best!", "body": "Awesome! Quick delivery...quality product and great value! Highly recommend!", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "No idea of good or bad...I am not wasting my money again to be sure", "rating": "3"}, {"helpful": 0, "title": "Good therapeutic strength.", "body": "These are a good therapeutic strength.  We keep them on hand.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great value", "rating": "5"}, {"helpful": 0, "title": "Have tried many companies and brands - this one is the best!", "body": "Awesome! Quick delivery...quality product and great value! Highly recommend!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "As advertised", "rating": "5"}, {"helpful": 0, "title": "Great stuff.", "body": "Use for my kids and myself at 1st signs of any cold symptoms and must say this stuff works fast and very effectively.  Would highly recommend to keep in your medicine cabinet.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good value", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I love this product!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I love the ease of shopping at Amazon and products such as this contribute to my overall well being.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent product.", "rating": "5"}, {"helpful": 0, "title": "Good Quality and Price", "body": "Easily digested (no burping or foul taste) and so far, so effective.  Price is right.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "ok", "rating": "5"}, {"helpful": 0, "title": "No complaints", "body": "It seems to be as good as the other brands I've purchased.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "I always like NOW products.  I think it's working since I haven't been sick since starting them.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "So far so good.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I take it every day.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Small capsules easy to swallow", "rating": "5"}, {"helpful": 0, "title": "year round", "body": "year round help for the whole family. Don't wait for the sore throat feeling! Very good price and great product. Will do business with them again.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "awesome!!!!!", "rating": "5"}, {"helpful": 0, "title": "It worked well as I expected. I take this ...", "body": "It worked well as I expected.  I take this product at the beginning of summer to wrought off heat pimples.  I must have!", "rating": "5"}, {"helpful": 1, "title": "Took couple of echinacea caps plus a doze of Tylenol and by 11pm I was feeling a lot better and was able to get out of bed and .", "body": "Works!!!!!!!!!!  My mom recently had a severe cold that lasted more than 3 weeks even with 2 doctor's visits and a course of anti-biotics. I was her care taker so I knew I couldn't get sick. I took this echinacea throughout this period and I didn't get sick! Another time I was suddenly feeling ill with nausea in the afternoon. Took couple of echinacea caps plus a doze of Tylenol and by 11pm I was feeling a lot better and was able to get out of bed and make myself a big dinner. I have been using achinacea for more than couple of decades. From my own experience, echinacea ROOT POWDER works for me EVERY SINGLE TIME, while extracts and other parts had no noticeable effect. I stick with Now brand because it's the only inexpensive echinacea root product I know and is readily available.", "rating": "5"}, {"helpful": 0, "title": "healthy vitamins", "body": "yea i was recommended to buy this product for his benefits healthy i like the price too and y recommended it for you're on venefits", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Did a good job curing the bad cough I had.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I've used Echinacea for the past few years and I do believe it helps keep me healtier.", "rating": "5"}, {"helpful": 0, "title": "I'm rarely sick.", "body": "Good to have.", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "ok for pre colds;", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "Perfect", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great deal and works amazingly!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Keep my immune system strong. I take it daily.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "exactly as promised and quick delivery.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Now products are wonderful.  Prompt delivery.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I want another one !!!", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Good Product", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Great. We take one every a day.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "It works for me.", "rating": "5"}, {"helpful": 0, "title": "Good product.", "body": "Arrived when expected. Good product.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "does the job", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "It was what it was suppose to be.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great item and great deal", "rating": "5"}, {"helpful": 0, "title": "Love it", "body": "Helping me fight off colds right now.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I take this to help keep my immune system strong.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Thanks", "rating": "5"}, {"helpful": 1, "title": "Essential at first signs of cold", "body": "This is a good cheap alternative to over priced drug store versions.  I reach for this first before the \"nitequil\" or cold meds at the first sign of a cold, or when those around me are sick.  Keeps your immune system up and boosts when you are not 100%.  I only use it 2-3 caps 2 -3 times a day for a few days only when feeling like I might get sick or to avoid the bug that everyone else is fighting, that and extra Vit C doses does the trick almost every time, or at least shortens the time down.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "killed my cold quick.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "A must have especially during cold and flu season.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Always good", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "good", "rating": "4"}, {"helpful": 0, "title": "Convenient", "body": "Great for Get Well Soon care package!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great quality  product  very happy", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "awesome", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great price", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great value", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great value", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "thank you!", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "I like it.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Good value", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good herb", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Echinacea", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Perfect", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "awesome", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Thanks", "rating": "5"}, {"helpful": 0, "title": "echinacea- delivered pretty fast", "body": "It's echinacea and the price was right. It was delivered in a reasonable time frame. None of the capsules were broken. It helps to boost my immune system.", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "good", "rating": "4"}, {"helpful": 0, "title": "To Better Health", "body": "Well, fortunately I haven't experienced any illnesses to date, so hopefully this products is helping as advertised.", "rating": "4"}, {"helpful": 0, "title": "NOW Foods Echinacea", "body": "This item came quickly and wrapped expertly. It will continue to help my family stay healthy during the cold season", "rating": "4"}, {"helpful": 0, "title": "yup", "body": "yup", "rating": "5"}, {"helpful": 0, "title": "???", "body": "Not sure if these do anything. But, that is true of many herbal treatments.", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "ok", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Good enough. It's hard to get excited about supplements.", "rating": "4"}, {"helpful": 0, "title": "One Star", "body": "contains fillers.", "rating": "1"}, {"helpful": 0, "title": "Four Stars", "body": "Very good", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "Good", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "No opinion on way or another as to whether this is having any affect on my health.", "rating": "4"}, {"helpful": 3, "title": "No colds", "body": "There's some controversy about Echinacea. A lot of studies show it isn't effective against colds and flu. Regardless of the studies, I've been taking this supplement daily for twenty-six years--since my near life-ending heart by- pass operation--and  . . . I haven't had a cold in all of that time. Odd thing is, occasionally I'll get the symptoms of a cold coming on--a few sniffles and sneezes but within twenty-four hours everything's back to normal. Whether or not this is because of the efficacy of the Echinacea, I don't know, but the supplement is so inexpensive that I see no reason to eliminate it from my daily regimen.", "rating": "5"}, {"helpful": 1, "title": "This stuff works", "body": "I havent been sick in a while and this stuff keeps me healty. Its great for your immune system and also great for children with ilness. This has helped my nephew who was born with a low immune system and since taking these pills(he takes the chewable ones) his doctor has seen so much immporvement she autoerized him to attend school.", "rating": "5"}, {"helpful": 3, "title": "Generally very effective in preventing colds. I have had ...", "body": "Generally very effective in preventing colds. I have had a sore throat that took more to knock. Beware of anyone just vaccinated against whooping cough because they are carriers and very contageous, Astragalus, Wild Oregano Oil and the Echinacea/Goldenseal complex have additional combined effectiveness. There seems little these will not hold off. I read an article showing chestnut leaves or their extract effective in blocking the toxins produced by MRSA infections, though I have not needed so far.", "rating": "5"}, {"helpful": 8, "title": "I am looking to avoid colds", "body": "Echinaecea is a good product.  I work at a school and children are carriers of colds and flu so I started taking echinaecea .  So far so good.  I was getting cold after cold before I started this.", "rating": "5"}, {"helpful": 3, "title": "Good Supplement for Winter", "body": "We take these for 2 months each winter, as recommended by the doctor.  The dose for this herb is 3 capsules per day, therefore, this bottle will last my husband and me one month.  I trust this brand of herbs and vitamins.", "rating": "5"}, {"helpful": 9, "title": "Mother Nature's own antibiotic", "body": "This product works when you have a mild infection without nasal congestion. No side affects know that I've ever had.Been using since 1990.", "rating": "5"}, {"helpful": 2, "title": "Liquid is better if you can swing it.", "body": "I don't notice any sort of difference with these.  Don't know if I'm not taking enough of them.  I hate that you have to take 6 of them a day to get a good dose.  liquid is better if you can swing it.", "rating": "2"}, {"helpful": 0, "title": "Another Great Nature's Way Product", "body": "I only Take when Feel I'm about to Come Down with Anything.  Gives My Immune System a Boost and Normally Knocks out Colds and Flue or Greatly Shortens Their Duration.  Also Take some Vitamin C with It.  Nature's Way produces High Quality Food Supplements I take Regularly.", "rating": "5"}, {"helpful": 0, "title": "Quality Product", "body": "I sent this to my son, because he is often fighting some respiratory ailment.  I have used this herb in combination with high-dose 1000 mg. Vitamin C (L-Ascorbic Acid) for a decade or more at the first sign of a cold.  If a cold advances to the sore throat stage, I add a zinc lozenge.  I have not had a cold in well over a decade and I am 67 years old.", "rating": "5"}, {"helpful": 0, "title": "Getting a rice based capsule is too easy these days", "body": "Why is this not vegan??? Getting a rice based capsule is too easy these days. Just something to think about!", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "LOOOOOVE", "rating": "5"}, {"helpful": 0, "title": "Great", "body": "Me and my daughter love this product.  Anytime we feel a sickness coming on we start popping these pills and our sickness never seems to make it for long!", "rating": "5"}, {"helpful": 1, "title": "Helps prevent or get rid of colds faster", "body": "This stuff is amazing - if you feel like you're getting sick, take 4 of them in one shot, each day, and it will either help you not get sick, or help you get over it faster.  I swear by this stuff, and so does everyone on our office and home.", "rating": "5"}, {"helpful": 6, "title": "shorter colds maybe?", "body": "I have taken this herb for decades. Not convinced it makes a huge difference but because I believe it boosts my immune system, it does.", "rating": "5"}, {"helpful": 5, "title": "Didn't see anybody else having a bad reaction to it just praise", "body": "Allergic reaction.. I guess I should have done research on product. Its relations to ragweed makes it highly allergic for most people. Didn't catch that till after I took it and woke up covered in a rash! Didn't know it was that  highly allergic reaction. Didn't see anybody else having a bad reaction to it just praise. So I figured someone should warn others .dermatitis is no fun .", "rating": "1"}, {"helpful": 0, "title": "Great price for a quality product", "body": "Arrived quickly and is as great a quality as we expected.  We are familiar with the brand having purchased this echinacea at our local store, but finding it for a much better price here makes it easy to take regularly.", "rating": "5"}, {"helpful": 2, "title": "Liquid is better if you can swing it.", "body": "I don't notice any sort of difference with these.  Don't know if I'm not taking enough of them.  I hate that you have to take 6 of them a day to get a good dose.  liquid is better if you can swing it.", "rating": "2"}, {"helpful": 0, "title": "Quality Product", "body": "I sent this to my son, because he is often fighting some respiratory ailment.  I have used this herb in combination with high-dose 1000 mg. Vitamin C (L-Ascorbic Acid) for a decade or more at the first sign of a cold.  If a cold advances to the sore throat stage, I add a zinc lozenge.  I have not had a cold in well over a decade and I am 67 years old.", "rating": "5"}, {"helpful": 1, "title": "Awesome Supplement!", "body": "Love this supplement! I take it regularly and it makes a huge difference. I take it daily but work in retail so occasionally I do start to get sick. If I feel a cold coming on, I up the dosage and can usually it knock it out of me before it gets bad. I would highly recommend this supplement!", "rating": "5"}, {"helpful": 6, "title": "Wonderful Product for a Great Price", "body": "Echinacea is my go-to when I am feeling under the weather. I take 4-5 pills a day when feeling sick and they always seem to work their magic. 180 pills lasts me a couple of months while also allowing me the opportunity to share some with friends if they are feeling ill.", "rating": "5"}, {"helpful": 0, "title": "Good for you.", "body": "If you know what it is, then buy it.", "rating": "5"}, {"helpful": 0, "title": "Overall good brand", "body": "nature's way is good brand and I use them often .....sometimes they can be expensive check around", "rating": "5"}, {"helpful": 0, "title": "... caps and L-Lysine 500mg 3 caps when I feel like a cold is coming on or when I have ...", "body": "Use Echinacea 3 caps and L-Lysine 500mg 3 caps when I feel like a cold is coming on or when I have been coughed on in public places,  Can not afford to get sick and this combination works great for me", "rating": "5"}, {"helpful": 0, "title": "good quality and decent price", "body": "good quality echinacea....i've tried other brands but this one is reasonably priced and always good to have on hand", "rating": "5"}, {"helpful": 0, "title": "so good.", "body": "My friend suggested I take Echinacea with the hope to survive the winter cold season. So far, so good.", "rating": "5"}, {"helpful": 0, "title": "I take it daily", "body": "I have relied on daily Echinacea for years as a supplement to combat colds, flu, etc. In my opinion, I am definitely healthier than my peers and I believe that Echinacea plays a part in that.  I am happy with this particular brand. Thanks", "rating": "5"}, {"helpful": 0, "title": "Best herb for immune I also bought it for this ...", "body": "Best herb for immune", "rating": "5"}, {"helpful": 5, "title": "Didn't see anybody else having a bad reaction to it just praise", "body": "Allergic reaction.. I guess I should have done research on product. Its relations to ragweed makes it highly allergic for most people. Didn't catch that till after I took it and woke up covered in a rash! Didn't know it was that  highly allergic reaction. Didn't see anybody else having a bad reaction to it just praise. So I figured someone should warn others .dermatitis is no fun .", "rating": "1"}, {"helpful": 0, "title": "Immune System Super Booster!", "body": "Keeps my better half healthy,  Great for stopping colds or sicknesses before the arise by keeping your immune system boosted.  Will continue to buy!", "rating": "5"}, {"helpful": 0, "title": "For virus as well as biobugs", "body": "Take 3 of these at the 1st sniff of a cold and it will disappear overnight.  I've used it for 40 years and only got a cold when I DID NOT take my echinacea (my bad).", "rating": "5"}, {"helpful": 0, "title": "I take it daily", "body": "I have relied on daily Echinacea for years as a supplement to combat colds, flu, etc. In my opinion, I am definitely healthier than my peers and I believe that Echinacea plays a part in that.  I am happy with this particular brand. Thanks", "rating": "5"}, {"helpful": 0, "title": "Preventive and helpful.", "body": "I do not use the flu shot since every time I have taken it, I had the worst flu ever. Since I stopped the flu shoot have not been sick once. Just my personal experience. I do take this to help my immune system and it seems to have done that.", "rating": "5"}, {"helpful": 1, "title": "Don't buy these!", "body": "Don't buy these! They are just brown capsules that are empty or pretty close to empty!! I usually just pour them into my hand out of the bottle but today I actually picked one up and it was a hollow shell!! I checked the rest... They're all the same!  I've just been scammed! I guess I've been being scammed for months! Disappointed for sure!", "rating": "1"}, {"helpful": 0, "title": "Very effective!", "body": "When coupled with Nature's Way Golden Seal, this herb prevents colds and flu for me (if I take it early on, when I first feel symptoms.) I can't be sure it will work that well for everyone, but I'm a happy camper!", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Wouldn't go thru cold season without this. I never use antibiotics anymore, just echinacea.", "rating": "5"}, {"helpful": 1, "title": "Never get the flu", "body": "I take this and rarely even as much as on the label when I feel any signs of a cold or flu and never get it. When the rest of the house gets flu I might feel some cold like symptoms but take my pills and it goes away and no full blow flu. Taken as instructed these will do their job. Just don't take all the time, taken when exposed or when feeling first signs.", "rating": "5"}, {"helpful": 0, "title": "Overall good brand", "body": "nature's way is good brand and I use them often .....sometimes they can be expensive check around", "rating": "5"}, {"helpful": 0, "title": "For virus as well as biobugs", "body": "Take 3 of these at the 1st sniff of a cold and it will disappear overnight.  I've used it for 40 years and only got a cold when I DID NOT take my echinacea (my bad).", "rating": "5"}, {"helpful": 0, "title": "Great prevention to a full-blown cold", "body": "I've been taking Echinacea for years.  Whenever I feel that I have a cold coming on, I take a couple of these and it prevents a cold.  Better than getting sick.", "rating": "5"}, {"helpful": 0, "title": "Price drives me on my vitamin purchases", "body": "So this one must have been well priced for the count and mgs.  My husband takes regularly and I try to.  Good supplement I think but I am not a nutritionist!", "rating": "5"}, {"helpful": 0, "title": "Immune System Super Booster!", "body": "Keeps my better half healthy,  Great for stopping colds or sicknesses before the arise by keeping your immune system boosted.  Will continue to buy!", "rating": "5"}, {"helpful": 0, "title": "I am taking this (two weeks on, two weeks ...", "body": "I am taking this (two weeks on, two weeks off) with the Goldenseal and have been able to moderately maintain my health after sever mold exposure.", "rating": "5"}, {"helpful": 0, "title": "Very happy with it. I will buy it again", "body": "Very good! I was delivered quickly and well packed. I also love the fact that it is organic. A bottle like this will last you more than a month.", "rating": "5"}, {"helpful": 0, "title": "Echinacea", "body": "This was a good price for the 180 capsule echinacea and it was delivered quickly. I've taken echinacea for decades and it helps me avoid colds.", "rating": "5"}, {"helpful": 0, "title": "I started getting a sore throat and immediately started taking ...", "body": "I started getting a sore throat and immediately started taking this and it went away completely. Fabulous immune boasting/ preventative herb.", "rating": "5"}, {"helpful": 0, "title": "Works for me", "body": "I have used this product for several years. I take 4 capsules at the first sign of a sore throat and it usually goes away without incident.", "rating": "5"}, {"helpful": 0, "title": "Great stopper of the common cold.", "body": "My wife has used this several times to stop a cold before it gets started good.  Each time it has worked perfectly.  Super!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent quality, great price wonderful product.  Almost time to order more.  Allergy season kicks my butt sometimes. :)", "rating": "5"}, {"helpful": 0, "title": "I am a teacher, so I am always getting ...", "body": "I am a teacher, so I am always getting sick in the winter time. I decided to try it this to help boost my immune system and so far it has worked wonders, knock on wood I have gotten through flu season without getting sick!", "rating": "5"}, {"helpful": 0, "title": "Good stuff!", "body": "I take it whenever I feel like I am getting a cold. Knocks it right out! Good immune booster.Stay healthy this winter.", "rating": "5"}, {"helpful": 0, "title": "GREAT, HELP IMPROVE BODY AND I USE WHEN FIRST ...", "body": "GREAT, HELP IMPROVE BODY AND I USE WHEN FIRST SIGN OF COLD....REALLY HELPS TO SHORTEN AND REDUCE SYMTHOMS OF COLD...", "rating": "5"}, {"helpful": 0, "title": "good quality and decent price", "body": "good quality echinacea....i've tried other brands but this one is reasonably priced and always good to have on hand", "rating": "5"}, {"helpful": 0, "title": "General Well Being", "body": "Use this daily as part of our vitamin regimen for general wellness, and seems to ward off the onset of colds.", "rating": "5"}, {"helpful": 0, "title": "Best herb for immune I also bought it for this ...", "body": "Best herb for immune", "rating": "5"}, {"helpful": 0, "title": "Boosts your immune system", "body": "I love these! Anytime I feel a cold coming on I poo one of these and wake up feeling better than ever .", "rating": "5"}, {"helpful": 0, "title": "I love this product becasue it helps me stay healthy", "body": "I love this product becasue it helps me stay healthy. i rarely get sick anymore and when I do its mild.", "rating": "5"}, {"helpful": 0, "title": "so good.", "body": "My friend suggested I take Echinacea with the hope to survive the winter cold season. So far, so good.", "rating": "5"}, {"helpful": 0, "title": "It works like a charm", "body": "I swear by echinacea and garlic when I feel a bit of any sickness coming on!  It works like a charm!", "rating": "5"}, {"helpful": 0, "title": "Good stuff!", "body": "These are awesome. I take 3 a day for my immune system and will be buying more when I run out.", "rating": "5"}, {"helpful": 0, "title": "Nobody is ever sick here!", "body": "I even give it to my 3 mo. old pup as one ingredient to keep Parvo away. Working well so far.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Love echinacea, I take if I begin feeling sick, this with extra C usually gets rid of it.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "needed", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "overall great product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "so necessary", "rating": "5"}, {"helpful": 0, "title": "It works like a charm", "body": "I swear by echinacea and garlic when I feel a bit of any sickness coming on!  It works like a charm!", "rating": "5"}, {"helpful": 0, "title": "Great prevention to a full-blown cold", "body": "I've been taking Echinacea for years.  Whenever I feel that I have a cold coming on, I take a couple of these and it prevents a cold.  Better than getting sick.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "As Advertised.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I have used it for a long time", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Take it everyday.", "rating": "5"}, {"helpful": 0, "title": "Good price.", "body": "Gets the job done. Good price.", "rating": "5"}, {"helpful": 0, "title": "Works good", "body": "Works good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Excellent Quality", "body": "I have had great luck with every Nature's Way brand product I've used.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product and service.", "rating": "5"}, {"helpful": 0, "title": "I love this product becasue it helps me stay healthy", "body": "I love this product becasue it helps me stay healthy. i rarely get sick anymore and when I do its mild.", "rating": "5"}, {"helpful": 0, "title": "GREAT product and fast monthly shipping", "body": "I swear by this stuff!! GREAT product and fast monthly shipping!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "as described", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent.", "rating": "5"}, {"helpful": 1, "title": "Great immune boost when needed", "body": "I use this whenever I feel stressed or a cold coming on. Like getting a chill playing winter golf. Take 1-2 as soon as you feel iffy and the next day you are back to feeling fine. I give my Kitty (1/4 capsule per day mixed in wet food) when she has upper respiratory distress and it works better than antibiotics.", "rating": "5"}, {"helpful": 0, "title": "Great Quality", "body": "Greta product and quality. Does the job and will definitely buy again.", "rating": "5"}, {"helpful": 0, "title": "it works!", "body": "it works! we take it daily! all natural", "rating": "5"}, {"helpful": 0, "title": "Great price!", "body": "Quick shipping. Great price!", "rating": "5"}, {"helpful": 0, "title": "Very happy with it. I will buy it again", "body": "Very good! I was delivered quickly and well packed. I also love the fact that it is organic. A bottle like this will last you more than a month.", "rating": "5"}, {"helpful": 0, "title": "GOOD VALUE", "body": "GOOD VALUE, GREAT SERVICE, A+++", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I use this when I feel that I need an extra boost when I'm not feeling well. It helps!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent!", "rating": "5"}, {"helpful": 0, "title": "Nobody is ever sick here!", "body": "I even give it to my 3 mo. old pup as one ingredient to keep Parvo away. Working well so far.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Really works!!!", "rating": "5"}, {"helpful": 0, "title": "very good product.", "body": "Helps boost the immune system, very good product.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "I like it to avoid flu", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "Excellent product!", "rating": "4"}, {"helpful": 0, "title": "General Well Being", "body": "Use this daily as part of our vitamin regimen for general wellness, and seems to ward off the onset of colds.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great", "rating": "5"}, {"helpful": 0, "title": "Good stuff!", "body": "I take it whenever I feel like I am getting a cold. Knocks it right out! Good immune booster.Stay healthy this winter.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Take it every day, my preferred brand of Echinacea", "rating": "5"}, {"helpful": 0, "title": "Great to fight off colds", "body": "Great to fight off colds. Have used Nature's Way for years.", "rating": "5"}, {"helpful": 2, "title": "ALso this pill is light like colored air", "body": "I got it and am not sure if it is doing anything or not.  It has no smell. the last one I got from another company had that distinctive VITAMIN smell.", "rating": "3"}, {"helpful": 0, "title": "nec essary for our continuing good health herbal tablet", "body": "good price and excellent service. thank you", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good product, no fillers and really helps with sickness", "rating": "5"}, {"helpful": 0, "title": "works well for supporting immune system!", "body": "Great product!!!", "rating": "5"}, {"helpful": 0, "title": "Echinacea", "body": "This was a good price for the 180 capsule echinacea and it was delivered quickly. I've taken echinacea for decades and it helps me avoid colds.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "works for me.", "rating": "5"}, {"helpful": 0, "title": "Good product.", "body": "It was exactly what I expected.  Good product.", "rating": "5"}, {"helpful": 0, "title": "Dislike", "body": "It was not effective.", "rating": "1"}, {"helpful": 0, "title": "Three Stars", "body": "I'm not sure what it s doing for me and will probably not reorder.", "rating": "3"}, {"helpful": 0, "title": "Do it!", "body": "Good stuff!", "rating": "5"}, {"helpful": 0, "title": "Excellent", "body": "Excellent", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I think they work well.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "as described", "rating": "5"}, {"helpful": 0, "title": "Do it!", "body": "Good stuff!", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "Worked fine", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "Needed Item", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "works good", "rating": "5"}, {"helpful": 0, "title": "Works good", "body": "Works good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Very good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Needed Item", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent!", "rating": "5"}, {"helpful": 1, "title": "Don't buy these!", "body": "Don't buy these! They are just brown capsules that are empty or pretty close to empty!! I usually just pour them into my hand out of the bottle but today I actually picked one up and it was a hollow shell!! I checked the rest... They're all the same!  I've just been scammed! I guess I've been being scammed for months! Disappointed for sure!", "rating": "1"}, {"helpful": 0, "title": "Great brand. Great product. Highly recommend", "body": "I think very highly of Nature's Way as a brand so it was a no brainer to try Echinacea. I was not disappointed. First positive is that they are capsules so they go down easy. Second positive was that I did not burp the taste up at all like I have with other brands. (I have stomach issues)Third positive is the price, you cant beat it. Final positive is that my immune system is working great. While everyone else is sick and down for days I have been down maybe 1 day or not at all!", "rating": "5"}, {"helpful": 0, "title": "Great", "body": "Me and my daughter love this product.  Anytime we feel a sickness coming on we start popping these pills and our sickness never seems to make it for long!", "rating": "5"}, {"helpful": 1, "title": "Never get the flu", "body": "I take this and rarely even as much as on the label when I feel any signs of a cold or flu and never get it. When the rest of the house gets flu I might feel some cold like symptoms but take my pills and it goes away and no full blow flu. Taken as instructed these will do their job. Just don't take all the time, taken when exposed or when feeling first signs.", "rating": "5"}, {"helpful": 3, "title": "Organic herbs, animal gelatin capsule", "body": "I ordered this supplement to pack with other medicinals for a trip to South Africa--at the last minute.  Thanks to Amazon Prime I had it in 2 days. Right on Amazon Prime!! Only problem -- totally not usable owing to the animal gelatin capsules.", "rating": "1"}, {"helpful": 0, "title": "I am a teacher, so I am always getting ...", "body": "I am a teacher, so I am always getting sick in the winter time. I decided to try it this to help boost my immune system and so far it has worked wonders, knock on wood I have gotten through flu season without getting sick!", "rating": "5"}, {"helpful": 0, "title": "I love this herb", "body": "I love this herb!  I give it to my son and husband when they are sick but I also give it to them one week on and one week off during the cold/flu season to boost their immune system for prevention.", "rating": "5"}, {"helpful": 0, "title": "Great product to prevent colds", "body": "My go to echinacea that really helps me from getting sick -- but remember it only works if you take it when you are exposed to a cold -- not after you have symptoms.", "rating": "5"}, {"helpful": 6, "title": "Wonderful Product for a Great Price", "body": "Echinacea is my go-to when I am feeling under the weather. I take 4-5 pills a day when feeling sick and they always seem to work their magic. 180 pills lasts me a couple of months while also allowing me the opportunity to share some with friends if they are feeling ill.", "rating": "5"}, {"helpful": 0, "title": "It gets it done", "body": "Not as potent as the one from GNC,  you'll have to take two to equal one of theirs, but it still works and is significantly cheaper than the one atGNC", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Love it fast delivery", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "fine", "rating": "4"}, {"helpful": 0, "title": "One Star", "body": "Not work on me", "rating": "1"}, {"helpful": 0, "title": "Four Stars", "body": "Great value", "rating": "4"}, {"helpful": 0, "title": "Buy this!", "body": "Really helpful!!!", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "okay", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "good deal", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "okay", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "Ok", "rating": "4"}, {"helpful": 4, "title": "Great way to help prevent colds", "body": "I have always been pleased with Nature's Way Echinacea. If I take the full recommended dosage as soon as I begin to get sick, these pills can be very effective. I have read that Echinacea helps to boost a persons natural immunity to sickness, but it should not be taken every day. For this reason, I have a bottle of the pills at home and work, so I can start taking them as soon as I begin to feel a scratchy throat. I will then continue taking them at every meal and before bed for a week or two. I then stop using them and wait until I feel another cold starting. Using this simple \"On then Off\" system, I now rarely get a cold. When I do get sick, it usually only lasts a few days. Three bottles (180 each) lasts me about a year.", "rating": "4"}, {"helpful": 6, "title": "Kick that cold!", "body": "I bought these too ward off an oncoming cold. It really works! But you have to remember to take them, a lot of them. The bottle says 3 pills, 3 times a day. That is a lot of pills. But hey I guess it's better than getting a cold.", "rating": "4"}, {"helpful": 4, "title": "Echinacea really does work.", "body": "All my life, I never was able to fight off a cold. It always got so bad, I always had to go to the doctor. I always got so sick and in my teen years and beyond, bronchitis started to become the normal path of the cold. About 15 years ago, my brother told me about Echinacea and I picked up Nature's Way. I thought, I'll try it. If it doesn't work, I'll just end up at the doctors as always.", "rating": "5"}, {"helpful": 4, "title": "Great price on quality echinacea", "body": "I use a lot of echinacea for allergies. It really clears up my sinuses. I used to buy liquid echinacea for my allergies from my acupuncturist for $25 a month...this is much cheaper. Nature's Valley Echinacea is good (not top) quality, effective and much less expensive.", "rating": "5"}, {"helpful": 2, "title": "Great Product", "body": "This stuff helps me get through cold and flu season without giving up the things I like to do--or having to suffer from cold symptoms while at work. I just pop 3 when I'm feeling under the weather and that's it. The stuff is awesome...period.", "rating": "5"}, {"helpful": 2, "title": "No more allergy pills or shots!", "body": "As advised by my Dr., I take this for my allergy and cold symptoms.  Incredibly effective!  No side effects like I get from OTC and prescription meds.", "rating": "5"}, {"helpful": 2, "title": "Grand", "body": "Arrived on time, no colds in 5 years ;) puked in up when I had the stomach flu but that was my fault for taking anything besides fluid in.", "rating": "5"}, {"helpful": 1, "title": "Awesome product!", "body": "What can I say? Everyone around me was sick - one morning I woke up with a scratcy throat and knew I had it. I took two of these and 1000mg of Vitamin C three times that day, and the same the next 2 days. I didn't get sick. I've been taking one a day ever since. It works!", "rating": "5"}, {"helpful": 1, "title": "It works!", "body": "Buying it second time, looks like it does notably improve immune system.", "rating": "5"}, {"helpful": 1, "title": "great", "body": "Great product for a great price. Got these to help boost my immune system so I would not get sick as often. No complaints so far.", "rating": "5"}, {"helpful": 2, "title": "Good", "body": "It's a good product if your concerned about being healthy with natural supplements. The amount needed to take per day is a little tedious.", "rating": "4"}, {"helpful": 2, "title": "good product", "body": "Is what it is, cheap herbal supplement and a convenient way to buy it.  Cheaper than buying at whole foods for sure.", "rating": "4"}, {"helpful": 6, "title": "Kick that cold!", "body": "I bought these too ward off an oncoming cold. It really works! But you have to remember to take them, a lot of them. The bottle says 3 pills, 3 times a day. That is a lot of pills. But hey I guess it's better than getting a cold.", "rating": "4"}, {"helpful": 0, "title": "Trying to raise my resistance level.", "body": "Been taking this product for a month now and I'm still fighting glandular infection.  My brother and his wife take it and love it.  Will try it a little longer.", "rating": "2"}, {"helpful": 0, "title": "Not what I expected", "body": "I would not have bought this if I knew I had to take so many capsules. Look around for stronger stuff.", "rating": "3"}, {"helpful": 0, "title": "Didn't do a thing for me", "body": "Not much more I can say... certainly not worth the money.  I'm all about Nature's Way, but it didn't do a thing for me.", "rating": "1"}, {"helpful": 3, "title": "It's okay", "body": "You have to take three of the capsules, three times a day.  It's most inconvenient!  Here is this minimum word requirement.  Please change this policy!", "rating": "3"}, {"helpful": 6, "title": "Amazing stuff, I recommend it to my friends", "body": "I use a lot of this supplement, and it saved me from so much illness while working 64 hours a week/7 days a week. I've probably spent $70 on it this year, but it's saved me from weeks of pain and illness. Amazing stuff, I recommend it to my friends.", "rating": "5"}, {"helpful": 1, "title": "Wouldn't do without it", "body": "I've been taking this product for nearly 10 years; one in the morning and one in the evening. During that time I have not suffered one \"common cold.\" the flu, or other \"bugs\" that are going around town. I really feel it helps my immune system wihtout any unpleasant side effects such as one gets with the probiotics: so much in the spotlight these days.", "rating": "5"}, {"helpful": 3, "title": "Echinacia during cold season is a must and sooo worth it if you want to avoid health challenges!", "body": "This supplement I take daily along with Garlic, Ginseng and Probiotic and Oregano Oil - all by Natures Bounty  I feel fgreat and as a vocalist have had NO illness this winter thus far!  I highly recomend and have purchased 2 more bottles.  Very happy with product quality and use and outcome.", "rating": "5"}, {"helpful": 6, "title": "No sick days", "body": "I take 1 of these daily from the end of Sept until about Easter.  Even with a staff of folks (& their children) who are often ill AND working in a pediatric clinic, I have not had to take a sick day in 3 yrs.  I have recommended this to everyone I know who gets frequent colds, bronchitis, etc.", "rating": "5"}, {"helpful": 0, "title": "Excellent for cold season!", "body": "Absolutely love this product. Idk why I waited so long to add it to my routine. This has seriously helped me stay well throughout the spring cold season. This will be a permenant staple in my cabinet. Definitely helps boost your immune system!", "rating": "5"}, {"helpful": 2, "title": "Immune Support", "body": "I have a weak immune system. The doctors tell me to take certain vitamins and I have read that Echinacea also helps strengthen your immune system so I add it to my daily diet.", "rating": "4"}, {"helpful": 1, "title": "GREAT PRICE I TAKE THIS WHENEVER I HAVE A BLADDER ...", "body": "GREAT PRICE I TAKE THIS WHENEVER I HAVE A BLADDER INFECTION ALONG WITH CRANBERRY PILLS, AND WHENEVER I GET SICK WITH COLD/FLU'S.", "rating": "5"}, {"helpful": 1, "title": "I WANT TO ALWAYS HAVE SOME HANDY.", "body": "I use this whenever I begin to feel a bit too tired or like I may be catching a cold.  This, along with Vitamin C, and Kaloaba is GREAT@@@", "rating": "5"}, {"helpful": 0, "title": "Great to have Echinacea (lung function) and golden seal (immune ...", "body": "Great to have Echinacea (lung function) and golden seal (immune system) in one capsule.  Really helps in fighting off colds and flu bug, especially between Oct.- and Mar.", "rating": "5"}, {"helpful": 1, "title": "I like this Brand", "body": "I take 2 in the am and 2 at night.  Knock on wood, I haven't had a cold since I've started this regimen.", "rating": "5"}, {"helpful": 0, "title": "No issues with seller. I buy Echinacea whenever we ...", "body": "No issues with seller.  I buy Echinacea whenever we are running low.  We use it year round, and KNOCK ON WOOD, we haven't been sick!", "rating": "5"}, {"helpful": 0, "title": "Keeps you Heath", "body": "A most for winter cold & Staying heath.", "rating": "5"}, {"helpful": 0, "title": "Great!", "body": "Has kept me healthy for the most part.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Take twice a day, and keeps the doctor away!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great supplement", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "love it", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 4, "title": "Think I'm allergic to it:/", "body": "I'm fairly certain I'm allergic to this. I was getting hives on my back in the morning:/ I used to be okay with taking it years ago. I guess it's because I'm allergic to ragweed, other herbs and plants are similar to ragweed and cause some people issues. If you don't have crazy allergies this supplement helps boost your immune system.", "rating": "3"}, {"helpful": 1, "title": "excellent! Helps protect my immune system", "body": "excellent!  Helps protect my immune system!", "rating": "5"}, {"helpful": 6, "title": "Nature's Bounty Natural Whole Herb Echinacea Goldenseal Plus", "body": "I take this a couple times a day whenever I feel like I'm starting to get sick, or if I've been around someone who is sick.  I take it with vitamin C, and Zinc.  Several times I've felt like I was getting sick and after drinking lots of fluids and taking supplements for a day or two felt back to normal.", "rating": "5"}, {"helpful": 0, "title": "Best immunity boost ever!", "body": "This combo is hard enough to find online, impossible in stores anymore, so I use it sparingly all winter. A few before I'll be out at malls or public spaces with coughing/sneezing people, and a few more when I get home, and it amazingly staves off colds all season. I've been a huge fan of echinacea/goldenseal for years now.", "rating": "5"}, {"helpful": 0, "title": "Say goodbye to colds, coughs, and ailments!", "body": "This is a staple at our house.  I take it with the first sign of any sickness and it keeps me in top health.  It has also shortened the sickness times once a bug has been caught by several days.  Colds, Flu, stuffy nose, coughs, ear infections the Echinacea and Goldenseal root combination does the trick!", "rating": "5"}, {"helpful": 0, "title": "Always helps us during flu season. We keep this ...", "body": "Always helps us during flu season.  We keep this product on hand to combat winter ills.  We are both older, and more prone to pick up the flu/colds making the rounds.  This helps my husband and I resist the winter bugs.", "rating": "5"}, {"helpful": 1, "title": "Swear By It", "body": "Had purchased this brand previously in a local store and have sworn by it.  Other echinacea products I had tried previously didn't seem to fortify my resistance to colds.  This is the only brand that seems to do the job and I can honestly say it has been put to the test.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Always great!", "rating": "5"}, {"helpful": 1, "title": "excellent! Helps protect my immune system", "body": "excellent!  Helps protect my immune system!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great", "rating": "5"}, {"helpful": 0, "title": "Great immune support", "body": "This is a must for immune support all year long! I use this with other supplements right when I start noticing myself getting sick or just really blah and it will get over it faster then without it.", "rating": "5"}, {"helpful": 0, "title": "Good, I recomend", "body": "Have been using this for a couple of years now, as needed when a cold is threatening my inmune system. Works with flu symptoms and reduce the sick time.", "rating": "5"}, {"helpful": 1, "title": "I take one a day on a preemptive basis and ...", "body": "I take one a day on a preemptive basis and up the dose to approximately 2-4 per day when not feeling well.", "rating": "5"}, {"helpful": 0, "title": "It helps!", "body": "I use this in combination with other  natural remedies & believe this is helping me with not getting sick.  I will continue to buy this.", "rating": "5"}, {"helpful": 0, "title": "Works great", "body": "This is the best remedy for colds, and only this brand and formula. Take it at first sign of cold. I dissolve 2 capsules in water and drink it 3 times a day.", "rating": "5"}, {"helpful": 0, "title": "Husband uses this everyday. Always has,", "body": "Husband uses this everyday. Always has, but first time we added the goldenseal not sure how that will affect him waiting to see", "rating": "5"}, {"helpful": 2, "title": "Great Stuff for oncoming cold season", "body": "Long term user of Echinacea and this works great available at a decent price.  Stops oncoming colds and expedites cold recovery.", "rating": "5"}, {"helpful": 0, "title": "Cure for the common cold", "body": "I love this stuff.  I use this when I feel like I'm starting to get a cold and it knocks it out.  My husband does not use this and when we both get sick I always tell him he should of taken this stuff and he'd be better already.", "rating": "5"}, {"helpful": 0, "title": "Keeps colds away, for four years it has worked ...", "body": "Keeps colds away, for four years it has worked if I take one or two/a day at the start of the wintry season.", "rating": "5"}, {"helpful": 0, "title": "You gotta take it for a week after you feel better, or the cold will come back", "body": "This stuff if taken at the first sign of a cold, will minimize it.  You gotta take it for a week after you feel better, or the cold will come back.", "rating": "5"}, {"helpful": 0, "title": "Works great. Delivered on time and as advertised", "body": "Works great.  Delivered on time and as advertised.  I like that you can open the capsules and use them as tea.", "rating": "5"}, {"helpful": 0, "title": "For your health!", "body": "This is a great thing to take DAILY to prevent colds & flu!  Good value.", "rating": "5"}, {"helpful": 0, "title": "Works great", "body": "This is the best remedy for colds, and only this brand and formula. Take it at first sign of cold. I dissolve 2 capsules in water and drink it 3 times a day.", "rating": "5"}, {"helpful": 0, "title": "Cure for the common cold", "body": "I love this stuff.  I use this when I feel like I'm starting to get a cold and it knocks it out.  My husband does not use this and when we both get sick I always tell him he should of taken this stuff and he'd be better already.", "rating": "5"}, {"helpful": 0, "title": "Great preventative regimen", "body": "IF I take this as I should, I don't get the CRUD that I usually get when deployed to the middle east, which can be HORRIBLE due to the dust and the HIGH FECAL MATTER and other things in the air and dust.", "rating": "5"}, {"helpful": 0, "title": "Great Product. Name brand.", "body": "I do not know if this works, but was turned onto it a year or so ago. I take 1 pill 3 times a day, but if feel sick coming on up it to 6 a day with 2 per taking. Seems to work though as I have not had as many colds.", "rating": "5"}, {"helpful": 1, "title": "Fabulous!", "body": "I was initially nervous about trying herbs to maintain health, but after taking this to cure and to prevent several health issues, I am a firm believer! I always keep a bottle of this on hand now because it has helped me with so much (urinary tract infections, viruses, coughs, colds)!  My skeptical husband has traveled overseas a lot during winter months and is now a firm believer in this too!", "rating": "5"}, {"helpful": 1, "title": "Allergen Free!!", "body": "I take one daily to help keep my immune system on the up and up. I have had no problems taking this and have been taking it for over a year. Love how it does not contain any bad additives!", "rating": "5"}, {"helpful": 0, "title": "A must have!", "body": "Anytime someone around me is sick or I feel like I am starting to come down with something whether an itch at the back of the throat or just weak, I take 2 pills about 3 times a day along with some Oregano oil (both liquid and pills) and I wake up feeling 100% better. A must have for those who have weak immune systems! My friend had a cold, sat and talked with me for an hr, I forgot to take the pills, that same night I started sneezing my life away, but I immediately started taking these right when the symptoms started and I got better within the next day and 2 days later, all clear, while my friend was sick for about a week. She doesn't believe in taking vitamins or anything.", "rating": "5"}, {"helpful": 1, "title": "Excellent", "body": "Always have used this product and it works well. It builds your immunity.  If I have been around anyone who is sick, I take it immediately for a few days.  If I feel like I am getting sick, I take it and I \"usually\" don't get sick, or if I do, is very minimal.  Excellent product!!!!  And, you have to make sure when buying Echinacea that you buy the \"whole herb\" and I always get it with Goldenseal Root as it adds to the quality of the product.", "rating": "5"}, {"helpful": 1, "title": "I take one a day on a preemptive basis and ...", "body": "I take one a day on a preemptive basis and up the dose to approximately 2-4 per day when not feeling well.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "this works great - but you have to catch your cold immediately before it takes hold", "rating": "5"}, {"helpful": 0, "title": "Seems to help.", "body": "Seems to help with colds when I get one.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "this works great - but you have to catch your cold immediately before it takes hold", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "nice price. quick shipping", "rating": "5"}, {"helpful": 0, "title": "Once of prevention is worth a pound of cure.", "body": "A few of these every day or as recommended is a good to prevent colds and provide protection to your body.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "have been using this for years....take one tablet every day....thanks.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Would buy it again", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great stuff.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good quality", "rating": "5"}, {"helpful": 0, "title": "Good.", "body": "Works well if you think your coming down with a cold, I use this and Olive leaf.", "rating": "3"}, {"helpful": 0, "title": "Keeps colds away, for four years it has worked ...", "body": "Keeps colds away, for four years it has worked if I take one or two/a day at the start of the wintry season.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "A colleague of mine recommended Echinacea when I was coming down with a slight cold.  This products works!", "rating": "5"}, {"helpful": 0, "title": "Once of prevention is worth a pound of cure.", "body": "A few of these every day or as recommended is a good to prevent colds and provide protection to your body.", "rating": "5"}, {"helpful": 0, "title": "great to buildup your immunity", "body": "I always buy this product and it helps me prevent colds , flu,  great to buildup your immunity.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I really like this. Since I started taking it. I haven't had a cold even all through winter.", "rating": "5"}, {"helpful": 0, "title": "Good.", "body": "Works well if you think your coming down with a cold, I use this and Olive leaf.", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "I swear by this product.  The sickest I get is a cold, and that happens rarely.", "rating": "5"}, {"helpful": 0, "title": "All ways works", "body": "I use it to prevent colds and more. Works for years.Drink hot tea with it also.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Got it as promised. Been taking this product for quite a long time. Thanks!", "rating": "5"}, {"helpful": 0, "title": "For your health!", "body": "This is a great thing to take DAILY to prevent colds & flu!  Good value.", "rating": "5"}, {"helpful": 0, "title": "Satisfied Customer", "body": "Excellent brand, excellent product!!  I will definitely be reordering when my supply is low.  Moreover, I got it for a great price which made my shopping experience much sweeter.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Wipes out a cold fast", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Keeps the germs and illness at bay", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Take it daily and no issues.  Arrived on time", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Very good. Would buy again.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "excellent vitamin", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I really need to order more .", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I really like this. Since I started taking it. I haven't had a cold even all through winter.", "rating": "5"}, {"helpful": 0, "title": "Very good price", "body": "Very good price", "rating": "4"}, {"helpful": 0, "title": "great to buildup your immunity", "body": "I always buy this product and it helps me prevent colds , flu,  great to buildup your immunity.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good quality and a good price for the amount.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product overall.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "A tremendous product.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Very good strength and a good price. Works well for colds.", "rating": "5"}, {"helpful": 0, "title": "All ways works", "body": "I use it to prevent colds and more. Works for years.Drink hot tea with it also.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Just as described.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "GREAT!!!!!!!!!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Nice price and quick delivery!", "rating": "5"}, {"helpful": 0, "title": "Essential for good health of immune system", "body": "great product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Very good. Would buy again.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "nice price. quick shipping", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Wipes out a cold fast", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product overall.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "A tremendous product.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Would buy it again", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Just as described.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "excellent vitamin", "rating": "5"}, {"helpful": 0, "title": "Very good price", "body": "Very good price", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "As described!!", "rating": "5"}, {"helpful": 5, "title": "Love this brand", "body": "If I'm ever feeling like I'm getting sick, I just take two of these with every meal and I kick the bug before it gets me. I love it!! Not a supplement to take everyday though , since your body grows immune to it. Love it!!", "rating": "5"}, {"helpful": 0, "title": "A must have!", "body": "Anytime someone around me is sick or I feel like I am starting to come down with something whether an itch at the back of the throat or just weak, I take 2 pills about 3 times a day along with some Oregano oil (both liquid and pills) and I wake up feeling 100% better. A must have for those who have weak immune systems! My friend had a cold, sat and talked with me for an hr, I forgot to take the pills, that same night I started sneezing my life away, but I immediately started taking these right when the symptoms started and I got better within the next day and 2 days later, all clear, while my friend was sick for about a week. She doesn't believe in taking vitamins or anything.", "rating": "5"}, {"helpful": 0, "title": "Good for Colds", "body": "A good friend of mine, who refuses to take any medicines, remembered that her aunt - a \"health nut\" back in the 1960's, used echinacea to treat colds.  My friend and I both were struggling with colds we caught while on a cruise.  Something was going around, as many cruise members complained of hoarse voice and coughing. She bought some and took it, and her symptoms subsided dramatically in 24 hours.  For me, I did not have such a drastic change, but I did get over my cold quicker than normally, and I've been cold free for some time now.", "rating": "4"}, {"helpful": 0, "title": "No sickness for you", "body": "I feel better already! I got these to boost my immune system. I work with kids and they tend to have plenty of sniffly noses and coughs throughout the winter but guess who doesn't. ME! I use these supplemented with multivitamins and I've made it through 2 different sicknesses with 2 different kids!", "rating": "5"}, {"helpful": 1, "title": "Excellent", "body": "Always have used this product and it works well. It builds your immunity.  If I have been around anyone who is sick, I take it immediately for a few days.  If I feel like I am getting sick, I take it and I \"usually\" don't get sick, or if I do, is very minimal.  Excellent product!!!!  And, you have to make sure when buying Echinacea that you buy the \"whole herb\" and I always get it with Goldenseal Root as it adds to the quality of the product.", "rating": "5"}, {"helpful": 1, "title": "Fabulous!", "body": "I was initially nervous about trying herbs to maintain health, but after taking this to cure and to prevent several health issues, I am a firm believer! I always keep a bottle of this on hand now because it has helped me with so much (urinary tract infections, viruses, coughs, colds)!  My skeptical husband has traveled overseas a lot during winter months and is now a firm believer in this too!", "rating": "5"}, {"helpful": 1, "title": "May help with stopping  the start of a cold", "body": "Bought this to help when having a cold etc when no antibiotic around . Since it is more of a natural homeopath type product it seems to work when I used it as the start of a cold , sore throat , at least for me it has worked. It is not a fast acting type product but usually if I take it right at the beginning it seems to help with stopping anything from progressing.", "rating": "4"}, {"helpful": 2, "title": "Good for immune system!", "body": "This is a good value for both of these combined (golden seal and echinacea). We have mold in our house (the landlord is finally fixing the problem)--until then, this product is a great idea for battling the effects of livng in aspergillus mold.", "rating": "5"}, {"helpful": 1, "title": "Because my husband and use this product as a Natural ...", "body": "Because my husband and use this product as a Natural Antibiotic--we manage to escape many of the small illnesses such as the common colds, etc., it strengthens our immune system.", "rating": "5"}, {"helpful": 1, "title": "BIG capsules but easy for me to swallow.....", "body": "I have no idea if the claims for improved immunization using echinacea are true....I just know my colds last less long when I use the stuff.  Maybe it's psychological or maybe those giant capsules actually work! LOL", "rating": "5"}, {"helpful": 0, "title": "Great stuff", "body": "Echinacea is a daily supplement to keep illness away.  Although I take it year-round, twice a day, during the flu season, I up my intake to keep from getting sick.  It helps immensely.  Highly recommended.", "rating": "5"}, {"helpful": 1, "title": "Great combination!", "body": "Great Product at a great price. Best combination out there. Works like a charm. Haven't been bed ridden sick since I started using it.", "rating": "5"}, {"helpful": 0, "title": "Never get sick again", "body": "I swear by Echinecea. It's awesome to use all year round and keeps you from getting sick and all other viruses. They should make this for children!", "rating": "5"}, {"helpful": 1, "title": "What is the mg content?", "body": "This was shipped as per advertised.  But online posting didn't reveal any content by mg.  So what is the content?  When bottle arrived it revealed 450 mg of Echinacea/Goldenseal Blend... no breakdown between the two.  further these capsules are huge!  I'd prefer to find a supplier with gelcaps (as opposed to capsules) that also provides a breakdown of content by mg when advertised.", "rating": "2"}, {"helpful": 1, "title": "Works for me", "body": "I have tried many different bands of Echinacea. Used before travel and when I feel a cold coming on to help boost my immune system as a preventative. This brand seems to always work where some of the others did not seem to have the desired effect. It is easy to take (capsule form) as compared to some brands that are pressed powder and impossible to swallow.", "rating": "5"}, {"helpful": 8, "title": "Work wonders!", "body": "I've used quite a few fiber supliments trying to get my son regular. These did the trick! They are much better than other supplements that made his stomach hurt or did nothing, or both. He takes these everyday now and we have had no issues since beginning them, they work wonders for a kid with lots of stomach issues. If this review was helpful please click yes!", "rating": "5"}, {"helpful": 8, "title": "... do not have the sugary substance surrounding the gummy like other brands", "body": "These do not have the sugary substance surrounding the gummy like other brands. My son has sensory processing disorder and autism, which causes him to have a hard time with certain textures among other things. Sometimes he loves these and sometimes he isn't interested. But he doesn't spit them out when he eats them, so they are great in my opinion! Would recommend and repurchase as long as he keeps eating them!", "rating": "5"}, {"helpful": 5, "title": "Excellent product - helped my child to catch up to his peers even though he was labelled 'disabled' at birth.", "body": "Excellent product.  I can tell the difference in IQ and reaction time in my mildly autistic children from using this product.  They are usually picky, and they beg for these before bedtime each night.  My son had an ischemic brain injury due to placental abruption at birth - I attribute these to his ability to catch up physically and mentally to his peers by age 2.  I have also enjoyed algal DHA and NAC supplements for myself to help with memory and cognitive ability.", "rating": "5"}, {"helpful": 2, "title": "These gummies are perfect for my kiddos", "body": "These gummies are perfect for my kiddos. We were looking for a supplement that would help boost our kids immune systems, since now in school they seem to pick everything up. These gummies come in a variety of colors and shapes which my kids like. They are actual gummies (like a fruit snack) so my kids are actually excited and ask me for them if I forget (yes, how nice is that). We have purchased the sugar coated gummies - generic store brand and my kids hated them - so it's nice to finally have a product they like. The only thing I wish was different about this product is if it came in a larger container and size. We seem to go through this quite quick with 2 kids and the recommended dosage. A bulk container would be great to have for this product!", "rating": "5"}, {"helpful": 1, "title": "These were a no-go for my family.", "body": "Unfortunately my son took one sniff and crinkled his nose at these. I tried to convince him to just try them, so to appease me he licked one and then threw the two away that I had given him. From a shipping standpoint, they did not hold up well to the heat and were slightly melted which made the texture weird. Because I didn't want the money wasted I decided to give these a shot myself. Unfortunately I did not enjoy the taste either. These were not a good fit for us. I'm a bit bummed that I basically spent $11 for  four gummies since I have a feeling they're going to remained untouched.", "rating": "2"}, {"helpful": 2, "title": "Warning Aluminum specks stuck many gummy bears", "body": "I discovered after buying many bottles for my daughter there are tiny specks of aluminum that are stuck to several of the gummy bears, many are hard to see unless you look closely under a bright light.  I don't know if this is a mistake that happens in packaging, but after trying to open the seal very carefully each time and also finding it stuck to gummy bears at the bottom of the bottle I realized it wasn't how I opened the bottle, these were already stuck to the gummy bears. I check each one carefully before giving to my daughter.  I' be bought at least 15 bottles from different places and it's in all of them.  I hate to think how many I gave to her before I noticed this.  Has anyone else seen this?  If you look under bright light you can see a tiny speck of aluminum stuck to about 1 in 4 of them if not more, you can wipe it away, but I'm sure a lot of people don't see this and are giving it to their kid without realizing it.", "rating": "2"}, {"helpful": 3, "title": "Two-Year-Old Approved", "body": "Finding an Omega 3 + DHA supplement for my two year old boy was priority. These are rapid years of brain development and I know he's not getting enough of this from his food. We tried another similar supplement and the gummies were SO gross. But he LOVES these ones. He asks for them every single day and takes them happily. Will continue to buy them!", "rating": "5"}, {"helpful": 1, "title": "Greens in a bottle...", "body": "As many whom believe in a good fiber diet, we've got these dietary supplements to help those everyday bowel movements; As a result, we find that supplements help us overcome those kitchen table fights over eating those greens. We believe that this vendor has done a great job at making their supplements tasty enough that even the most pickiest child can accept the supplement; We're not big on candy | sugars, thus when it comes to supplements, we simply want supplements that produce results; not placebo effects.. :)", "rating": "5"}, {"helpful": 1, "title": "Helps with my no veggie eater", "body": "My daughter has sensory processing disorder and is very sensitive to smells flavors and textures so veggies don't happen much. Her psychologist stresses the importance of nutrition for her ADHD and recommended a supplement to help with what she's missing. I tried a liquid vitamin and she refused it completely. It smelled awful. So I got these and she eats them with no complaints. I know a gummy can't totally replace the benefits of vegetables, but it eases my mind that she is getting something.", "rating": "5"}, {"helpful": 1, "title": "Son says they're \"too yucky\"", "body": "My son initially tried these and refused to take them. After some time, I tried again and he took only the \"red ones\" for a couple weeks, but then he told me he doesn't want to take them anymore. I don't find them to be great tasting. When I tried them, they had a metallic aftertaste.", "rating": "1"}, {"helpful": 0, "title": "Too chewy for my kiddo so I guess I'll eat them.", "body": "These taste like and have the consistency of regular gummy bears. My son doesn't love them. I give him a little dish of his gummy multivitamin, gummy elderberry supplement and gummy vitamin C gummies. Unfortunately I find more of these stuck to furniture, carpet, clothing and the dogs than I think he actually consumes. He'll even hand me back the dish, tell me he's done and these vitamin C gummies will still be there. It's not the product's fault, it's just a matter of taste. I'll be looking for a softer gummy in the future.", "rating": "3"}, {"helpful": 0, "title": "Yummy and good for them!", "body": "Kids love the flavors.  I tried one first, just to be sure, and they taste just like the candy gummy bears.  My kids weren't sure at first, but they tried them and really like them.  They ask for them now.  I have yet to see any major improvement in focus and lessening anxiety symptoms, which is why I originally decided to try a DHA supplement for my kids.  But, hopefully it will help more over time.  They've only been taking them for a little over a week.", "rating": "5"}, {"helpful": 0, "title": "Best Vitamins for Picky Kids", "body": "I have a 4 year old that is a very very picky eater.  He just plain refuses to like any vitamins. I have tried chewable, liquid, gummies and even sour gummies. These taste like gummy bears not a vitamin. At first my son resisted but eventually gave in to liking these. I started out making him eat one and then after he stopped fighting I moved him up to 2 a day. He is now happy to eat them everyday. I am so happy I tried these.", "rating": "5"}, {"helpful": 3, "title": "These work better than any other children’s fiber supplements we have tried", "body": "My daughter has had problems with constipation since she was a toddler we tried all kinds of fiber supplements but none have worked until we started using Yummi Bears Fiber. The difference of Yummi Bears Fiber and other children’s fiber supplement’s is that it’s made with Chicory root, whereas the other fiber supplements we tried use fruits and vegetables which my daughter already eats plenty of, but it did not help her problem. I see some negative reviews about the amount of fiber per gummies being too low however; we only use two a day rather than the recommended four and it’s enough. I guess it depends on why you’re using them if it’s for regulation than I highly recommend these gummies.", "rating": "5"}, {"helpful": 1, "title": "There Ggggreat", "body": "I get these on amazon subscription because they are the only multivitamin I can get my whole family to eat. I hand them out in the morning even when guests are over.  No one refuses a gummy.  As far as the content I haven't been able to differentiate too much between ingredients but because they are gummy its much easier to get anyone to eat them.  Remember 3 are 1 serving so 1 bottle lasts 1 month (30 servings 90 gummies.)  They DO NOT TASTE LIKE CANDY but they don't taste like chalk either.  A digestible in between without a bad aftertaste is where they land.", "rating": "5"}, {"helpful": 0, "title": "Finally...a gummy my kids will eat!", "body": "They look, feel, and taste like normal gummy bears, so my kids will eat these without a fuss. They love these! We've tried many types of vitamins and gummies, including the organic version of these. They hated all of them. So I had to use the expensive liquid vitamins from Europe until I found these!", "rating": "5"}, {"helpful": 4, "title": "Toddler Loves... But Only 15-Day Supply per Bottle", "body": "My two and half year old refuses to eat vegetables. To get her the fiber she needs, I sneak fruits and veggies into her food but it's hard to get her to eat enough. I give her these fiber supplements to increase her fiber intake. With these and lots of water, she stays regular.", "rating": "4"}, {"helpful": 0, "title": "Arrived melted :(", "body": "We usually purchase these vitamins at a natural food store about 15 min from our home but since we had a good bit left I ordered online. When I opened them up, the individual pieces we all melted out of shape and some stuck together. We eventually broke them up with a butter knife and could give them to our daughter like that but it was a headache.", "rating": "2"}, {"helpful": 0, "title": "Super Tasty for a Super Kid", "body": "My very picky son has tried all types of vitamins and he loves this brand. It tastes great and has all the vitamins he needs. I also use Yummi Bear omega 3 and it is a hit, doesn't even taste like fish because they use chia seeds instead of fish oil. Buying it on Amazon is so much cheaper than wholes foods. Both vitamins are the same size and shape, they look like cute gummy bears.", "rating": "5"}, {"helpful": 0, "title": "Love this brand.", "body": "I love all of the \"Hero\" nutritional brand. I take these multi each day and when I don't take them, I can feel the difference in the energy level.", "rating": "5"}, {"helpful": 0, "title": "Arrived melted :(", "body": "We usually purchase these vitamins at a natural food store about 15 min from our home but since we had a good bit left I ordered online. When I opened them up, the individual pieces we all melted out of shape and some stuck together. We eventually broke them up with a butter knife and could give them to our daughter like that but it was a headache.", "rating": "2"}, {"helpful": 2, "title": "Excellent product, just not from this seller", "body": "My kids take this supplment daily.  Our first order came with the seal broken and the paper detached.  I contacted the seller after processing the return and was told that he would ship it out immediately and I would not be charged for the order.  I went to the hassle of returning the defective product and no credit was given.  Too, the replacement came but all the bears are stuck to one antoher which makes me question how the product is stored at their facility.  I have cancelled my subscribe and save from this vendor.", "rating": "3"}, {"helpful": 0, "title": "Finally...a gummy my kids will eat!", "body": "They look, feel, and taste like normal gummy bears, so my kids will eat these without a fuss. They love these! We've tried many types of vitamins and gummies, including the organic version of these. They hated all of them. So I had to use the expensive liquid vitamins from Europe until I found these!", "rating": "5"}, {"helpful": 0, "title": "Smushed, but taste good...", "body": "Not sure what happened to these gummies, but essentially got a jar with ONE GIANT GUMMY! Literally had to use a fork and scrape a wad of them out at a time!  The bears are smushed and distorted, so you can't really tell they are bears.  However, tummy's don't care what gummy's look like, I didn't have any others left, (and it's nice to have an option for allergic kids!) so I peeled them apart, they still taste good, and gave the kids smushed gummy's!  They laughed at them, but didn't have any problem eating them.", "rating": "4"}, {"helpful": 1, "title": "Great Product - Bad Return Policy", "body": "I started buying these vitamins for my daughter in the winter and she really likes them.  Recently I placed an order, and due to heat, they arrived melted into one large blob.  I was about to return them, then I noticed Amazon writes about the melting problem in the description (though they claim it's \"rare\") and will not accept returns on the vitamins.", "rating": "3"}, {"helpful": 0, "title": "Love this brand.", "body": "I love all of the \"Hero\" nutritional brand. I take these multi each day and when I don't take them, I can feel the difference in the energy level.", "rating": "5"}, {"helpful": 0, "title": "Great supplement", "body": "This vitamin supplement is a must, since taking this regularly, my children are hardly ever gotten sick even if everyone else at school got flu. When they're a bit under the weather I gave them extra gummies and they gotten over it in no time.", "rating": "5"}, {"helpful": 2, "title": "Work Great", "body": "I have been giving my daughter Pedi-lax fiber since she was two years old, she is now 4.  For some reason I could not find that product anywhere anymore so I went on amazon to see what I can find.  I came across Yummi Bears.  I was worried if it would work the same but I bought them anyway.  I feel like they work much better.  The Pedi-lax if I gave her the full amount the suggest her poop would  be like water.  If I gave her less she would be crying that it hurt.  With the yummi bears I give the suggested amount and her poop comes out fine and not like water.  She loves the taste too.  I will contine to buy this one.  She likes them much more and I see much better results.", "rating": "4"}, {"helpful": 0, "title": "First one my child likes", "body": "I previously purchased the Nordic Berries for my 2 year old daughter since I read that they were so good, but my daughter did not take to them at all due to their very sour flavor and I wound up returning them. These,however, were received with warm welcome and she loves to take them every day! I would highly recommend them for those who have picky eaters. Aside from being tasty, they are very natural and supply a great balance of vitamins and minerals. We'll be buying these for years to come.", "rating": "5"}, {"helpful": 0, "title": "Arrived on time but...", "body": "Arrived on time but I had to throw the bottle away. It arrived on a hot sunny day when the weather was 100 plus degrees. We had not heard the doorbell ring - it probably arrived sometime in the afternoon. When I found it the next morning, all the gummies were melted and it looked like apple jelly. I had to throw away the bottle.", "rating": "4"}, {"helpful": 0, "title": "Great vitamins, kids love them", "body": "These vitamins are great. However, be aware if you order these in the hot summer months they will arrive in one big melted lump! Not the fault of Amazon, just a product of the hot summer weather. I was still able to pull the bears apart once they cooled, but they aren't really bear shaped anymore. I think I'll wait until it's cooler then stock up before next summer.", "rating": "5"}, {"helpful": 2, "title": "Best Overall Vitamins I've Found for My 2 Year Old", "body": "~BACKGROUND~", "rating": "5"}, {"helpful": 6, "title": "Only order during colder months", "body": "Only order these if you live in a colder state or during the colder months of the year. Amazon does not properly package these gummies. I received my first order and it was completely melted. I contacted Amazon about the order, told them about the packaging issue, they promptly sent me a replacement overnight. The only problem is, they still didn't package it any differently and that one was melted too. I finally gave up and requested a refund. Maybe I'll try again when the weather is cooler.", "rating": "2"}, {"helpful": 1, "title": "This is the only gummie I could get them to take", "body": "My kids don't like sour patch kids candy so this is the only gummie brand I could get for a while.  They've now grown into that sour patch flavor but we still keep this one.  Found a lot of research online that Omega 3 is good for ADHD and ADD symptoms.  Mine don't have that but if it helps them focus better I'm for it.", "rating": "5"}, {"helpful": 0, "title": "My son loves these!,", "body": "These are the best, my son doesn't eat too many vegetables so I like to give these to him and he loves them. Just be sure you are home when they are expected to be delivered because if they sit outside too long they will melt! Received a bottle the other day that was completely melted. I will be sure to be waiting at door when replacement comes! That's what I get for living in miami.", "rating": "5"}, {"helpful": 2, "title": "Good stuff for little bodies!", "body": "This is the second time I have purchased these vitamins for my kids through Amazon. I can't find a better price anywhere on the Internet or locally. I started using the vitamins because my oldest son has sensory issues and his diet is limited. While I know these don't make up for the real deal - it makes me feel better to know his diet is supplemented. A bonus is both the kids really enjoy the taste of them and ask for them each day.", "rating": "5"}, {"helpful": 0, "title": "Great tasting omega gummy without sugar coating", "body": "These are the best tasting omega 3 gummies I have tried. My 2 year old son is super picky and eats these with no problem. He doesn't like the ones covered in sugar, he prefers the smooth texture of this supplement. I am so relieved to have found this supplement.", "rating": "5"}, {"helpful": 1, "title": "Couldn't tell if they were beneficial or not", "body": "I tried these gummies for my toddler as an alternative to the Herbs for Kids liquid echinacea. He liked the taste of the gummies, but I could not tell that they provided any benefit to him. We're going back to the liquid. It's less convenient, but noticeably helps him recover more quickly from respiratory illness.", "rating": "3"}, {"helpful": 1, "title": "Not an Organic product", "body": "I called the manufacturer and in addition to Fruit and Veg concentrates it also has various other chemicals/products such as Gelatin (made from Pork skin). They also confirmed that Amazon description is incorrect. Only the Fruit concentrates are organic. Everything else including all veg are NOT organic.", "rating": "2"}, {"helpful": 1, "title": "Nutrition in a bottle...", "body": "With kids at home, we find that ensuring the full nutrition coverage is hard to obtain sometimes; Ranging from the 'picky' eats, or the attraction to pizza | chicken nuggets, we tend to place our faith on this vendor to overcome those sugary sweet cravings; We've come to expect great results from this supplement, as we find that our 'pickiest' eater is beginning to readily accept this supplement without the necessity to constantly remind. Sugar | sweets are not a big thing in our house, as our kids seem to find that their bellies are full from their well-balanced meals. Apart from the TV brainwashing commercials, my kids tend to flock to oreo cookies, but we still find that these supplements help to overcome any of those constant cookie cravings.. :)", "rating": "5"}, {"helpful": 1, "title": "Good vitamins", "body": "Not much you can say about vitamins. They seem to taste nice because my daughter will request them if we forget to give them to her. I was just happy to find them on Amazon and not have to pay the Whole Foods price for them which is more than twice this amount.", "rating": "5"}, {"helpful": 0, "title": "My son refuses to eat them", "body": "We've used other funny fibers so when I found them from this brand, which we use for a vitamin for a son, who loves loves them, I figured I scored. I was wrong. My son refuses them due to the taste and even prefers eating an off brand.", "rating": "2"}, {"helpful": 0, "title": "I was looking for something to enhance my children's health ...", "body": "I was looking for something to enhance my children's health. These yummy bears Are just what I was looking for.  My kids are very picky when it comes to food, so these omega-3 and DHA supplement fill that void that they are missing.", "rating": "5"}, {"helpful": 0, "title": "The only Omega 3s my super picky 2", "body": "The only Omega 3s my super picky 2.5 yr old will take. A little pricey compared to other brands but worth every penny because she will actually take them! They run about $30 at CVS unless they are on sale (I've seen $22 on sale) so this is a decent price for this brand. Definitely recommend these!", "rating": "5"}, {"helpful": 0, "title": "Love the bears, but they melted!", "body": "We usually buy these from Whole Foods, but I thought I'd buy them online and save money. But they were delivered US Mail instead of UPS and put into a hot box metal mailbox where they sat for a few hours until I got home. They were soup, literally. I poured out the contents into a small muffin tin in hopes we can still use them. Be advised, hot weather and these bears do NOT mix!", "rating": "5"}, {"helpful": 0, "title": "Love these gummy bears", "body": "Love these gummy bears.  I have a very picky toddler and getting him to consume anything is challenging.  He will not eat most omega vitamins because they have a sugary coating on them.  This gummies however taste great and he asks for his vitamins every morning.", "rating": "5"}, {"helpful": 0, "title": "flavor is great and they are easy to chew", "body": "The kids love having this and think its a special treat. The serving size is a couple of pieces and I only give the kids 1 per day so they probably aren't getting that much.  The flavor is great and they are easy to chew.", "rating": "4"}, {"helpful": 0, "title": "Top value", "body": "My son (2.5 yrs.old) looks forward to eating these everyday! I've tried them too myself, and unlike other gummy vitamins with omega-3, you can't taste the fishy-ness at all. Plus, it's free of any of the major allergen ingredients, and made in the U.S.A.. What's not to like? Sure, they are on the pricier side, but to me, it's worth it.", "rating": "5"}, {"helpful": 0, "title": "Love these!", "body": "I get these for my son, he does not like to take vitamins of any sort. He loves these and I feel you cannot go wrong with fiber. Especially with all the junk food kids eat when you are not looking.", "rating": "5"}, {"helpful": 1, "title": "I have bought the Yummi Bear Echinacea many times. ...", "body": "I have bought the Yummi Bear Echinacea many times.  However, the last box I got, they were all stuck together.  I believe it was in the 90's when it was delivered and so, it did not fare well.  Not the companies fault but, don't order if they will sit out in extreme temperatures for too long.", "rating": "1"}, {"helpful": 0, "title": "YUMMY!", "body": "I've been buying these for years for my kids and now for me!  I had a nutritional evaluation done and what I was in need of vitamin wise is exactly what is in these YBs---Vitamin A, C and E---nothing more than that like other vitamins have.  This way I get just what I need without wasting money-----great price", "rating": "5"}, {"helpful": 2, "title": "I like the fact that these vitamins are all natural with ...", "body": "I have a 5 year old daughter who LOVES these DHA vitamins.  DHA and Omega 3's are essential to healthy brain development.  I like the fact that these vitamins are all natural with no artificial dyes for color.  My 5 year old likes how they taste and happily chews her three gummy bears at breakfast.  I have also noticed that she does not get sick like other kids around her in her class.  I'm not trying to claim that these vitamins are doing the trick alone, but there is research out there that states DHA and Omega's can help boost immunity too!", "rating": "5"}, {"helpful": 4, "title": "Mixed Feelings", "body": "These seem great and my two year old loved them, but then I read a study about vitamins.  It listed each vitamin that was tested (adults and children) and what the results were.  Yummy Bears scored off the charts in some of the vitamin content, higher than they are supposed to contain.  The study found that vitamin A in large doses is dangerous and this was one of them that was over. The study said if you gave these each day like most people do, you could cause serious problems.  Flinstones were not my first choice, but at least they had in them what they said they did. I made the switch.", "rating": "4"}, {"helpful": 1, "title": "Just OK", "body": "The upside -- my VERY picky 4-year-old will eat these (he won't take any of the gummies that have a sugary/granulated coating). I've tried every other brand of gummy fiber supplements, and these are the only ones he'll eat (except the PediaLax ones, but those have been discontinued by the manufacturer).", "rating": "3"}, {"helpful": 0, "title": "very good!", "body": "I've had problems with my 3 year old son refusing to take vitamins no matter what flavour they were. A friend recommended to try this brand and it works! Although I did not tell my son they are actually vitamins. I just play a game with him that three bears are running to his mouth to count his teeth (daily dose is 3). He even asks for more! Will definetely continue buying them.", "rating": "4"}, {"helpful": 0, "title": "These are great. I hate taking regular vitamins", "body": "These are great. I hate taking regular vitamins. Even though I'm not a kid, I love these. Also, they're gluten free, which is good for me, since I'm allergic.", "rating": "5"}, {"helpful": 0, "title": "Tasty, and higher quantities of essential vitamins", "body": "My very picky 3 year old loves these!  I chose them because of their more complete nutrients over other similar brands, as well as the dye and preservative free qualities.  I love that there is almost 4 times more zinc in these than other brands.  No complaints here, and we'll continue to buy this brand for a long time. It's worth the few extra dollars....", "rating": "5"}, {"helpful": 0, "title": "THIS VITAMIN TASTES LIKE CANDY! I JUST WISH AS A MOTHER OF ...", "body": "THIS VITAMIN TASTES LIKE CANDY! I JUST WISH AS A MOTHER OF MORE THAN ONE CHILD IT CAME IN A LARGER PACKAGE OR HAD A LOWER DOSAGE SO THAT IT COULD LAST ATLEAST A MONTH.", "rating": "4"}, {"helpful": 0, "title": "Quantity per Bottle has Changed", "body": "These are great!  BUT just got my order today and am disappointed that the quantity per bottle was reduced down to 45 from 60.  No wonder I haven't been able to find it locally.  Quantity has changed but the price per bottle hasn't...  the description and picture of this item should be updated to reflect the correct amount.", "rating": "2"}, {"helpful": 4, "title": "Expensive, lacking in fiber", "body": "Initially I was excited about this product. For the most part my child likes it but sometimes he gags on it and spits it out. He has some medical issues and really needs to boost his fiber intake. This is not the product we need. It has very little fiber, and he needs to take 4 bears just to get 1.2g. I'm switching to Benefiber, which I already have, and I can easily add it to my son's juice without impacting the flavor or texture.", "rating": "2"}, {"helpful": 0, "title": "Love the bears, but they melted!", "body": "We usually buy these from Whole Foods, but I thought I'd buy them online and save money. But they were delivered US Mail instead of UPS and put into a hot box metal mailbox where they sat for a few hours until I got home. They were soup, literally. I poured out the contents into a small muffin tin in hopes we can still use them. Be advised, hot weather and these bears do NOT mix!", "rating": "5"}, {"helpful": 2, "title": "Work Great", "body": "I have been giving my daughter Pedi-lax fiber since she was two years old, she is now 4.  For some reason I could not find that product anywhere anymore so I went on amazon to see what I can find.  I came across Yummi Bears.  I was worried if it would work the same but I bought them anyway.  I feel like they work much better.  The Pedi-lax if I gave her the full amount the suggest her poop would  be like water.  If I gave her less she would be crying that it hurt.  With the yummi bears I give the suggested amount and her poop comes out fine and not like water.  She loves the taste too.  I will contine to buy this one.  She likes them much more and I see much better results.", "rating": "4"}, {"helpful": 0, "title": "My Kids LOVE them", "body": "Love these my kids take them every day. They love taking them", "rating": "5"}, {"helpful": 0, "title": "My kids and I like these vitamins", "body": "My kids and I like these vitamins. The company produces high quality products and my kids eat  their vitamins feeling like they had a treat.", "rating": "5"}, {"helpful": 6, "title": "Expensive for what you get", "body": "60 gummies in the bottle, but you have to take 4 per day!!!  I really wish I'd read the reviews before buying these.", "rating": "1"}, {"helpful": 0, "title": "Son with Autism Likes Them", "body": "My son has autism and can be very picky about the texture of vitamins that he will eat.  He won't eat anything with grit on the outside (like sugar coating).  He has gone through other vitamins he won't eat, but these he does well with.  I feel like they are good quality.", "rating": "5"}, {"helpful": 0, "title": "Waste of money.", "body": "Would not order again from here. These gummies were so unfresh and hard that you could not even chew them up. I've bought from other places and they've never been hard. These were break your teeth hard.", "rating": "1"}, {"helpful": 0, "title": "These are the best vitamins around for kids because they are made from ...", "body": "These are the best vitamins around for kids because they are made from FOOD and not sugar and food coloring.", "rating": "5"}, {"helpful": 0, "title": "Little guy eats them fine with no complaints", "body": "Less sugar than some of the other brands I found. Little guy eats them fine with no complaints.", "rating": "5"}, {"helpful": 0, "title": "My kids love these. They taste great", "body": "My kids love these.  They taste great, not too sweet or chew.  I've tried other brands that my kids thought tasted artificial and I thought were too sweet.", "rating": "5"}, {"helpful": 1, "title": "Great Preventative Supplement!", "body": "Wonderful product! My son has not needed antibiotics for sinus infections for the past two years I have given these to him daily.That's worth a lot to me!!!", "rating": "5"}, {"helpful": 0, "title": "Yummy…", "body": "I have been giving these things to my son for several years now. At six years of age… who knows if they make a difference…. Docs advise them, so…..  Oh yeah, these yummy bears guarantee that my son will come in for breakfast eschewing the iPad…..", "rating": "5"}, {"helpful": 0, "title": "Delicious!", "body": "Gelatin based with fruit juice, cane sugar, glucose and citric acid are the basic ingredients. If you want something without artificial colors and artificial sugars these are great. A delicious way to remember to take your vitamins! The bottle has a cornucopia of fruits pictured. There are really only 4 flavors though that I can tell. Red- strawberry/grape. Yellow- lemon. Dark yellow-pinepapple. and Orange. Daily serving for kids is 3. So adults can take 6...which I do :)", "rating": "5"}, {"helpful": 0, "title": "Great Gummies", "body": "Well priced and the kids really like the flavor.  So glad to find a child's chewable Omega product and DHA answers the need for ascorbic acid ( vit c) needs as well.", "rating": "5"}, {"helpful": 0, "title": "Recomendadas", "body": "Muy buen sabor y gran cantidad de vitaminas para mi hija se las come sin problemas hasta le ayuda en el apetito solo le doy una al día y mas que suficiente las probé y el sabor es mejor que las chucherías que le compro nunca hay problemas para que las coma totalmente recomendadas", "rating": "5"}, {"helpful": 0, "title": "Great!", "body": "These work very well for all 3 of my kids ages ranging from 2yrs to 7 yrs (pediatrician approved, of course). I subscribed and get these automatically mailed to me every month. I highly recommend!", "rating": "5"}, {"helpful": 0, "title": "Not for us", "body": "Unfortunately, both my kids hated the taste of these. They also smell weird and they're all one color--maroon. The DHA/Omega 3 are a big hit, though!", "rating": "1"}, {"helpful": 0, "title": "Waste of money.", "body": "Would not order again from here. These gummies were so unfresh and hard that you could not even chew them up. I've bought from other places and they've never been hard. These were break your teeth hard.", "rating": "1"}, {"helpful": 0, "title": "Kids Love them > Mom Loves them", "body": "I have 3 very picky kids when it comes to vitamins. I have tried a wide variety of brands.  This is the only brand my kids will consistently take and not leave hiding about the house, bummer of the car, on top of the laundry, etc.  Will continue buying.", "rating": "4"}, {"helpful": 1, "title": "Kids love these and the quality of the Vitamin is good", "body": "I have tired to find a vitamin which contains a good amount of vitamins and minerals for my kids. I shop at Whole Foods and they are liberal with their return policy, which is good because I went through about 6 kinds of \"kids\" vitamins, all of which were rejected by my children.  Finally, I brought home the Yummi Bears and the problem was solved. It's not hard to get them to eat 3 vitamins because they are like candy for them. The only problem was the cost...Whole Foods sells them for something north of $20. So, finding that I can buy them on Amazon (and I've got the free shipping option) saves me a bundle.  With 3 kids and 3 vitamins each, we go through a bottle every three weeks! In short, I rate these with 5 stars.", "rating": "5"}, {"helpful": 0, "title": "Expired on 10/13 and ordered in 01/17", "body": "I ordered them in January 2017 and I was feeding these to my kids, just saw the expiry date and it is 10/13. Horrible, I am devastated, I don't know what went into my kids. Shame for sending I expired products.", "rating": "1"}, {"helpful": 0, "title": "Good nutrition for a picky eater.", "body": "My toddler has hit the picky eater stage. I have a hard time feeding him veggies, so I've started giving him these gummy bear supplements. He loves them, and I am satisfied knowing he's at least getting some veggies in his belly... he just doesn't know it:)", "rating": "5"}, {"helpful": 1, "title": "Melted", "body": "This has never happened before but today the vitamins came all melted. Eww.", "rating": "1"}, {"helpful": 0, "title": "Fiber gummies", "body": "These help my child get some extra fiber.  They are less sugary than comparable brands on the market.", "rating": "5"}, {"helpful": 0, "title": "Kids love these", "body": "I have bought these several times.  I like that I can add a least a little bit of veggie/fruit serving to my kids diet in a gummy bear!  Just don't buy these here during the summer months, they come as one big blob.  I had no trouble getting a refund, but it was frustrating.", "rating": "5"}, {"helpful": 1, "title": "kids love them.", "body": "kids love to take these. good quality", "rating": "5"}, {"helpful": 7, "title": "Pricey, But the Benefits are Worth the Cost for Toddlers", "body": "~BACKGROUND~", "rating": "5"}, {"helpful": 0, "title": "They are yummy!", "body": "These vitamins are the only ones that my kids will eat that don't have a ton of added sugar. I love getting them sent to us regularly through Amazon as well. Makes remembering to replenish them, so simple.", "rating": "5"}, {"helpful": 0, "title": "My kids love these. They taste great", "body": "My kids love these.  They taste great, not too sweet or chew.  I've tried other brands that my kids thought tasted artificial and I thought were too sweet.", "rating": "5"}, {"helpful": 0, "title": "Great product", "body": "Love these, I ordered the organic version but my son didn't like them because they have a sugary coating, I really feel these help him not get sick as much, being in preschool as a toddler is tough", "rating": "5"}, {"helpful": 0, "title": "and I like that they are made from whole foods", "body": "My son loves these, and I like that they are made from whole foods.", "rating": "5"}, {"helpful": 1, "title": "Not an Organic product", "body": "I called the manufacturer and in addition to Fruit and Veg concentrates it also has various other chemicals/products such as Gelatin (made from Pork skin). They also confirmed that Amazon description is incorrect. Only the Fruit concentrates are organic. Everything else including all veg are NOT organic.", "rating": "2"}, {"helpful": 0, "title": "Great product", "body": "Love these, I ordered the organic version but my son didn't like them because they have a sugary coating, I really feel these help him not get sick as much, being in preschool as a toddler is tough", "rating": "5"}, {"helpful": 0, "title": "Kids approved!", "body": "Kids approved. Great for my picky eaters. I fell relief that their are getting some fruits and vegetables nutrients. It doesn't stick together.", "rating": "5"}, {"helpful": 0, "title": "Kids Love them > Mom Loves them", "body": "I have 3 very picky kids when it comes to vitamins. I have tried a wide variety of brands.  This is the only brand my kids will consistently take and not leave hiding about the house, bummer of the car, on top of the laundry, etc.  Will continue buying.", "rating": "4"}, {"helpful": 0, "title": "Tasty, and higher quantities of essential vitamins", "body": "My very picky 3 year old loves these!  I chose them because of their more complete nutrients over other similar brands, as well as the dye and preservative free qualities.  I love that there is almost 4 times more zinc in these than other brands.  No complaints here, and we'll continue to buy this brand for a long time. It's worth the few extra dollars....", "rating": "5"}, {"helpful": 0, "title": "They are yummy!", "body": "These vitamins are the only ones that my kids will eat that don't have a ton of added sugar. I love getting them sent to us regularly through Amazon as well. Makes remembering to replenish them, so simple.", "rating": "5"}, {"helpful": 0, "title": "... only DHA supplements that my 2 year old has liked. They don't have a fishy odor or weird ...", "body": "These are the only DHA supplements that my 2 year old has liked. They don't have a fishy odor or weird sugar coating on them like the others we have tried. Small in size and seem easy to chew.", "rating": "5"}, {"helpful": 0, "title": "Taste Great!!  Yummmm", "body": "I have these on autoship!  Great way for my kids to get the veggies they wont eat.  Taste great - they think they are real gummies", "rating": "5"}, {"helpful": 0, "title": "Recomendadas", "body": "Muy buen sabor y gran cantidad de vitaminas para mi hija se las come sin problemas hasta le ayuda en el apetito solo le doy una al día y mas que suficiente las probé y el sabor es mejor que las chucherías que le compro nunca hay problemas para que las coma totalmente recomendadas", "rating": "5"}, {"helpful": 0, "title": "They are great tasting so he doesn't fight taking them", "body": "My son has been taking these for a few years.  They are great tasting so he doesn't fight taking them.  They are like a treat.  Work well too.  Rarely gets sick.", "rating": "5"}, {"helpful": 0, "title": "Safe vitamins to allergic kids", "body": "This is a really good option for those child that have so many allergies, like gluten, egg or lactose. This vitamins are an A+ to me and my kid.", "rating": "5"}, {"helpful": 0, "title": "tastes like", "body": "My son has been taking these for years and loves them, tastes like candy", "rating": "5"}, {"helpful": 0, "title": "3 year old enjoys", "body": "My son has a few bowel movements daily and this probably contributes to his regularity.", "rating": "5"}, {"helpful": 1, "title": "YUCK.", "body": "TASTES HORRIBLE.  KIDS WON'T EAT AND NEITHER WILL I.", "rating": "1"}, {"helpful": 0, "title": "No artificial coloring. Yes!!", "body": "Excellent. the kids loved it. Will buy again.", "rating": "5"}, {"helpful": 0, "title": "very good!", "body": "I've had problems with my 3 year old son refusing to take vitamins no matter what flavour they were. A friend recommended to try this brand and it works! Although I did not tell my son they are actually vitamins. I just play a game with him that three bears are running to his mouth to count his teeth (daily dose is 3). He even asks for more! Will definetely continue buying them.", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "My granddaughter loves them", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Great gluten free option for vitamins. All of my kids love them.", "rating": "5"}, {"helpful": 0, "title": "Kids love them!", "body": "My 7 and my 2 can't wait for their \"gummy bear\" vitamins each morning.", "rating": "5"}, {"helpful": 0, "title": "great product. Recommended for both childrens and adults.", "body": "Grat product. No by products. Lve the fiber gummies. Most adult fiber gummies are to harsh on my system, but 2 childrens fiber gummies keeps me regular, without consequences.", "rating": "5"}, {"helpful": 0, "title": "These are the only vitamin c that I buy my ...", "body": "These are the only vitamin c that I buy my son. He loves how they taste and they are all natural", "rating": "5"}, {"helpful": 0, "title": "Good kid multivitamin", "body": "My son has trouble with vitamins and so do I.  I find these digest well, keep him healthy and he enjoys taking them.  They are not chalky, but pleasant to chew and my son loves them.  Very pleased with the product.", "rating": "5"}, {"helpful": 0, "title": "Good for What's Inside", "body": "We've been using these vitamins for the last two years.  They contain the vitamins you want, without many of the filler items you don't.  We don't do a lot of sugar in our house and so these vitamins are considered a special \"vitamin treat\" for our girls.", "rating": "4"}, {"helpful": 0, "title": "So glad I found these", "body": "So glad I found these! I have a VERY picky toddler and a regular multi vitamin just isn't enough for her, she needs the additional minerals as well. She takes them with no fuss so they must taste pretty good.", "rating": "5"}, {"helpful": 0, "title": "use these all the time, helps my kiddos who ...", "body": "use these all the time, helps my kiddos who tend to be on the constipated side, be a bit more regular.", "rating": "5"}, {"helpful": 0, "title": "Taste Great!!  Yummmm", "body": "I have these on autoship!  Great way for my kids to get the veggies they wont eat.  Taste great - they think they are real gummies", "rating": "5"}, {"helpful": 0, "title": "Double thumbs up from my son", "body": "My son says he likes this one the best of all the vitamins he's tried over the years. And there's been many. When I've asked him why, this is his quote: \"It's the one that tastes most like candy.\"", "rating": "5"}, {"helpful": 0, "title": "Great vitamins to add a little DHA", "body": "My 2.5 year old loves these. When I ordered them I thought they were regular multivitamins with DHA added but they are DHA and Omega only. Just make sure you read the description. ;)", "rating": "5"}, {"helpful": 0, "title": "My toddler love the taste of it", "body": "My 2.5 years old daughter looking forward to have these every morning before school. It is like a treat to her but the same time helps to boost her immune system.", "rating": "5"}, {"helpful": 1, "title": "Great product, trouble shipping", "body": "I love these, they taste great, and have lots of good stuff in them.  However, if you are ordering in hot weather there is a likelyhood that they will arrive melted into a big lump.  So use caution when ordering.", "rating": "3"}, {"helpful": 0, "title": "My Kids LOVE them", "body": "Love these my kids take them every day. They love taking them", "rating": "5"}, {"helpful": 0, "title": "Good Vitamins", "body": "I decided to try these for my kids because I liked that they do not have artificial colors or flavors. I don't like all the artificial stuff and chemicals they put in everything these days. My kids liked the taste of them. I like that they don't have a fishy taste to them. These have all natural ingredients, which I really liked about them as well. Really the only thing I didn't like about these was the high price and that a serving size is 3 gummies per day. But, overall these were good omega 3, DHA vitamins.", "rating": "4"}, {"helpful": 0, "title": "My son loves these (he's 5) and I started to ...", "body": "My son loves these (he's 5) and I started to notice an improvement in his temperament. I give three to him each morning as part of our morning routine.", "rating": "5"}, {"helpful": 0, "title": "great vitamins", "body": "My 3 yr old and 5 yr old take these every morning. They love them and I like them because they are \"wholefood\" and recommended by the people at Whole Foods.", "rating": "5"}, {"helpful": 0, "title": "Love These", "body": "I love these vitamins for my little one. He has been taking them since the age of 3 along with a multi vitamin. I've noticed a decrease in colds since taking the vitamin regimen.", "rating": "5"}, {"helpful": 1, "title": "good vitamins", "body": "My daughter uses a number of the Yummi Bears vitamins and we love them all. Would like to see an organic version of the Vit C.", "rating": "4"}, {"helpful": 1, "title": "My kids love the taste!", "body": "One of my kids is very picky about the taste of vitamins, but both kids really like these!  Also, even with many food allergies, my son can safely eat them.", "rating": "5"}, {"helpful": 0, "title": "Great vitamins!", "body": "My kids love them and remember to take them daily all on their own!", "rating": "5"}, {"helpful": 0, "title": "These are the best!", "body": "I was looking for a vitamin that my daughter would love and that are healthy.  Yummi Bears Multi-Vitamin and Mineral are delicious and nutritious.  They are also a great value.", "rating": "5"}, {"helpful": 0, "title": "Great vitamins!", "body": "These are my daughter's favorite gummy vitamins. She asks for them every morning. I like that they are wholefood vitamins.", "rating": "5"}, {"helpful": 0, "title": "delicious and effective. please don't eat the whole jar", "body": "getting my 2 year old to take fiber has never been easier. poor little thing, wish she didn't 'need it. but HEY! Gummy Bears!!", "rating": "5"}, {"helpful": 0, "title": "Great way to sneak in fruits and veggies!", "body": "My picky daughter loves these, she always asks for more! These are not a complete multivitamin but can be taken with any other vitamin as a way to get way to get fruits and veggies in. I would rate this 5 stars but I really wish that it did not contain vitamin A because my daughters multivitamin has 100% of her Vitamin A so with this she is overdosing.", "rating": "4"}, {"helpful": 0, "title": "great product. Recommended for both childrens and adults.", "body": "Grat product. No by products. Lve the fiber gummies. Most adult fiber gummies are to harsh on my system, but 2 childrens fiber gummies keeps me regular, without consequences.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product - works as advertised!", "rating": "5"}, {"helpful": 0, "title": "great taste and allergy free", "body": "my children are allergic to nuts and these are the only vitamins I can get them to take happily", "rating": "5"}, {"helpful": 0, "title": "My toddler love the taste of it", "body": "My 2.5 years old daughter looking forward to have these every morning before school. It is like a treat to her but the same time helps to boost her immune system.", "rating": "5"}, {"helpful": 0, "title": "My son loves these (he's 5) and I started to ...", "body": "My son loves these (he's 5) and I started to notice an improvement in his temperament. I give three to him each morning as part of our morning routine.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I'm an adult. I take these :)", "rating": "5"}, {"helpful": 0, "title": "Hello", "body": "They're vitamins", "rating": "5"}, {"helpful": 0, "title": "and I like that they are made from whole foods", "body": "My son loves these, and I like that they are made from whole foods.", "rating": "5"}, {"helpful": 0, "title": "The best", "body": "As always, Yummi bears always delivers. Other vitamin gummies in the market are not as soft and taste as good as Yummi bears.", "rating": "5"}, {"helpful": 0, "title": "Taste good", "body": "My son loves the taste of these. He keeps asking for more, so I'm glad that the serving size is 3. I also use the fiber gummies, and DHA gummies of the same brand.", "rating": "5"}, {"helpful": 0, "title": "tastes like", "body": "My son has been taking these for years and loves them, tastes like candy", "rating": "5"}, {"helpful": 0, "title": "Kids love them!", "body": "My 7 and my 2 can't wait for their \"gummy bear\" vitamins each morning.", "rating": "5"}, {"helpful": 0, "title": "Great flavor", "body": "I have my son take these with a multivitamin and omega gummies.", "rating": "5"}, {"helpful": 0, "title": "Tastes Good", "body": "I have a pecky 8 year old boy. He loves the texture and taste of these. And he loves that the serving size is 4.  So he can eat a lot.", "rating": "5"}, {"helpful": 0, "title": "great taste and allergy free", "body": "my children are allergic to nuts and these are the only vitamins I can get them to take happily", "rating": "5"}, {"helpful": 0, "title": "These bears came all stuck together. Ive tried pulling ...", "body": "These bears came all stuck together.  Ive tried pulling them apart, its just a mess. I bought some from a local store and pitched these!", "rating": "2"}, {"helpful": 0, "title": "Taste good.", "body": "I wanted to make sure my daughter was getting enough vitamin d. She likes them and takes them without a problem.", "rating": "5"}, {"helpful": 0, "title": "My kids beg for them", "body": "My kids love to take their yummi bear vitamins every day.  They BEG to take them!  You have to love when your kids want to take their vitamins!", "rating": "5"}, {"helpful": 1, "title": "Don't order in the summer!", "body": "This was the second shipment that arrived completely melted. When this sits on the UPS truck for 7+ hours, it arrives in an unusable condition. We love these yummi bears usually!", "rating": "1"}, {"helpful": 0, "title": "Dosage is four? I'll just give two...", "body": "My daughter likes to eat these fiber gummies because she thinks it's candy.  Where were gummy vitamins when we were all kids? These gummies are a little bit on the chewy hard side so I have to cut them in half for my two year old.  The recommended dose is four gummies which seems a little much for me so I just her two a day.  I wouldn't say they are miracle drugs but they do seem to help if you can manage to add some other fiber from natural sources.", "rating": "4"}, {"helpful": 0, "title": "Our kids love them", "body": "These vitamins are maybe not the best out there, but our girls eat them and are willing and wanting to take them, so we are thankful for the supplement.  Our girls are 8, 6 and even our 18 month old can even chew them and enjoys them.", "rating": "5"}, {"helpful": 0, "title": "A vitamin that my kids will eat!", "body": "I had to go through a lot of vitamins before I found one my kids would eat that I felt comfortable with being all natural and having the vitamins that they need.", "rating": "5"}, {"helpful": 0, "title": "Fish oil gummies", "body": "My son loves these! He looks forward to taking his fish oil gummies every morning! I love that-makes it so easy to keep him healthy!", "rating": "5"}, {"helpful": 0, "title": "Mulit-vitamin & mineral gummies", "body": "My son loves these! He looks forward to eating these every morning! It's the first thing he asks for..before he even eats breakfast!", "rating": "5"}, {"helpful": 0, "title": "Who knows?", "body": "My wife wanted to give these to our kids. I didn't want to argue. I haven't noticed any change. She hasn't mentioned any change.", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "Great gluten free option for vitamins. All of my kids love them.", "rating": "5"}, {"helpful": 1, "title": "Great supplement for fruits and vegetables", "body": "My kids love the taste of these and they have are a great supplement for kids who don't eat enough fruits and vegetables.  Also, they are gluten free!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product", "rating": "5"}, {"helpful": 0, "title": "Fruits and Veggies", "body": "Great source for picky eaters to get their fruits and vegetables.  I just wish they would state the SOURCE of the ingredients.", "rating": "4"}, {"helpful": 0, "title": "Good price, fast shipping.", "body": "Our son resists eating vegetables and, while Yummi Bears Wholefood is not a perfect substitute for fresh veggies, this product gives us a little peace of mind.", "rating": "5"}, {"helpful": 0, "title": "My kid loves these!", "body": "Love them, thanks!", "rating": "5"}, {"helpful": 0, "title": "Kids like them. Must take 3 bears to get recommended ...", "body": "Kids like them. Must take 3 bears to get recommended dosage. So if for multiple kids, keep that in mind.", "rating": "4"}, {"helpful": 0, "title": "Good natural tasting gummies", "body": "Good taste and kids loves it!", "rating": "4"}, {"helpful": 0, "title": "Gummi bear Vitamins", "body": "Got this as a supplement for the kids.  They like the taste and I sleep a little better knowing they are getting a better vitamin.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Delicious!", "rating": "5"}, {"helpful": 0, "title": "Great tasting, full of nutrition", "body": "Our kids love these vitamins! And we love they are not loaded with sugar but with veggies and fruits", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Taste great!", "rating": "5"}, {"helpful": 0, "title": "On the fence", "body": "My kids love them, however, the product we received was hard and not chewy. Exp. date on package is 04/2016.", "rating": "2"}, {"helpful": 0, "title": "Love the Vitamins - need new shipping method.", "body": "I was told by our physician to get these vitamins and both my sons love the taste.  Unfortunately since we live in a very warm climate, the gummies become stuck together due to the heat when shipping.  I may begin to buy these local unless they start to ship with a little ice.", "rating": "5"}, {"helpful": 1, "title": "YUCK.", "body": "TASTES HORRIBLE.  KIDS WON'T EAT AND NEITHER WILL I.", "rating": "1"}, {"helpful": 0, "title": "Great vitamins", "body": "These vitamins help us meet/beat daily nutritional requirements plus they really are YUMMY (brand YUMMI). My little one enjoys them!", "rating": "5"}, {"helpful": 0, "title": "I like that they are allergy friendly", "body": "My daughter likes these. I like that they are allergy friendly.  Their calcium and Vit D gummies are great too with good concentrations of both.", "rating": "4"}, {"helpful": 0, "title": "Awesome!", "body": "Awesome!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great value on a product that is hard to find at a decent price in local stores.", "rating": "5"}, {"helpful": 0, "title": "Works like a charm", "body": "We give our son 1 a day, and 2 a day when at my parents house. Works like a charm....pun intended.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "My kids love these.", "rating": "5"}, {"helpful": 0, "title": "Recommend highly!", "body": "My kids love these and they are allergen and gluten free!", "rating": "5"}, {"helpful": 0, "title": "Good kid multivitamin", "body": "My son has trouble with vitamins and so do I.  I find these digest well, keep him healthy and he enjoys taking them.  They are not chalky, but pleasant to chew and my son loves them.  Very pleased with the product.", "rating": "5"}, {"helpful": 0, "title": "Double thumbs up from my son", "body": "My son says he likes this one the best of all the vitamins he's tried over the years. And there's been many. When I've asked him why, this is his quote: \"It's the one that tastes most like candy.\"", "rating": "5"}, {"helpful": 0, "title": "Awesome!!", "body": "Only vitamin the kids will eat. Awesome!!", "rating": "5"}, {"helpful": 0, "title": "Tastes Good", "body": "I have a pecky 8 year old boy. He loves the texture and taste of these. And he loves that the serving size is 4.  So he can eat a lot.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Just what I was looking for", "rating": "5"}, {"helpful": 0, "title": "Vitamins were old and brown. You can tell it ...", "body": "Vitamins were old and brown.  You can tell it was left on a shelf for a long time. Products in that condition should be thrown out not given to children.", "rating": "1"}, {"helpful": 0, "title": "Five Stars", "body": "Everything ok...", "rating": "5"}, {"helpful": 0, "title": "Who knows?", "body": "My wife wanted to give these to our kids. I didn't want to argue. I haven't noticed any change. She hasn't mentioned any change.", "rating": "3"}, {"helpful": 0, "title": "Four Stars", "body": "One of the shipments (granted, in May...kinda warm outside) came as a huge piece of mushed gummy bear.", "rating": "4"}, {"helpful": 0, "title": "Kids enjoy the taste", "body": "My 4 year old eats them with no problems. No fishy taste.", "rating": "5"}, {"helpful": 0, "title": "Fruits and Veggies", "body": "Great source for picky eaters to get their fruits and vegetables.  I just wish they would state the SOURCE of the ingredients.", "rating": "4"}, {"helpful": 0, "title": "These bears came all stuck together. Ive tried pulling ...", "body": "These bears came all stuck together.  Ive tried pulling them apart, its just a mess. I bought some from a local store and pitched these!", "rating": "2"}, {"helpful": 0, "title": "Four Stars", "body": "Working well to help our toddler with constipation issues.", "rating": "4"}, {"helpful": 0, "title": "Fish oil gummies", "body": "My son loves these! He looks forward to taking his fish oil gummies every morning! I love that-makes it so easy to keep him healthy!", "rating": "5"}, {"helpful": 0, "title": "Mulit-vitamin & mineral gummies", "body": "My son loves these! He looks forward to eating these every morning! It's the first thing he asks for..before he even eats breakfast!", "rating": "5"}, {"helpful": 0, "title": "These are the best!", "body": "I was looking for a vitamin that my daughter would love and that are healthy.  Yummi Bears Multi-Vitamin and Mineral are delicious and nutritious.  They are also a great value.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "These may not be perfect but they are way better than the ones you buy in a store.", "rating": "5"}, {"helpful": 0, "title": "Great flavor", "body": "I have my son take these with a multivitamin and omega gummies.", "rating": "5"}, {"helpful": 0, "title": "Gummi bear Vitamins", "body": "Got this as a supplement for the kids.  They like the taste and I sleep a little better knowing they are getting a better vitamin.", "rating": "5"}, {"helpful": 0, "title": "My kids beg for them", "body": "My kids love to take their yummi bear vitamins every day.  They BEG to take them!  You have to love when your kids want to take their vitamins!", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "My granddaughter loves them", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Yummy", "rating": "5"}, {"helpful": 0, "title": "Kids love them", "body": "Like that they are allergy and gluten free, wish they were organic.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Kids love it. Wish I could get with subscribe and save", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great price. Quick shipping on", "rating": "5"}, {"helpful": 0, "title": "Sticky gummy bears", "body": "Taste good, but very sticky and hard to separate them.", "rating": "3"}, {"helpful": 1, "title": "Great Vitamin Value", "body": "Great price for the same vitamins Whole Food Supplies. I am glad I found these it keeps the germs at bay.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "All the kids in my house love this, even the neighbor kids.", "rating": "5"}, {"helpful": 0, "title": "These gummies are yummy", "body": "These are great! My kids love them and they taste yummy even to me! I ordered them again. Highly recommend.", "rating": "5"}, {"helpful": 0, "title": "Delicious, hard to stick to the recommended dose. I want to have more.", "body": "Delicious, hard to stick to the recommended dose. I want to have more.", "rating": "5"}, {"helpful": 0, "title": "Good vitamin for kids", "body": "its a vitamin and tastes good for kids - nothing really else to say - I just have the kids try them every now and then.", "rating": "4"}, {"helpful": 0, "title": "Best there is for kids!,,", "body": "It is a great whole food supplement for kids who don't eat enough vegetables.  It is clean and health and they love them.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "These may not be perfect but they are way better than the ones you buy in a store.", "rating": "5"}, {"helpful": 0, "title": "Would recommend", "body": "Daughter (and I) both like the taste.  Not too sticky so hopefully not as bad for teeth as other gummies.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Smells funny but it taste just like gummy bears.", "rating": "4"}, {"helpful": 0, "title": "Kid never liked it.", "body": "Title says it all, the kid never like them and frankly neither did I (Yes I tried one).  Not terrible, just not good in our opinions.", "rating": "2"}, {"helpful": 0, "title": "Five Stars", "body": "Great product - works as advertised!", "rating": "5"}, {"helpful": 0, "title": "Great price", "body": "My kids eat this every day.  My husband eats them too. But they are very expensive at the supermarket.  This is a good way to buy them, cheaper and easy to remember. Can I get them on subcribe and save?", "rating": "5"}, {"helpful": 0, "title": "Helps increase apitite", "body": "My Son (5 yrs) is very picky when it comes to feed him.I bought this vitamins thinking it will supplment his diet.I am very happy that he loved the taste and always nag for more.The best part is, he started eating more now.I am very happy with this product and its going to be part of our life for very long time.", "rating": "5"}, {"helpful": 0, "title": "Great vitamins!", "body": "Kids love them!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Love it!", "rating": "5"}, {"helpful": 0, "title": "All the bottles of the gummi bears received were melted ...", "body": "All the bottles of the gummi bears received were melted and all stuck together I have had to just trash  all the bottles as there is no way a child can  use these.", "rating": "1"}, {"helpful": 0, "title": "great vitamins", "body": "We love these vitamins....they don't have any junk in them, they taste good, and they are gluten-free, something we needed!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Love it!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I'm an adult. I take these :)", "rating": "5"}, {"helpful": 0, "title": "great stuff", "body": "Kids love them and they taste good.", "rating": "5"}, {"helpful": 0, "title": "My son loves them.", "body": "My son loves them.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "don't buy from anywhere else. my little ones think they are eating candy.. but it's not!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "best vitamins for kids with multiple allergies!", "rating": "5"}, {"helpful": 0, "title": "Vitamin D chewables", "body": "They tast pretty good.  The Mrs wanted the kids to get more vitamin D and this seems to fit the bill.", "rating": "5"}, {"helpful": 0, "title": "Great for constipation", "body": "My kid rarely eats enough veggies so he eats two of these a day along with some Miralax and no more potty issues!", "rating": "5"}, {"helpful": 0, "title": "Great product", "body": "Kids love these!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "My son loves to take his vitamins now.", "rating": "5"}, {"helpful": 1, "title": "my kids looooove this vitamin!", "body": "My children (ages 4 and 9) wake up asking to take their vitamin! The product is natural, and has a good array of vitamins and minerals. I highly recommend this to every parent.", "rating": "5"}, {"helpful": 0, "title": "Melted together!!", "body": "When I received them the yummi Bears were melted together and I couldn't get them apart so I had to throw half of bottle away!!!", "rating": "1"}, {"helpful": 0, "title": "Kids enjoy the taste", "body": "My 4 year old eats them with no problems. No fishy taste.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Working well to help our toddler with constipation issues.", "rating": "4"}, {"helpful": 0, "title": "Vitamins", "body": "Very good vitamins for the kids and they taste good as well.  The only problem is, as with the yummi bear brand is it is a daily serving size of three gummies.  I wish they would make their vitamins sstronger!!!", "rating": "5"}, {"helpful": 0, "title": "One Star", "body": "All gummies came melted.  Had to return.  Needs to be sent on dry ice in summer months.", "rating": "1"}, {"helpful": 0, "title": "so my kids do not like them. they prefer those kind of hard gummies ...", "body": "it is so sticky and rubbery, so my kids do not like them. they prefer those kind of hard gummies covering with sugar.", "rating": "2"}, {"helpful": 0, "title": "Good vitamin for kids", "body": "its a vitamin and tastes good for kids - nothing really else to say - I just have the kids try them every now and then.", "rating": "4"}, {"helpful": 0, "title": "GREAT FOR KIDS", "body": "4 YR OLD LOVES EM! TASTES GOOD AND PROVIDES GREAT NUTRITION", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Fine", "rating": "5"}, {"helpful": 0, "title": "Great gummy vitamin", "body": "Tthese are a great multi-vitamin and fun for the kiddos to eat.  They have a great taste and are nice and soft, so my 17 month old can also enjoy them.", "rating": "4"}, {"helpful": 0, "title": "Best there is for kids!,,", "body": "It is a great whole food supplement for kids who don't eat enough vegetables.  It is clean and health and they love them.", "rating": "5"}, {"helpful": 0, "title": "Cant go anywhere without these", "body": "I get these for my toddler and they work miracles! I alternate from these to regular vitamins to help her immune system and it works!!! this is a must buy!", "rating": "5"}, {"helpful": 1, "title": "Don't order in the summer!", "body": "This was the second shipment that arrived completely melted. When this sits on the UPS truck for 7+ hours, it arrives in an unusable condition. We love these yummi bears usually!", "rating": "1"}, {"helpful": 0, "title": "Five Stars", "body": "great and tasty supplement for kids!", "rating": "5"}, {"helpful": 2, "title": "love this product", "body": "I purchased this for my three year old that has problems with digestion. Since giving this to her, she has been regular and because they are Gummies I don't have to fight to get it down her! I would recommend this to all parents that are concerned that their child needs more fiber.", "rating": "5"}, {"helpful": 0, "title": "pretty beat up", "body": "Vitamins came late, pretty beat up, and the safety seal was broken.", "rating": "1"}, {"helpful": 0, "title": "Five Stars", "body": "Great product and price!", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Kids love them ... if they were organic I would give them 5 stars !", "rating": "4"}, {"helpful": 0, "title": "Great price. My local health food store charges $6 ...", "body": "Great price.  My local health food store charges $6 more for this bottle.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "GOOD FLAVORS", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I LOVE THIS", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good fresh item, cheaper than the stores", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "son doesn't like them anymore", "rating": "3"}, {"helpful": 0, "title": "Great for constipation", "body": "My kid rarely eats enough veggies so he eats two of these a day along with some Miralax and no more potty issues!", "rating": "5"}, {"helpful": 0, "title": "Great!", "body": "My 6 yrs old loves them.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Yummy", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good deal; kids like them", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "They are great for my kid. My son has problems focusing and this seems to be helping him.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Very Satisfied.  Excellent.  Very fast shipping.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent product, fast shipping.", "rating": "5"}, {"helpful": 7, "title": "hardly any fiber-check the label", "body": "These are little more than candy.  Lots of sugar and only 300mg fiber (less than a third of a gram?!) for each gummy.  Do the math.  Four gummies gives little more than 1 gram of fiber total.  Changing the units to milligrams makes it seem like there's more which is very deceptive.  They get 2 stars because they do taste good.  Just like candy.", "rating": "2"}, {"helpful": 0, "title": "Vitamins", "body": "I am certain these along with the Fruit and vegetable vitamins are why my kids stay healthy!  We love them!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Perfect. Thank you.", "rating": "5"}, {"helpful": 0, "title": "Kid never liked it.", "body": "Title says it all, the kid never like them and frankly neither did I (Yes I tried one).  Not terrible, just not good in our opinions.", "rating": "2"}, {"helpful": 0, "title": "great vitamins", "body": "We love these vitamins....they don't have any junk in them, they taste good, and they are gluten-free, something we needed!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "My three kids LOVE these. I love that they're safe for our food-allergic kids.", "rating": "5"}, {"helpful": 1, "title": "vitamin c", "body": "My child love it so continue doing business with you and keep up the good work. Have a nice day", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "My kids love these!", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "My son likes them", "rating": "4"}, {"helpful": 0, "title": "Yummi Bears Multi- Vit", "body": "I love buying hero nutritional yummi bears vitamins for my son as I know I am getting quality products. The multi vitamin is delicious and my son loves it!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "They are yummy", "rating": "5"}, {"helpful": 0, "title": "Excellent seller", "body": "These are great for kids who need a bit of help with #2.  They taste great & this is a great price too. Thx", "rating": "5"}, {"helpful": 0, "title": "Great supplement", "body": "My kids love these", "rating": "5"}, {"helpful": 1, "title": "Kids enjoyed", "body": "Some vitamin C tummies are too sour for the kids and it is a struggle everyday to get them to take their vitamin. These were pleasant enough to not cause any arguments.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Very good product!!!", "rating": "5"}, {"helpful": 0, "title": "Hero vitamin for my little heroes", "body": "Loving the multivitamins. They were purchased for my children but I can't resist them because they are so tasty. I also have to hide the bottle from my son he go crazy for them.", "rating": "5"}, {"helpful": 0, "title": "Yum", "body": "Good vitamins with minerals in gummy form. Its hard to find gummy vitamins with minerals in them so SCORE! Taste good and reasonably priced.", "rating": "4"}, {"helpful": 1, "title": "Great product to replace PediaLax FIber Gummies", "body": "Yummi Bears are a great product, especially if you are trying to find a replacement for the PediaLax Fiber Gummies that have been off the market for a while now due to recall/manufacturing issues.", "rating": "5"}, {"helpful": 0, "title": "I like these gummies and they taste good", "body": "I like these gummies and they taste good, my daughter loves them and they seem to work because when I stop giving them to her she has trouble doing number 2", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "They do there job.", "rating": "3"}, {"helpful": 0, "title": "NICE", "body": "GOOD PRICE", "rating": "5"}, {"helpful": 0, "title": "kids love it", "body": "Kid just love it as much as the candy but understand that those are vitamins. Really a clever useful product", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Kids love them ... if they were organic I would give them 5 stars !", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "great", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "My three kids LOVE these. I love that they're safe for our food-allergic kids.", "rating": "5"}, {"helpful": 0, "title": "Great!", "body": "One of the only vitamins my picky 3yr old will take! We also love their fiber gummies too, they work great!", "rating": "5"}, {"helpful": 0, "title": "Item as described and shipped quickly. Happy with item and seller.", "body": "Item as described and shipped quickly. Happy with item and seller.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product.", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "Not enough fiber", "rating": "3"}, {"helpful": 0, "title": "where's the fiber?", "body": "They taste good but have very little fiber.", "rating": "1"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "nice", "body": "I love the fiber bears my kids take them on a regular basis I have to buy more already ok", "rating": "5"}, {"helpful": 0, "title": "Fruit and vegetables(gluten free!)", "body": "This vitamin is a great way to get extra fruits and vegetables into your kids.  Plus it is gluten free!", "rating": "5"}, {"helpful": 0, "title": "great stuff", "body": "Kids love them and they taste good.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "thank you", "rating": "5"}, {"helpful": 0, "title": "Yummy gummies😀", "body": "My picky three year old will scarf these down😀", "rating": "5"}, {"helpful": 0, "title": "Great Buy", "body": "I love this product and the pricing was affordable so I was very pleased with my purchase. My son loves these gummy bears!", "rating": "5"}, {"helpful": 0, "title": "Great multi - vitamin for children", "body": "My children love them! Very tasty.", "rating": "5"}, {"helpful": 0, "title": "Vitamins.  Yummy.", "body": "What can you say about vitamins...hmm.  They are apparently good for your child's body and they taste good enough for her to ask for them.  Sold.", "rating": "5"}, {"helpful": 0, "title": "We like these gummy yummi bears", "body": "This product has great gummy texture and a yummy taste. It is a challenge to eat only three a day!", "rating": "4"}, {"helpful": 0, "title": "my kids love them", "body": "Always order , my kids love them", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Son loves these", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Kids love them. So does hubby.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Love these vitamins!", "rating": "5"}, {"helpful": 0, "title": "Love this!", "body": "Very satisfied with this product and the price was right!! My son loves these gummies and they are delicious tasting!!", "rating": "5"}, {"helpful": 0, "title": "Thanks good!! my baby like", "body": "Thanks good !!my baby  like it", "rating": "5"}, {"helpful": 0, "title": "Great alternative.", "body": "Husband loves them because he can't swallow pills. Great alternative.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "As promised on time", "rating": "5"}, {"helpful": 0, "title": "Great Product with real results.", "body": "Great product. My very picky son loves these and it helps his digestive issues from his Autism. Big difference from before we had these.", "rating": "5"}, {"helpful": 0, "title": "Yummy as it says...", "body": "My son, 7 loves to eat these since he is 4 years old, and 3 for serving size doesn't disappoint him...", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "The kids like them", "rating": "4"}, {"helpful": 0, "title": "Good product but overpriced", "body": "My daughter likes these vitamins but I find that they are much higher than other D3 gummy vitamins. I have gone back to purchasing the lower-priced vitamins as I purchased these by mistake.", "rating": "4"}, {"helpful": 0, "title": "Kids love them!!!!", "body": "I have been providing these to my children since they were old enough to chew gummy bears.  They love the taste and I love that they are receiving additional vitamins and fiber in their diet.", "rating": "5"}, {"helpful": 0, "title": "We like these gummy yummi bears", "body": "This product has great gummy texture and a yummy taste. It is a challenge to eat only three a day!", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "Kids like them", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "This is an excellent vitamin brand. Only reason for the 4 stars is the cost!!", "rating": "4"}, {"helpful": 1, "title": "Great Product", "body": "My kids LOVE these! It's a great way to get your kids to eat a serving of vegetables/fruits every day!", "rating": "5"}, {"helpful": 0, "title": "Pretty sure it happened during delivery", "body": "Have ordered this product before with no problems. This time, however, I received a bottle of liquid. Pretty sure it happened during delivery.", "rating": "5"}, {"helpful": 0, "title": "My two-year-old loves these, and I feel good that they are healthy", "body": "My two year old loves these.  I guess he may like them a little too much, since he always asks for more \"gummy bears\", but its not always easy to get him to take vitamins or medicine, so I am just happy that he will readily take them.  I'm very happy they don't have any artificial colors, which tend to make my son very hyper.  I feel good about giving them to him!", "rating": "5"}, {"helpful": 0, "title": "yet taste great.", "body": "My daughter loves these yummi bears.  They give her the vitamins and minerals she needs,", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Love it!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Love it!", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "This is an excellent vitamin brand. Only reason for the 4 stars is the cost!!", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent product, fast shipping.", "rating": "5"}, {"helpful": 0, "title": "Great alternative.", "body": "Husband loves them because he can't swallow pills. Great alternative.", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "son doesn't like them anymore", "rating": "3"}, {"helpful": 1, "title": "Great Product", "body": "My kids LOVE these! It's a great way to get your kids to eat a serving of vegetables/fruits every day!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "perfect and delicious items , my kids love it and I will order more again  ...", "rating": "5"}, {"helpful": 1, "title": "my kids looooove this vitamin!", "body": "My children (ages 4 and 9) wake up asking to take their vitamin! The product is natural, and has a good array of vitamins and minerals. I highly recommend this to every parent.", "rating": "5"}, {"helpful": 0, "title": "Great Buy", "body": "I love this product and the pricing was affordable so I was very pleased with my purchase. My son loves these gummy bears!", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "My kids love it so much.", "rating": "4"}, {"helpful": 9, "title": "YUMMIES!", "body": "We love these vitamins and they leave no aftertaste...it's like your eating a gummy bear!  Plus I don't have to worry about unhealthy byproducts in them.", "rating": "5"}, {"helpful": 0, "title": "Yum", "body": "Good vitamins with minerals in gummy form. Its hard to find gummy vitamins with minerals in them so SCORE! Taste good and reasonably priced.", "rating": "4"}, {"helpful": 0, "title": "Vitamin D helps the immune system.", "body": "Everyone needs more Vitamin D.  Easy to chew and kid friendly.", "rating": "5"}, {"helpful": 0, "title": "Love this!", "body": "Very satisfied with this product and the price was right!! My son loves these gummies and they are delicious tasting!!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "These are a favorite of my kids!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Son loves these", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Son loves these", "rating": "5"}, {"helpful": 0, "title": "yet taste great.", "body": "My daughter loves these yummi bears.  They give her the vitamins and minerals she needs,", "rating": "5"}, {"helpful": 0, "title": "All the bottles of the gummi bears received were melted ...", "body": "All the bottles of the gummi bears received were melted and all stuck together I have had to just trash  all the bottles as there is no way a child can  use these.", "rating": "1"}, {"helpful": 0, "title": "Great product", "body": "My daughter loves the taste of these and they are not filled with unnecessary fillers. Alittle pricey but reasonable! We also use the Vit D by the same brand.", "rating": "5"}, {"helpful": 0, "title": "Love these, but they may melt if you don't get the package indoors quickly in hot weather.", "body": "These are great as usual. When getting summer deliveries, however, if you live in a hot climate, you had better be home or you may find them melted together in a lump.  Amazon will often replace melted items, but better to have them not melt in the first place.  I've been home every time they were delivered this summer, and as I picked them up directly after they were dropped off on my porch, I had no melting or stickiness problems this year.", "rating": "5"}, {"helpful": 0, "title": "Great", "body": "If your lil one is suffering constipation or irregular bowls this is for you. It helps your kid poop on a regular basis.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "children love it", "rating": "5"}, {"helpful": 0, "title": "Great price", "body": "My kids eat this every day.  My husband eats them too. But they are very expensive at the supermarket.  This is a good way to buy them, cheaper and easy to remember. Can I get them on subcribe and save?", "rating": "5"}, {"helpful": 0, "title": "Very good", "body": "Very good and meet my expectation.", "rating": "5"}, {"helpful": 0, "title": "Great supplement", "body": "My kids love these", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "My son likes them", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Yummy", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I give this to my son first thing in the morning. He loves them.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "They are yummy", "rating": "5"}, {"helpful": 0, "title": "One Star", "body": "Not as described", "rating": "1"}, {"helpful": 0, "title": "Vitamin D helps the immune system.", "body": "Everyone needs more Vitamin D.  Easy to chew and kid friendly.", "rating": "5"}, {"helpful": 0, "title": "... is a very picky eater so this is a wonderful way to get his vegies in", "body": "My Grandson is a very picky eater so this is a wonderful way to get his vegies in. He loves them.", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "Not enough fiber", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "Thankful", "rating": "5"}, {"helpful": 7, "title": "Pricey, But the Benefits are Worth the Cost for Toddlers", "body": "~BACKGROUND~", "rating": "5"}, {"helpful": 0, "title": "No complaints, high praise", "body": "The product arrived in great time and is high quality. I have no complaints.", "rating": "5"}, {"helpful": 0, "title": "Love the Vitamins - need new shipping method.", "body": "I was told by our physician to get these vitamins and both my sons love the taste.  Unfortunately since we live in a very warm climate, the gummies become stuck together due to the heat when shipping.  I may begin to buy these local unless they start to ship with a little ice.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "These are exactly what was advertised at a great price.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Taste so good and not that sweet", "rating": "5"}, {"helpful": 0, "title": "Delicious!", "body": "Gelatin based with fruit juice, cane sugar, glucose and citric acid are the basic ingredients. If you want something without artificial colors and artificial sugars these are great. A delicious way to remember to take your vitamins! The bottle has a cornucopia of fruits pictured. There are really only 4 flavors though that I can tell. Red- strawberry/grape. Yellow- lemon. Dark yellow-pinepapple. and Orange. Daily serving for kids is 3. So adults can take 6...which I do :)", "rating": "5"}, {"helpful": 0, "title": "Pretty sure it happened during delivery", "body": "Have ordered this product before with no problems. This time, however, I received a bottle of liquid. Pretty sure it happened during delivery.", "rating": "5"}, {"helpful": 0, "title": "One Star", "body": "These vitamins are so hard I could barely chew them ... How could my toddler????", "rating": "1"}, {"helpful": 0, "title": "Five Stars", "body": "Love all the Yummi Bears for my kids", "rating": "5"}, {"helpful": 0, "title": "Vitamins", "body": "Very good vitamins for the kids and they taste good as well.  The only problem is, as with the yummi bear brand is it is a daily serving size of three gummies.  I wish they would make their vitamins sstronger!!!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "These are the only ones I can get my boy to take. :)", "rating": "5"}, {"helpful": 1, "title": "Great!!!", "body": "My boys love thsese vitamins. Its never a fight to get them to take there vitamins. They are more that willing to take them.", "rating": "5"}, {"helpful": 0, "title": "... is a very picky eater so this is a wonderful way to get his vegies in", "body": "My Grandson is a very picky eater so this is a wonderful way to get his vegies in. He loves them.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Yummi bears are gluten free and don't taste icky.", "rating": "5"}, {"helpful": 6, "title": "Tasty but few vitamins", "body": "I was disappointed. This children's multi-vitamin may be delicious but it only contains the Vitamins A, C & E.  No other vitamins and no minerals.", "rating": "2"}, {"helpful": 2, "title": "good product at great price", "body": "we love these; they don't have that vitamin taste; the price is way better than what I had paid in store", "rating": "5"}, {"helpful": 0, "title": "good product", "body": "kids really liked them. but make sure you keep this in a safe place unreachable to kids to prevent over dosing.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "My boy loves these things. Work well", "rating": "5"}, {"helpful": 0, "title": "Great taste for picky kids", "body": "Great taste and kids love them too.  I use them as well.", "rating": "5"}, {"helpful": 0, "title": "Great taste and kids love them", "body": "Great vitamins.  Kids love them and I use them too.", "rating": "5"}, {"helpful": 0, "title": "My kids LOVE them!", "body": "I've been giving these to my twin 3 yr olds since they were 2 and they love them. They taste great & my kids really look forward to their \"gummy bears\" with breakfast every day. I feel good about giving them a healthy vitamin that doesn't have artificial colors, artificial flavors, or other cr@p in it.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "My son asks for his teddy as a treat.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "kids think it's candy they like so much!", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Love it.", "rating": "5"}, {"helpful": 1, "title": "My Granddaughter", "body": "My Granddaughter was having potty issues and it was very painful. These have been a godsend. They keep her regular. I would recommend this product to anyone who has a child with consipation issues.", "rating": "4"}, {"helpful": 1, "title": "Kids love these and the quality of the Vitamin is good", "body": "I have tired to find a vitamin which contains a good amount of vitamins and minerals for my kids. I shop at Whole Foods and they are liberal with their return policy, which is good because I went through about 6 kinds of \"kids\" vitamins, all of which were rejected by my children.  Finally, I brought home the Yummi Bears and the problem was solved. It's not hard to get them to eat 3 vitamins because they are like candy for them. The only problem was the cost...Whole Foods sells them for something north of $20. So, finding that I can buy them on Amazon (and I've got the free shipping option) saves me a bundle.  With 3 kids and 3 vitamins each, we go through a bottle every three weeks! In short, I rate these with 5 stars.", "rating": "5"}, {"helpful": 0, "title": "Good Vitamins", "body": "I decided to try these for my kids because I liked that they do not have artificial colors or flavors. I don't like all the artificial stuff and chemicals they put in everything these days. My kids liked the taste of them. I like that they don't have a fishy taste to them. These have all natural ingredients, which I really liked about them as well. Really the only thing I didn't like about these was the high price and that a serving size is 3 gummies per day. But, overall these were good omega 3, DHA vitamins.", "rating": "4"}, {"helpful": 1, "title": "vitamins expired in 2010!!!!", "body": "Unbelievable....I am not able to return it cuz it was sent overseas as a gift. So dissapointed. How is possible", "rating": "1"}, {"helpful": 1, "title": "Good Product", "body": "The kids really like it.  Obviously there are no visible effects, but I think it is a good product.", "rating": "4"}, {"helpful": 1, "title": "Good deal", "body": "The kids love them which is a great thing especially when it comes to vitamins! Good pricing too for this product!", "rating": "5"}, {"helpful": 0, "title": "Safety seal broken", "body": "Beside the fact that the safety seal was busted upon arrival, all of the gummies were hot and melted together.  I'll pay the extra $7 and buy it at the vitamin store next time.", "rating": "1"}, {"helpful": 0, "title": "Five Stars", "body": "Helps keep my LO regulated and comes on time monthly", "rating": "5"}, {"helpful": 0, "title": "My 4 year old loves it!", "body": "My daughter loves these vitamins. When we need extra Vitamin C during cold / flue season this is our go to product.", "rating": "5"}, {"helpful": 1, "title": "Product is OK, not sure how effective.", "body": "This prodcuts is priced well and the kids like it.  I just have no idea how effective it is.", "rating": "4"}, {"helpful": 0, "title": "Helps increase apitite", "body": "My Son (5 yrs) is very picky when it comes to feed him.I bought this vitamins thinking it will supplment his diet.I am very happy that he loved the taste and always nag for more.The best part is, he started eating more now.I am very happy with this product and its going to be part of our life for very long time.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "My son loves the taste and I love the quality.", "rating": "5"}, {"helpful": 0, "title": "One Star", "body": "Vitamins came all melted", "rating": "1"}, {"helpful": 1, "title": "Chewy vitamin C.", "body": "Very few vitamins for high price. The other vitamin C product at 150-count was a better product. The vitafusion product was good.", "rating": "2"}, {"helpful": 0, "title": "awesome vitamin chewables", "body": "Our daughter truly loves taking her vitamins in this form. Giving her daily dose of Vitamin D has never been easier.", "rating": "5"}, {"helpful": 0, "title": "Dosage is four? I'll just give two...", "body": "My daughter likes to eat these fiber gummies because she thinks it's candy.  Where were gummy vitamins when we were all kids? These gummies are a little bit on the chewy hard side so I have to cut them in half for my two year old.  The recommended dose is four gummies which seems a little much for me so I just her two a day.  I wouldn't say they are miracle drugs but they do seem to help if you can manage to add some other fiber from natural sources.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "prompt and perfect", "rating": "5"}, {"helpful": 1, "title": "Product is OK, not sure how effective.", "body": "This prodcuts is priced well and the kids like it.  I just have no idea how effective it is.", "rating": "4"}, {"helpful": 0, "title": "Great taste for picky kids", "body": "Great taste and kids love them too.  I use them as well.", "rating": "5"}, {"helpful": 0, "title": "Yummi Bears whole food", "body": "My kids love the whole foods! they are not much on vegtables, but love these! I figure it's better than nothing!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "All is nice", "rating": "5"}, {"helpful": 1, "title": "Painful potty time savers!", "body": "Theses are the only fiber gummies our 2yr old will eat (and we've tried a LOT!). The only problem is she only likes the red ones...it's too bad they don't just make a berry flavor because not all kids like the tropical fruit flavors.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "My boy loves these things. Work well", "rating": "5"}, {"helpful": 0, "title": "Great taste and kids love them", "body": "Great vitamins.  Kids love them and I use them too.", "rating": "5"}, {"helpful": 0, "title": "vitaminas", "body": "excelente producto buena presentación y servicio de primera me encanta deseo hacer en el futuro mas compras con ustedes gracias", "rating": "5"}, {"helpful": 1, "title": "Vitamin and mineral quantity lower than pictured on Amazon", "body": "The item shipped to me was not as pictured on Amazon.  The supplement facts on item I received has lower amounts of each mineral and vitamin.  Disappointed that I will have to give my children more gummies to equal expected mineral and vitamin values.  Not truly 66 servings at this point.", "rating": "2"}, {"helpful": 0, "title": "yummi gummies", "body": "my kids, 3 and 2, love these yummi bears and always ask for more. the vitamin contents are great for my boys too.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Great!", "rating": "4"}, {"helpful": 0, "title": "vitaminas", "body": "excelente producto buena presentación y servicio de primera me encanta deseo hacer en el futuro mas compras con ustedes gracias", "rating": "5"}, {"helpful": 8, "title": "Highly recommended for fidgety kids.", "body": "THis was recommended to me by a specialist for my 7 year old son who has been diagnosed with CAP-D. He is very hyper and fidgety and since using this product we have seen a huge difference in his behaviour. Even his teacher has been very impressed. HIghly recommended.", "rating": "5"}, {"helpful": 0, "title": "kids", "body": "this is a good multivitamin for kids who do not like there veggies ,I know they will eat these and makes me feel good", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "My son loves Yummi Bears!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great price!", "rating": "5"}, {"helpful": 1, "title": "Helped us all beat a few colds", "body": "I bought these Yummi Bears for my kids, but they are really so tasty that the whole family pops a few when we feel a cold coming on.  The last couple of times I just got a few sniffles and that was that.  Highly recommended.  Just make sure you keep the childproof lid on tight, the kids might try to break in to take a few extra since they taste so much like candy.", "rating": "5"}, {"helpful": 1, "title": "Great product! Kids love it !", "body": "Great product ! kids love it!", "rating": "5"}, {"helpful": 0, "title": "I like these better than the candy", "body": "These are really yummy vitamins.  In fact we use them as treats to help encourage my toddler to eat her meals.  One 'serving' is 3 bears, so we give one after every meal... and we don't feel bad if she occasionally has an extra one or two.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Love it.", "rating": "5"}, {"helpful": 0, "title": "One Star", "body": "Vitamins came all melted", "rating": "1"}, {"helpful": 0, "title": "Yummi bears", "body": "Arrived on time as always and my son loves to take his vitamins everyday because they taste so good. Thanks", "rating": "5"}, {"helpful": 0, "title": "Melted together. probly our slow mail service.", "body": "i recieved them late and they were all melted together. my 4 year old hates them but my 2 year old loves them.", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "My kids love these.", "rating": "5"}, {"helpful": 0, "title": "gummie bears fiber for kids", "body": "The amount of fiber in each gummie is not worth the price of the product....I will not buy it anymore", "rating": "1"}, {"helpful": 0, "title": "Five Stars", "body": "Tastes great!", "rating": "5"}, {"helpful": 0, "title": "kids ask for this", "body": "My kids love the orange flavor and can't wait to get their daily dose. I love that it is all natural, no artificial colors or flavors.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excelln source of fiber.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Came on Time", "rating": "5"}, {"helpful": 1, "title": "Not only are they good for my children", "body": "Not only are they good for my children, they have the consistency of gummy bears, whereas others are more like gum drops.  My youngest son has Sensory Processing Disorder and can't deal with certain textures.  We went through 4 different vitamins (gummies) until we found this one.  He loves them.", "rating": "5"}, {"helpful": 0, "title": "Check the first two ingredients!  Sugar = Cavities", "body": "First two ingredients are SUGAR.  (glucose syrup, cane sugar)  Major source of cavities as the gummy gel seeps down between teeth and stays there. I learned the hard way.  Love the wholefood and antioxidants, but the sugar brought about a dental crisis in our family.  Gummies?  Never again!", "rating": "1"}, {"helpful": 1, "title": "Great product to replace PediaLax FIber Gummies", "body": "Yummi Bears are a great product, especially if you are trying to find a replacement for the PediaLax Fiber Gummies that have been off the market for a while now due to recall/manufacturing issues.", "rating": "5"}, {"helpful": 0, "title": "kids ask for this", "body": "My kids love the orange flavor and can't wait to get their daily dose. I love that it is all natural, no artificial colors or flavors.", "rating": "5"}, {"helpful": 1, "title": "Only slightly better than candy gummy bears", "body": "Great taste, but practically no fiber.  I misread the label, which is given in milligrams.  I thought it would be 12 grams fiber per serving, and it's only 1.2 grams!  And you have to eat several bears to get just that.", "rating": "2"}, {"helpful": 1, "title": "Vitamin and mineral quantity lower than pictured on Amazon", "body": "The item shipped to me was not as pictured on Amazon.  The supplement facts on item I received has lower amounts of each mineral and vitamin.  Disappointed that I will have to give my children more gummies to equal expected mineral and vitamin values.  Not truly 66 servings at this point.", "rating": "2"}, {"helpful": 1, "title": "Stinky", "body": "Smelled really bad, & tasted funny, waiting for Amazon to help me with return. Hve used this product before & no problem, must be old?", "rating": "1"}, {"helpful": 1, "title": "Fantastic", "body": "My daughter has health issues and we use high doses of vitamins as part of her treatments.  These are some of the few I don't ever have to fight with her about taking.  she loves them and I know they are helping her.", "rating": "5"}, {"helpful": 2, "title": "Taste good but only 1 gram fiber in 4 bears!", "body": "My 2-1/2 yr old daughter enjoyed eating these but 4 bears only equal one gram of fiber.... She still seemed to be getting constipated while taking these daily.", "rating": "3"}, {"helpful": 1, "title": "Kid Tested!", "body": "We have three kids, twins that are 9 and a 7 yr old.  They like the taste & have tried lots of other similar products - these are the best.  The 200 count jar is a great deal - especially compared to our local health food store smaller pkg/almost same price for 90.  They also love the multi-vitamin.  Great, great, great!!!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Very Good :-)", "rating": "5"}, {"helpful": 1, "title": "Yummi Bears Vitamins", "body": "My 3 year old daughter has been taking the Trader Joe's Gummy Vitamins for while now and I thought we would try something new. When our Yummi Bears arrived the were all melted into each other. Once I got them apart you couldn't tell that they were supposed to be bears. The shape was not a big deal to my daughter but she didn't like the way they tasted. Maybe if I started with these prior to the TJ's brand.", "rating": "2"}, {"helpful": 2, "title": "OK but why the sugar?", "body": "The product is A LOT of sugar with a little vitamin D.  How about just a vitamin D gelcap?  Do kids have to be trained to get sugar in everthing they eat?  Don't these add up way above the 4 tsp per day limit per AMA, if all supplements act this way?  Even sugar-free brands seem to put in questionable ingredients (we get lots of adverse digestive impacts from them, including inflammation).", "rating": "3"}, {"helpful": 0, "title": "Okay, if you like to pay for a big blob.", "body": "Bottle came with gummies melted into a blob. It's only in the 60's today in Michigan. No way this happened in the 3 minutes it sat on my porch. Waiting for response on replacement.", "rating": "1"}, {"helpful": 0, "title": "My kids LOVE these and they are free of my 3yo's allergens", "body": "My kids LOVE these and they are free of my 3yo's allergens. They taste so good my boys beg for their vitamins all day!", "rating": "5"}, {"helpful": 2, "title": "NOTE: not organic vegetable concentrate", "body": "I just received an email today from Hero Nutritionals confirming my suspicion that only the fruit portion of the concentrate is organic.  The veggie concentrate is NOT organic.  That means there's a \"dirty dozen\" veggie in there: the spinach.  The wording is a bit misleading on the bottle, and definitely false here on the Amazon.com description.  Hero is willing to replace the product for me, so I'm sure Hero Nutritionals is a good company, but not as green as I'd like.  (BTW, this supplement was for my now almost 5-yr-old.)", "rating": "2"}, {"helpful": 0, "title": "I like that they don't use fake colors or corn syrup", "body": "My daughter loves these! I like that they don't use fake colors or corn syrup.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "My kids love these!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "perfect", "rating": "5"}, {"helpful": 1, "title": "Too Sweet", "body": "My daughters took one bite and spit it out. It was too sweet and had a weird taste. She loves the regular multiple vitamin but these were a no go.", "rating": "1"}, {"helpful": 1, "title": "My son loves it!", "body": "I bought this for my son who hates fish and all seafood, but he likes these fish shaped pills! He takes them every other day and they are good for his heart. I recommend it!", "rating": "5"}, {"helpful": 1, "title": "Not bad, but not worth it.", "body": "My son loves them, but to me it is not worth it, as it takes 3 as a servig so then it is more like giving him candy rather than a vitamin! and at 3 a day they don't last long.", "rating": "2"}, {"helpful": 0, "title": "One Star", "body": "Good multi vitamin", "rating": "1"}, {"helpful": 0, "title": "Yummit Bears- Melted", "body": "The three bottles were received yesterday but the capsules completely  melted apparently cause by hot conditions during the shipment. Please find out, We need  a credit or a replemishment. .", "rating": "2"}, {"helpful": 8, "title": "If you are allergic to ragweed or year round allergies ...", "body": "If you are allergic to ragweed or year round allergies - do not take. I broke out in eczema all over my body and did not know why until I researched Echinacea and saw the warnings after I bought the product. So, I hope to save someone so they do not suffer the same fate.", "rating": "1"}, {"helpful": 7, "title": "Not for people with auto immune disease", "body": "Bought it for my mom and myself, and things got worse. It may not have been the supplements, but they should indicated that there can be side effects for people with auto immune disease such diabetes, ra, etc.", "rating": "1"}, {"helpful": 2, "title": "good so far", "body": "to be honest I cant tell the difference from one echinacea to the next - I dont buy it for the taste.. The jury is still out for me on if it prevents colds, but it seems like it if I take it all winter, I dont get nearly as many colds as I used to.", "rating": "4"}, {"helpful": 0, "title": "Quality without the after taste", "body": "We use Echinacea occasionally to boost our immune system.  The problem we've had with other brands is burping and/or after taste after taking the product.  We have had no such problem with the Nature's Resource brand.", "rating": "5"}, {"helpful": 0, "title": "DEFINITELY GET IT!! WAYYY BETTER THAN VITAMIN C", "body": "Echinacea is thee s***. I take it in lieu of taking Vitamin C and have never gotten the common flu or cold. You dont necessarily have to buy this brand as you have cheaper or more expensive brands but Nature Made has always been consistent with quality so I didn't hesitate to get this. You can never go wrong with Echinacea though so I am a happy customer. It's nature's organic secret to help build up your immune system to fight off any virus that may arrive during flu and allergy season", "rating": "4"}, {"helpful": 0, "title": "I've use this brand in the past and I liked it so I bought another round", "body": "I've use this brand in the past and I liked it so I bought another round. It's good to have on hand if you know you get sick every winter, like I do, or when some get sick around flu season. My grandfather also used this product on a daily basis to boost his immune system since it was gradually going downhill with age. I haven't noticed any negative side effects with this product, but I would recommend eating it with food, since the aftertaste is kind of bad if it dissolves on an empty stomach.", "rating": "5"}, {"helpful": 1, "title": "Exactly what I ordered", "body": "This is the first winter I have been sick multiple times. It seems I've had headcolds nonstop and a couple of flu bugs. I decided to take echinacea daily as recommended by a friend. So far so good! I haven't been sick for three weeks. I'd like to think it is the Echinacea that is helping.", "rating": "5"}, {"helpful": 0, "title": "Will not buy again", "body": "This was the first Echinacea brand that I tried and I was not impressed. It upset my stomach, I could taste the Echinacea in my mouth for hours after taking it, and it didn't seem to have any effect on my symptoms when taking preemptively for the cold flu. I purchased the Jarrow version of Echinacea and it worked MUCH better than this one.", "rating": "1"}, {"helpful": 1, "title": "Preventative Measures!", "body": "I haven't been sick in a while! Its been about 2 months or so. I'm sure in a combination of a clean diet and clean hygiene habits, this will work wonders for all. Worth a shot!", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Not getting sick while others are sneezing and wiping their runny noses. Proof enough for me.", "rating": "5"}, {"helpful": 0, "title": "Much needed herb no longer sold at stores", "body": "Depend on echinacea to fight off colds. Right now can only get nature made brand at Amazon.  No longer sold at stores.  Great product.", "rating": "5"}, {"helpful": 0, "title": "Nature Made is the only way to go for vitamins ...", "body": "Nature Made is the only way to go for vitamins, the only company to volunteer testing to prove their vitamins are exactly what they say. :)", "rating": "5"}, {"helpful": 0, "title": "The brand I like at a less expensive price", "body": "These are great and less expensive then the grocery store where I was getting them at before.", "rating": "5"}, {"helpful": 0, "title": "I have never been disappointed! Product is as described", "body": "Exactly what I would expect from this brand.  I have never been disappointed! Product is as described, no splits or dents in capsules.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Haven't gotten a cold since I started taking this...over a year now.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Not getting sick while others are sneezing and wiping their runny noses. Proof enough for me.", "rating": "5"}, {"helpful": 0, "title": "Nature Made herbs can be counted on to be of ...", "body": "Nature Made herbs can be counted on to be of proper dosage and composition.....this is the only herbal brand I will buy.", "rating": "5"}, {"helpful": 0, "title": "Good stuff", "body": "I use this to bring to Japan as souvenior. My friends love this.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Take it every day without fail. Reconmend it to every one", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great supplement", "rating": "5"}, {"helpful": 0, "title": "Superb product", "body": "This Nature Made Echinacea is easy to take and greatly boosts my immune system. I vary the dose depending on my particular need at the time .", "rating": "5"}, {"helpful": 0, "title": "Great help to prevent or reduce length of common cold", "body": "I have used this product for years.  I start use at first sign of a cold and it helps to reduce severity of illness or stop it all together.", "rating": "5"}, {"helpful": 0, "title": "Nature Made is the only way to go for vitamins ...", "body": "Nature Made is the only way to go for vitamins, the only company to volunteer testing to prove their vitamins are exactly what they say. :)", "rating": "5"}, {"helpful": 0, "title": "Much needed herb no longer sold at stores", "body": "Depend on echinacea to fight off colds. Right now can only get nature made brand at Amazon.  No longer sold at stores.  Great product.", "rating": "5"}, {"helpful": 0, "title": "I have never been disappointed! Product is as described", "body": "Exactly what I would expect from this brand.  I have never been disappointed! Product is as described, no splits or dents in capsules.", "rating": "5"}, {"helpful": 0, "title": "Nature Made herbs can be counted on to be of ...", "body": "Nature Made herbs can be counted on to be of proper dosage and composition.....this is the only herbal brand I will buy.", "rating": "5"}, {"helpful": 0, "title": "Echinacea is good for you", "body": "Must have before, during and after flue season. Take it daily for a few months to prevent getting ill. Stay well.", "rating": "5"}, {"helpful": 0, "title": "Great Echinacea Supplement", "body": "Great supplement for a great price! I take it twice a day. It is easy to take and the capsule is a decent size.", "rating": "5"}, {"helpful": 0, "title": "The brand I like at a less expensive price", "body": "These are great and less expensive then the grocery store where I was getting them at before.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "I am taking it for asthma. I haven't taken it long enough to know its benefits yet.", "rating": "4"}, {"helpful": 0, "title": "Superb product", "body": "This Nature Made Echinacea is easy to take and greatly boosts my immune system. I vary the dose depending on my particular need at the time .", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great value for price", "rating": "5"}, {"helpful": 0, "title": "Immune boost", "body": "Good product to boost your immune system. Most people taking this product would have a healthy lifestyle regardless. So, it's hard to say how much it helps. I usually take the product in flu season.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent natural protection", "rating": "5"}, {"helpful": 0, "title": "Great Product", "body": "I use this everyday. Once i feel like i'm getting the flu, i take 2 capsules along with a 1000mg Vitamin C per day until the symptoms leave. This is a very very good product", "rating": "5"}, {"helpful": 0, "title": "Echniancea", "body": "I have found this product to be most effective by using it once you detect a cold coming on, it either helps to eliminate the cold from taking place or at best will minimize the time of the cold.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Nature Made one of the best company.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "As expected", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "works", "rating": "5"}, {"helpful": 0, "title": "beats local stores by far as far as price goes!", "body": "fast shipping, great product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent natural protection", "rating": "5"}, {"helpful": 0, "title": "Good Stuff", "body": "Just what I was looking for/", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Great & Fast Shipping!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product & price.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great value for price", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great supplement", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Really helps.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great price.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "As expected.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "As expected", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great price", "rating": "5"}, {"helpful": 1, "title": "Four Stars", "body": "as advertised and a good savings from the store", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Powerfull", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "works", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "GOOD", "rating": "5"}, {"helpful": 0, "title": "Achoo!", "body": "Gave me allergies", "rating": "1"}, {"helpful": 3, "title": "It very in in Echinacea root which is the most important part of the herb.", "body": "The formulation has a high concentration of Echinacea root, which according to a Medical Doctor that is also a nutrition and diet specialist that I know, is much more effective at boosting your immune system.  Most of the others are mostly flower, leaf, or stem.  He advised us to take the capsules for two weeks and then one week off - as your system will get used to the Echinacea and it will lose its effect.", "rating": "5"}, {"helpful": 1, "title": "Good.", "body": "I like the fact that there is nothing extra outside of echinacea root. Just because this herb supposed to work in a longer period, I will see how helpful it is. I just started to use it.", "rating": "5"}, {"helpful": 1, "title": "The best!", "body": "Best echinacea capsules I've ever tried. You can taste the characteristic tingle when you put one in your mouth. Excellent.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Great delivery time. Easy to swallow and a convenient 90 count bottle. Awesome!", "rating": "5"}, {"helpful": 2, "title": "Five Stars", "body": "Excellent product that shipped so fast!", "rating": "5"}, {"helpful": 2, "title": "Five Stars", "body": "Great product!", "rating": "5"}, {"helpful": 2, "title": "Five Stars", "body": "Pure and simple. No ingredients that are not needed.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "THEY SEEM TO BE WORKING OK. I HAVEN T BEEN TAKING THEM FOR THAT LONG,", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "I love their products. I really can say they work!", "rating": "5"}, {"helpful": 2, "title": "Five Stars", "body": "Great product!", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "I love their products. I really can say they work!", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Great product!", "rating": "5"}, {"helpful": 0, "title": "Great combo", "body": "A staple in ur household, great for immune system.  We don't get sick and if we feel something may be coming on, we double dosis from one daily to two.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Always kicks a cold", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good", "rating": "5"}, {"helpful": 0, "title": "This product.. is themreal deal.", "body": "This product..is themreal deal.", "rating": "5"}, {"helpful": 0, "title": "Good product that I take all winter so I don't ...", "body": "Good product that I take all winter so I don't catch every cold I'm exposed to. This product helps build my immune system.", "rating": "5"}, {"helpful": 0, "title": "Felt a little sluggish and drained like a cold or flu coming on", "body": "Felt a little sluggish and drained like a cold or flu coming on. Took a couple of these spread out over two days and no more symptoms. Love that!", "rating": "5"}, {"helpful": 0, "title": "Good product, good price", "body": "Seems to work well. We have been having crazy weather here in PA and it seems to help us ward off any illness!", "rating": "5"}, {"helpful": 0, "title": "Threo Elderberry Echinacea Cold and Flu", "body": "Good flavor, just started taking this and hopefully will shorten duration of colds and viruses", "rating": "5"}]