[{"helpful": 7, "body": "I put this is my tea and it gives it a great taste if you balance it out with the correct amount of sweetener. I am still working out the exact measurements, and enjoy doing it, but have found that about 1 teaspoon for 64 ounces of tea works and 1/2 cup of honey. This works with a Gunpowder Green Tea, which is bitter to begin with so if your tea is sweeter I don't think as much honey would be needed.", "title": "Wonderful in Green Tea", "rating": "5"}, {"helpful": 0, "body": "If you've ever tried Kava, it tastes just like that. This is not something you're going to add to your smoothie. It tastes exactly like what a ground up root should taste like. Mix it with an 1/8 or 1/4 cup of water and take it like a shot of liquor. Tastes like root and dirt as expected. Not NEARLY as bad as everyone made out. Of course it's not going to taste like strawberries and fairy dust. These people had me thinking it was going to taste like gasoline or something. Nope, just tastes like roots. I wouldn't sip on the stuff like it was tea, but alone it's fine as long as you take it fast.", "title": "Does not taste as bad as described by others", "rating": "5"}, {"helpful": 0, "body": "I recently purchased this because it was the 2nd highest rated on labdoor. I only take a multivitamin and wanted to try this out. This product made me feel nauseous and difficult to breath.I also felt somewhat agitated. The taste is kind of bitter, but that wasnt a big issue, and is most likely normal. Unfortunately this is not for me, and was a waste. I will try the liquid one rated #1 on labdoor.", "title": "I did not like 1 star", "rating": "1"}, {"helpful": 1, "body": "People here are complaining that it tastes awfully bitter- ginseng is supposed to taste bitter, it's naturally bitter; it's like throwing a teaspoon of sugar in your mouth and complaining that it's too sweet.", "title": "Ginseng is naturally bitter", "rating": "5"}, {"helpful": 2, "body": "Product works great.  Gives you sustained energy and, I think, can also enhance your mood. (Don't know if it's supposed to do that or not.)  I was a little bit scared to taste it after some of the reviews I read, but it really wasn't as bad as I expected.  What I found to make it more palatable is that I put a dose in a small juice glass and mix in about a shot glass worth of boiling water and stir to dissolve.  Then add a teaspoon of honey and a drop of milk, and down the hatch.  Not bad at all.  I also tried mixing some in a homemade soup.  If you didn't know it was there, you couldn't tell.", "title": "Works great, don't be afraid of the taste.", "rating": "5"}, {"helpful": 8, "body": "This Panax Ginseng powder did give me lots of energy. Not jittery energy that you get from coffee, but more of a sustained focused energy. It's affordable for anyone on a budget. The only complaint that I have is that it tastes terrible. It has a very strong bitter root like flavor. Nothing masks the flavor.", "title": "Great ginseng", "rating": "3"}, {"helpful": 1, "body": "The thing with ginseng is every body has a different level of need or absorption and I found a 1/2 heaping teaspoon was the best amount for me. It could be do to body mass, I'm at 220 Lbs. and may need less if you only weight in at 165.", "title": "It works just like I expected", "rating": "4"}, {"helpful": 0, "body": "tasted disgusting so  I threw it out. probably did work though.", "title": "Three Stars", "rating": "3"}, {"helpful": 6, "body": "This ginseng worked well, giving me long lasting energy, and clearing brain fog.  I found that the suggested dosage of 1/8 teaspoon is the maximum I can take. In fact, 1/16 teaspoon is a better dose for me (I weigh 190 pounds). If you try this, I suggest very small doses to begin, and be careful if consuming other stimulants, because their effect is increased while ginseng is in your system. As with anything else, talk to your doctor before taking this, because it can interact with other medications.", "title": "Very effective for increasing energy, alertness, and for getting rid of brain fog.", "rating": "5"}, {"helpful": 6, "body": "If you need more energy during the day i would suggest this but it tastes like a herb(bitter and Sour)so better get ready for it...but i like the results", "title": "... the day i would suggest this but it tastes like a herb(bitter and Sour)so better get ready for it", "rating": "5"}, {"helpful": 3, "body": "Wow! This is the good stuff! My husband says he noticed a spike in energy permitting him to muscle through his workouts.", "title": "Noticed Extra Energy During Weight Training", "rating": "5"}, {"helpful": 1, "body": "Best valued ginseng product I've ever purchased, this will last me years! The taste is very strong, but so is the effect. A well balanced, non jittery energy and mood lifter. Fantastic product", "title": "great ginseng supplement", "rating": "5"}, {"helpful": 2, "body": "I certainly feel more focused when I use this ginseng. However, it is a bit pricey.", "title": "Focus", "rating": "4"}, {"helpful": 1, "body": "Good energy from this product but it made me feel dizzy, reason for the 3 stars other than that good product does what it supposed to.", "title": "Good energy from this product but it made me feel ...", "rating": "3"}, {"helpful": 0, "body": "This stuff gave me insomnia.  Its legit, but only take it in the morning.  Not like caffeine, its a 'slow burn' type of thing.", "title": "Not like caffeine, its a 'slow burn' type of thing", "rating": "4"}, {"helpful": 0, "body": "overall this Ginseng extract powder is a good product and the packaging is great (well seal package). the quality is great.", "title": "overall this Ginseng extract powder is a good product and the packaging is great (well seal package)", "rating": "5"}, {"helpful": 1, "body": "If you need energy this is the stuff to get!have bought it I think five times now. Lol. And will be buying more soon!", "title": "If you need energy this is the stuff to get ...", "rating": "5"}, {"helpful": 0, "body": "A nice quantity, but not yet determined effectiveness!+", "title": "Panax", "rating": "3"}, {"helpful": 0, "body": "I like it, first time to buy it but so far great. Would buy from this seller again.", "title": "Great", "rating": "5"}, {"helpful": 0, "body": "Potent and fresh", "title": "Potent and fresh", "rating": "5"}, {"helpful": 0, "body": "Great value, works well. Helps boost my energy for workouts.", "title": "Good Quality", "rating": "5"}, {"helpful": 0, "body": "good stuff. best bargain you'll find. get some small measurement spoons to be safe", "title": "Best deal, great quality", "rating": "5"}, {"helpful": 0, "body": "Good product to improve energy", "title": "Very good", "rating": "5"}, {"helpful": 0, "body": "Love this", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great quality, good price and delivery times.", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "clean stuff, will order again", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "great for after workout", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "I feel myself getting younger already.. (jk)", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great stuff! High quality and easy to mix.", "title": "Pure Ginseng extract", "rating": "5"}, {"helpful": 0, "body": "Arrived quickly, and good price!", "title": "and good price!", "rating": "5"}, {"helpful": 0, "body": "great for after workout", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "It does all ,that its history has proven and said it did, an still does. Good energy and healthy. Whoopy !", "title": "A good old favorite.", "rating": "4"}, {"helpful": 0, "body": "very good product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Potent and fresh", "title": "Potent and fresh", "rating": "5"}, {"helpful": 0, "body": "Love this", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Man this stuff taste bad really bad but they say it is really good for you I take this in some OJ stir it up good then shoot it down & take a sip of coffee to get rid of the bad taste in my mouth", "title": "This stuff is what I ordered", "rating": "5"}, {"helpful": 0, "body": "Product arrived on time and as expected. Use no more than 1/8th tsp. mixed into favorite drink of smoothie.", "title": "Great product", "rating": "5"}, {"helpful": 1, "body": "Good value but taste is very very bitter. I will go back to using real ginseng powder with no bitterness.", "title": "Tasted bad", "rating": "2"}, {"helpful": 0, "body": "it works great for me! the only reason why its 4/5 is because it tastes really bad. no matter what I mix it with or how much I dilute it, the bitter taste wont be masked.", "title": "it works great for me", "rating": "4"}, {"helpful": 1, "body": "I have no idea how well this product works because it tasted so horrible that I simply could not stomach it. I'm usually not finicky about flavor; I regularly drink Gingko powder which also has a bitter taste- but this product takes bad taste to another level. Its not the nice organic bitter flavor of strong herbs; Its more like just a really bad bitter taste you might get from eating something that is just not supposed to be edible. There is no amount of sugar or any other flavoring I foresee that can cover up the terrible taste. Its so bad that it overshadows all other flavors. Too bad. I would have liked to have felt its affect.", "title": "You win some and you NuSci Panax Ginseng Extract Powder some..", "rating": "2"}, {"helpful": 0, "body": "feel no difference when taking it", "title": "One Star", "rating": "1"}, {"helpful": 1, "body": "Taste is horrible. No masking the taste either. Tastes like poison. Like you shouldn't be ingesting it. you put a little bit in your shake and it destroys the flavor.  Ginseng extracts are better", "title": "Taste is horrible. No masking the taste either", "rating": "1"}, {"helpful": 3, "body": "Not sure if this is real ginseng ?", "title": "One Star", "rating": "1"}, {"helpful": 0, "body": "tasted disgusting so  I threw it out. probably did work though.", "title": "Three Stars", "rating": "3"}, {"helpful": 1, "body": "Very bad taste. Not sure about the quality control methods for this product.", "title": "One Star", "rating": "1"}, {"helpful": 6, "body": "I feel wonderful, I started taking panax ginseng for the cognitive and physical enhancement and I am beyond impressed. It takes approximately 40 minutes to kick in and the energy and uplifting thoughts kick in immediately after, an immense wave of happiness and energy.", "title": "I feel wonderful, I started taking panax ginseng for the cognitive ...", "rating": "5"}, {"helpful": 2, "body": "Didn't expect too much from this but thought it was worth a try. I had no side effects and noticed a difference right away in a stabilizing of my emotions and increase in energy without being jittery or hyper. Will be ordering again!", "title": "Surprised in a good way!", "rating": "5"}, {"helpful": 2, "body": "I don't know if it is the power of the mind but these are amazing. I feel great.", "title": "... is the power of the mind but these are amazing. I feel great", "rating": "5"}, {"helpful": 1, "body": "have used cheaper ginseng and could tell a difference in how I felt. I couldn't tell I was taking anything when I was taking this. No boost in mental or physical energy.", "title": "There is better stuff out there", "rating": "2"}, {"helpful": 5, "body": "Helps give me a nice boost :)", "title": "one a day", "rating": "4"}, {"helpful": 7, "body": "I've tried many Ginseng supplements over the years but never understood the hype until I tried this.  It works.  I get a nice smooth subtle energy and alertness boost that last several hours without making me jittery,and no crash.", "title": "It works well", "rating": "5"}, {"helpful": 1, "body": "I've been taking these for about a month. They seem to keep me alert and healthy.", "title": "I'm not fired anymore!", "rating": "5"}, {"helpful": 4, "body": "One of the better Korean Ginseng I have ever tried. Good for sexual health.", "title": "Good Korean Ginseng Source", "rating": "5"}, {"helpful": 2, "body": "after trying a few herbs and supplements, i decided to give my friend who is a skeptic this ginseng. He works long hours and not sure if it was a placebo effect or not, but he said that he feels more energetic and in a better mood when he's taking this.", "title": "gave this to my male friend who is a skeptic but he loved it!", "rating": "5"}, {"helpful": 0, "body": "It might just be a tad too \"strong\" for this 42 year old. I had the hormones of a high schooler again ... I was going more for the ADHD calming side of things.", "title": "It might just be a tad too \"strong\" for this ...", "rating": "3"}, {"helpful": 7, "body": "Great product that really works.  I want to let other buyers know that this brand passed Consumer Labs review.  Consumer Labs is an impartial reviewer of supplements, vitamins and the like and they found a number of brands to have lower ingredients than what was on the label or to be contaminated with lead.  Solgar's Ginseng passed on both fronts.", "title": "Great Lead-Free Ginseng", "rating": "5"}, {"helpful": 1, "body": "This is really a good supplement and you can feel the results from day one. As always with Ginseng it will not interfere with your life but will give you solid bust when you need it. I'm very happy and obviously I will reorder", "title": "Excellent choice", "rating": "5"}, {"helpful": 3, "body": "I started taking this product about a year ago.  I was having ED at the early age of 40.  I did a lot of changing my diet, exercise, and taking known herbal supplements, including this product.  Thing definitely changed for me, but over time I got lazy and stopped taking some supplements and such.  ED problem started up again, and I went back into the cabinet and started taking this supplement again as there were a few weeks worth left from when I stopped taking it.  I didn't change much else in my diet and took no other supplements.  Almost immediately I noticed a change in my erections.  It wasn't a placebo effect because I would wake up in the middle of the night with a raging erection (sorry for the bluntness but just want to be honest) for several nights in a row.  Same happened during my nap time (I work early morning hours and take a morning nap to supplement lack of sleep).  During \"times\" with my wife my erection was much harder and lasted the entirety of our \"time\".  She commented on it too.  Although I cannot be sure that this supplement is the sole reason for this change, I know it is a great possibility and will continue to take it and recommend it to others for this condition.", "title": "Seems to be helping with my ED", "rating": "5"}, {"helpful": 2, "body": "It actually seems like it works in helping to keep blood sugar under control. I had changed it to Nature's Bounty Ginseng with Royal Jelly for a month and then back and saw a difference.", "title": "May contribute to keeping blood sugar under control.", "rating": "5"}, {"helpful": 1, "body": "I havnt noticed any real change, maybe a lil more energy in the afternoon but its hard to say its 100% this ginsing. these capsules DO TASTE TERRIBLE, like eating PAINT. Horrible.", "title": "these capsules DO TASTE TERRIBLE, like eating PAINT", "rating": "3"}, {"helpful": 2, "body": "When I buy supplements, I'm always looking for standardized potency. This has it. If you take ginseng whether an athlete, student, have a stressful job (or all three), you know the difference when you take a quality ginseng supplement. I always take a break from ginseng for a few days before I try a different brand of supplement, to see, if it only subjectively, I notice any effect, and I did.", "title": "Good ginseng", "rating": "5"}, {"helpful": 1, "body": "Whew, this is good stuff. It gives you good energy that last all day. Not to mention something else that last longer also.", "title": "this is good stuff. It gives you good energy that last ...", "rating": "5"}, {"helpful": 0, "body": "Good, With fast delivery", "title": "Good, With fast delivery I gave 4 stars as ...", "rating": "4"}, {"helpful": 1, "body": "I THINK IT IS GOOD FOR MEN'S HEALTH", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Just what I expected.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Gives me energy to start off my morning hustle.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "These work great for energy, and great  price.", "title": "Good product", "rating": "5"}, {"helpful": 1, "body": "Gives me the extra pep I need... great product", "title": "great product", "rating": "5"}, {"helpful": 1, "body": "This is really a good supplement and you can feel the results from day one. As always with Ginseng it will not interfere with your life but will give you solid bust when you need it. I'm very happy and obviously I will reorder", "title": "Excellent choice", "rating": "5"}, {"helpful": 7, "body": "Great product that really works.  I want to let other buyers know that this brand passed Consumer Labs review.  Consumer Labs is an impartial reviewer of supplements, vitamins and the like and they found a number of brands to have lower ingredients than what was on the label or to be contaminated with lead.  Solgar's Ginseng passed on both fronts.", "title": "Great Lead-Free Ginseng", "rating": "5"}, {"helpful": 2, "body": "It actually seems like it works in helping to keep blood sugar under control. I had changed it to Nature's Bounty Ginseng with Royal Jelly for a month and then back and saw a difference.", "title": "May contribute to keeping blood sugar under control.", "rating": "5"}, {"helpful": 1, "body": "Very high quality Korean Gingseng.  The Asian form of Gingseng, also called Korean, is quite helpful in increasing alertness and energy, due to it's ability to increase blood flow.  It also helps improve memory, too, as the increased blood flow keeps the brain well nourished and oxygenated.", "title": "High quality Asian Gingseng!", "rating": "5"}, {"helpful": 1, "body": "I THINK IT IS GOOD FOR MEN'S HEALTH", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Just what I expected.", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "I havnt noticed any real change, maybe a lil more energy in the afternoon but its hard to say its 100% this ginsing. these capsules DO TASTE TERRIBLE, like eating PAINT. Horrible.", "title": "these capsules DO TASTE TERRIBLE, like eating PAINT", "rating": "3"}, {"helpful": 0, "body": "Works well for me.", "title": "Five Stars", "rating": "5"}, {"helpful": 4, "body": "Not feeling really effective. Ginseng generally produces lots of life energy in body. I wanted to use this product mainly for that purpose. But I am not feeling any difference.", "title": "Okay product.", "rating": "3"}, {"helpful": 2, "body": "Decided to give this brand of ginseng a try after reading all the glowing reviews and so far I am not impressed.", "title": "Decided to give this brand of ginseng a try after ...", "rating": "1"}, {"helpful": 0, "body": "Good product", "title": "Five Stars", "rating": "5"}, {"helpful": 4, "body": "Loads of cum everywhere. Awesome", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "It leaves a very blue trail down your face when you use it.", "title": "No", "rating": "2"}, {"helpful": 0, "body": "excellent product", "title": "very good", "rating": "5"}, {"helpful": 0, "body": "Ok", "title": "Five Stars", "rating": "5"}, {"helpful": 2, "body": "no change noticed - took faithfully daily for full bottle", "title": "Nothing different", "rating": "1"}, {"helpful": 0, "body": "useless...", "title": "One Star", "rating": "1"}, {"helpful": 2, "body": "I have been using this particular brand and product for about 1 year. One cap with breakfast and lunch. Reduces fatigue and makes me feel more like my normal self. I recommend this product. Tried Nature's bounty version but it was not effective. Ginseng varies greatly from manufacturer to manufacturer so I will only use this product/brand.", "title": "Reduces fatigue for me", "rating": "4"}, {"helpful": 1, "body": "Very high quality Korean Gingseng.  The Asian form of Gingseng, also called Korean, is quite helpful in increasing alertness and energy, due to it's ability to increase blood flow.  It also helps improve memory, too, as the increased blood flow keeps the brain well nourished and oxygenated.", "title": "High quality Asian Gingseng!", "rating": "5"}, {"helpful": 4, "body": "Standard product and NO different from any other product found at the local CVS !!", "title": "Normal, Standard Quality Product ! NOTHING SPECIAL!", "rating": "3"}, {"helpful": 9, "body": "Things are looking up. Ask my wife.", "title": "Things are looking up. Ask my wife.", "rating": "5"}, {"helpful": 1, "body": "i have tried many different types of Korean Ginseng Root bu this brand is my new standard for quality and for effectiveness", "title": "Cannot say enough good", "rating": "5"}, {"helpful": 4, "body": "One of the better Korean Ginseng I have ever tried. Good for sexual health.", "title": "Good Korean Ginseng Source", "rating": "5"}, {"helpful": 9, "body": "I have tried several different brands of ginseng in an effort to get my body back to functioning properly at a 40 year old male's hormone level. This is the first to have very significant effects.", "title": "Morning wood, all night", "rating": "5"}, {"helpful": 5, "body": "Fast shipping", "title": "Full Potency take as directed", "rating": "4"}, {"helpful": 1, "body": "Immediate response from my body. I am undergoing testosterone replacement therapy and this was recommended to take to improve energy and semen volume for fertility enhancement. I've it used it for a week but already see immediate improvement.", "title": "Best supplement I've ever tried", "rating": "5"}, {"helpful": 0, "body": "😒😒😒😒", "title": "Three Stars", "rating": "3"}, {"helpful": 2, "body": "I've tried different herbs off and on for years and honestly, seldom felt all the much. I think these help give me a little bit of a boost. Its subtle, but I feel a little better consistency with my energy level. I've only been taking the for about three weeks, but that's been my impression. I think whether or not herbs work is very much about whether its a good match for you, and what else is going on with medications, nutrition, etc. In case it helps, I'm a 48 year old woman. I have a really hard time with energy (having any), but eat quite healthfully and am somewhat active. My weight is average to low for my height. I think my hormones are fluctuating (perimenopause) and have wondered if the ginseng is helping with that, and if that's why I feel a little bit of support.", "title": "Helps even out energy levels (for me)", "rating": "5"}, {"helpful": 1, "body": "I'm performing like a much younger man again!", "title": "Really works!", "rating": "5"}, {"helpful": 1, "body": "Maybe it's just me, but these make me kind of sleepy.", "title": "Sleep booster?", "rating": "2"}, {"helpful": 0, "body": "This is a great rated product that I'm getting ready to repurchase. My son takes this to help with focus. I think it has definitely helped him.", "title": "Great product!", "rating": "5"}, {"helpful": 1, "body": "Energy level is high. good stuff. Thanks", "title": "good stuff.", "rating": "5"}, {"helpful": 1, "body": "I feel more energetic, very good product.", "title": "very good product.", "rating": "4"}, {"helpful": 4, "body": "Not feeling really effective. Ginseng generally produces lots of life energy in body. I wanted to use this product mainly for that purpose. But I am not feeling any difference.", "title": "Okay product.", "rating": "3"}, {"helpful": 0, "body": "Great ginseng! It's good quality and helps me feel stronger. Highly recommended for everybody!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "I am not sure if it really works or not did  feel the ​big difference in any way.", "title": "Three Stars", "rating": "3"}, {"helpful": 1, "body": "Awesome", "title": "Five Stars", "rating": "5"}, {"helpful": 3, "body": "I have been taking Korean Ginseng Root for 3 weeks now. I'm amazed at the improvement I have seen in me. I have been suffering from fatigue, cystic acne, vitamin B deficiency, hormonal imbalance and pcos. I have seen my cystic acne go down and my nails have started to grow because my body is now able to absorb nutrition. I also noticed and increase of energy. In conjunction with this product I am taking Herblore Organice Vitex (chasteberry), Live assure , St Francis Adrenal Tonix, and Pregnitude.", "title": "Nothing but good things", "rating": "5"}, {"helpful": 0, "body": "I bought this for one reason to increase my libido. So far I have purchased 3 bottles of these from Amazon. At first I purchase quite a few different items and slowly worked through the products. As time went by there were a few that I ordered again. This was one. The second order I felt like the quantity was lower than advertised but I didn't count them when they arrived. So I stopped taking them. The reason I purchased any of these items stopped working properly which is discouraging for the other products. So I purchased a third bottle and counted after opening them. The quantity was correct and the reason for purchasing these started working again. I haven't noticed any other effects but the one. It seems all the other herbs didn't hold a candle to this stuff.", "title": "Super happy", "rating": "5"}, {"helpful": 0, "body": "Using it for pain management.  Just wish they made a higher percentage of the key constituent.", "title": "Great product.", "rating": "5"}, {"helpful": 0, "body": "Love it; take one every morning to give me a clear head and energy. Lasts; no side effects ❤", "title": "Works!!", "rating": "5"}, {"helpful": 0, "body": "Didn't notice any effect at all after taking for days. Smelled right, for ginseng through..", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "Gives me energy to start off my morning hustle.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "These work great for energy, and great  price.", "title": "Good product", "rating": "5"}, {"helpful": 3, "body": "Going strong at 71 and this js an aid.", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Not sure if I noticed anything with this product. Maybe it wasn't for me.", "title": "Three Stars", "rating": "3"}, {"helpful": 1, "body": "Maybe it's just me, but these make me kind of sleepy.", "title": "Sleep booster?", "rating": "2"}, {"helpful": 1, "body": "I'm performing like a much younger man again!", "title": "Really works!", "rating": "5"}, {"helpful": 1, "body": "I feel more energetic, very good product.", "title": "very good product.", "rating": "4"}, {"helpful": 1, "body": "Energy level is high. good stuff. Thanks", "title": "good stuff.", "rating": "5"}, {"helpful": 0, "body": "This is a great rated product that I'm getting ready to repurchase. My son takes this to help with focus. I think it has definitely helped him.", "title": "Great product!", "rating": "5"}, {"helpful": 0, "body": "Great ginseng! It's good quality and helps me feel stronger. Highly recommended for everybody!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "I am not sure if it really works or not did  feel the ​big difference in any way.", "title": "Three Stars", "rating": "3"}, {"helpful": 1, "body": "Awesome", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "High quality, gives the pick up I'm looking for.", "title": "Works well", "rating": "5"}, {"helpful": 1, "body": "No miracle drug here.  It does seem to help me a little, though.  I am possibly a little more mellow and have a little more libido.  Would probably try it again.", "title": "Would probably buy again.", "rating": "4"}, {"helpful": 0, "body": "Best Ginseng out there!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Gives me that lift.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "always fresh", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "I like it", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Thank you", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Excelent", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "I guess it is working, not sure. How do you really tell? It was delivered as promised and looks to be okay.", "title": "Delivered as promised and looks to be okay.", "rating": "5"}, {"helpful": 2, "body": "I love this supplement.  The best quality ginseng supplement I have ever found.  I strongly recommend this.", "title": "Excellent quality supplement.", "rating": "5"}, {"helpful": 2, "body": "This is my husbands FAVORITE ginseng and he has had many kinds through the years. Says it gives him the most energy of any brands kinds.", "title": "Great energy product!", "rating": "5"}, {"helpful": 1, "body": "Not only did this not help me a whole lot, but this gave me lots of bloating that caused me to have to burp continuously until the ginseng completely wore off. I also couldn't mitigate it with either natural or OTC remedies. I have had this from effect from other capsule delivered ginseng as well. So, for me, it seems that it is best to stick to tinctures, with which I haven't had this effect. I use Herb Pharm's Asian ginseng. It's pricier, but it actually works without unpleasant side effects.", "title": "Made Me Bloated", "rating": "2"}, {"helpful": 2, "body": "Love it!  Gives me plenty of energy!", "title": "Love it! Gives me plenty of energy", "rating": "5"}, {"helpful": 2, "body": "By the pictures of the bottles, I could not tell how big the gelcaps were and they stick in my throat, even if I first coat them in olive oil. I will not purchase them again as they were a total loss to me.", "title": "The Gelcap is too big!", "rating": "2"}, {"helpful": 2, "body": "i have more energy at my physical job now due to this great product!. thanks again for the quick service.", "title": "product response", "rating": "5"}, {"helpful": 1, "body": "Great product. Definitely helped me with daily energy and immune system support. Also it's natural! Will buy again.", "title": "Natural Immune system booster and additional energy!", "rating": "5"}, {"helpful": 1, "body": "More energy", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "I like it", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "No effect at all...", "title": "Two Stars", "rating": "2"}, {"helpful": 1, "body": "Worth having, and hard to find in stores.", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Very good. Been using it for years", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "The bottle was not sealed and when I check the pills I found it got around 180 pills only. I had it returned.", "title": "Came with bottle opened", "rating": "1"}, {"helpful": 0, "body": "good", "title": "Five Stars", "rating": "5"}, {"helpful": 4, "body": "I have used this product now for 2 yrs... It does what it says.  I take it before a work out. I feel the energy boost in about 20 mins..  great stuff!!!!!", "title": "Tru Energy !!!", "rating": "5"}, {"helpful": 1, "body": "Great product. Definitely helped me with daily energy and immune system support. Also it's natural! Will buy again.", "title": "Natural Immune system booster and additional energy!", "rating": "5"}, {"helpful": 3, "body": "I really like this product and have been using it for years. It gives me noticeable energy.", "title": "John", "rating": "5"}, {"helpful": 1, "body": "More energy", "title": "Five Stars", "rating": "5"}, {"helpful": 3, "body": "This product is a miracle for me!  I have suffered from CFS and Fibromyalgia for many years.  I take one or two of these ginseng tablets per day and they keep me going.  I have not found any other over the counter products that do this for me.  I highly recommend this product!!", "title": "Amazing for Energy and Thought Process!", "rating": "5"}, {"helpful": 0, "body": "I'm used to Hi-Ener-G tablets.But,I thought I would give these a try.", "title": "Not all that good.", "rating": "3"}, {"helpful": 0, "body": "good", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "I like it", "title": "Four Stars", "rating": "4"}, {"helpful": 2, "body": "This herbal supplement is not cheap, but it costs a little more than others because the ingredients are not cheap.  It works and with 300 softgels, lasts about a year, not bad!", "title": "It works", "rating": "4"}, {"helpful": 0, "body": "Its called triple energy it did not work for me no energy is what I got.", "title": "One Star", "rating": "1"}, {"helpful": 2, "body": "I've taken ginseng before, and I thought it was doing something for me. It gave me a sensation of warmth like you would get from a good workout and I guess gave me a little bit of energy. These pills, however, do nothing for me at all. Placebo effect? Probably. Working for me this time around? No.", "title": "Doesn't do a thing for me", "rating": "2"}, {"helpful": 1, "body": "I usually find this at Costco, but they didn't have it this time, so I headed to Amazon. Yep, they had it with reasonable price and shipping, so I ordered it. Glad I did.", "title": "good source for a good product", "rating": "5"}, {"helpful": 1, "body": "I have used this for a long time but Costco stopped supplying it, so i was glad to find it on Amazon.", "title": "good ginseng", "rating": "5"}, {"helpful": 1, "body": "These pills are shaped like little footballs and they turned out too be to big for me to swallow. Needless to say it's a disappointment that I can't use them.", "title": "Pills are too big", "rating": "1"}, {"helpful": 1, "body": "I have to start off by saying I had a hystorectomy last November and I had no drive to have sexual relations with my partner. I started taking the Korean red ginsend and a week later my labido was back. Thank you so much for this. I thought I would never experience excitement again and was regretting the surgery even though I was hurting so bad every month. I told my partner I would rather have not had the surgery and hurt every month then to go through what I was going through right now. Then I tried the korean red genseng and was happy to have it. If any of you are experiencing these problems its well worth the $12 a bottle.", "title": "very good", "rating": "5"}, {"helpful": 1, "body": "my husband had used this regularly for the past few years, but after reading the label, I thought I would give it a try as well. It", "title": "I found it effective", "rating": "5"}, {"helpful": 8, "body": "Like this stuff.  Boosts blood flow to your brain, but doesn't noticeably interfere with neurotransmitters.  Also helps relieve soreness in your brain/head.  518mg per capsule is overdoing it though. I never take the whole thing at once.", "title": "Low level tonic for the brain injured", "rating": "5"}, {"helpful": 0, "body": "I tried this Ginseng because I heard Korean Red Ginseng can help you have energy. I take one capsule every morning with my juice. I did not notice anything for about two weeks or so. I did notice an increase of energy. I did not have any side effects. I started then taking two pills. I take the second one in the early afternoon. Then I started feeling really awesome after a short time.  I have been taking this product for two months and feel wonderful. I highly recommend this product since it does make me feel good.", "title": "Helped increase my energy", "rating": "5"}, {"helpful": 0, "body": "Good buy", "title": "Five Stars", "rating": "5"}, {"helpful": 8, "body": "The service was good, received it pretty fast. The product is good for the price. It takes a while for it to get in your system but once its in there, you will feel energized. Realistically, ya not gonna feel like super man, but you will get an extra pep in your step.", "title": "good for the price", "rating": "4"}, {"helpful": 5, "body": "This ginseng is the real thing but it's a bit expensive even if you buy it in the economy six pack. Very effective", "title": "The real item", "rating": "5"}, {"helpful": 8, "body": "I have found that this brand delivers a great amount of Korean Red Ginseng and works very well. It may take a week or two to feel the effects but you definitely will feel  it working. Delivery was fast and price is very reasonable and competitive.", "title": "korean red ginseng", "rating": "5"}, {"helpful": 3, "body": "My husband was taking testerone for low T and we didn't like the personality changes in him so he went off the drug.  He heard about Korean Red Ginseng to deal with this tiredness.  It works wonderfully, no more mid afternoon naps.", "title": "... was taking testerone for low T and we didn't like the personality changes in him so he went off ...", "rating": "5"}, {"helpful": 1, "body": "Prince Of Peace - Korean Red Ginseng, 518 mg, 50 capsules- I like to finish a product before I give it a review and today was my last 2 capsules of this brand. I do take many different supplements and I like to add Ginseng to the mix so I gave Prince of Peace a shot. Understanding that everybody's body is different and reacts different ways usually keeps me from slamming a product unless it is really jacked up. In this case I would say the shipping speed and price for what you get is not bad for this product and at this does rate I only have to take 2 a day, so that's a plus. As for the product itself I must be either getting used to the Ginseng or these brands arent packing enough punch because my last 2 shots have come up leaving something to be desired from the Ginseng world. I did not get the giddy up I was hoping from this and think I will return to my old brand even if it is a little more expensive. All in all it wasn't a bad product and I didn't not have any bad side effects it just didn't give me the boost I was hoping for.", "title": "Not Enough Giddy Up For Me", "rating": "3"}, {"helpful": 6, "body": "I didnt like the way the ginseng made me feel, made me irratable and shaky. Felt the same way caffiene makes me feel. This is a stimulate and im sensitive to caffine so thats probably why. For most people im sure this is fine but not for me.", "title": "Side Effects", "rating": "2"}, {"helpful": 0, "body": "Best ginseng I've ever tried (and that's quite a few); take one on rising & one with biggest meal of the day (usually mid-day meal for me). Quite a boost--tho if you take it in very warm weather, may make you sweat more. Major effects wear down gradually; someone told me that happens with all herbs & that it's good to stop taking them for three weeks every so often, so that's what I do now.", "title": "Best ginseng I've tried--a nice energy booster", "rating": "5"}, {"helpful": 0, "body": "Doesn't seem to do anything it claimed.  I have had other Ginseng products that have worked far better than this brand.  Will not purchase this again or recommend it to anyone.  Sorry I purchased 2 bottles of it.  Waste of money.", "title": "No Good!!", "rating": "1"}, {"helpful": 0, "body": "Did not get a 'blast' effect as some people have reported and I'm rather glad of that. Since it's cumulative, I'm working with dosage - so far, so good. Does seem to be helping smooth anxiety which is a big plus as some prescribed drugs are just not for me.", "title": "... effect as some people have reported and I'm rather glad of that", "rating": "4"}, {"helpful": 1, "body": "Good price and works well for me..what else can I say...this price is way cheaper than most selling this same product..It was properly sealed and quickly shipped...", "title": "Prince Of Peace - Korean Red Ginseng, 518...", "rating": "5"}, {"helpful": 1, "body": "I've tried it and I haven't found a significant difference with its use. I'm going to buy another bottle to see if it helps.", "title": "Okay", "rating": "3"}, {"helpful": 0, "body": "Was hoping to get me out of my fog and give me a little more energy but no such luck. Based on the reviews I was very hopeful. Glad it worked for some people but did not work for me.", "title": "Was hopeful but....", "rating": "2"}, {"helpful": 0, "body": "My wife uses this she says: \" I have used Prince of Peace ginseng brands and they have a higher % of ginsenosides than most brand, this is 5%, their extractum is 7%", "title": "always of good quality and potency", "rating": "4"}, {"helpful": 0, "body": "I have not noticed any difference and most likely will not order again. It may be that this will and has worked for others but just didn't do anything for me.", "title": "Not much of a change for me", "rating": "3"}, {"helpful": 0, "body": "Just received it. Took two in the course of one day and I must say the results were impressive. I take one a day now LOL!! Definitely worth the money.", "title": "Prince of Darkness", "rating": "5"}, {"helpful": 0, "body": "No real benifit for me. I made this purchase for a second time just to be absolutely sure. And for the second time I'm disappointed...", "title": "Prince of Peace, Not for me...", "rating": "2"}, {"helpful": 0, "body": "Excellent product no psycoactive issues as with other ginseng. brings up my libido and gives me energy at the beginning of the day.", "title": "Excellent product no psycoactive issues as with other ginseng", "rating": "5"}, {"helpful": 0, "body": "Felt nothing different when taking this.  I am not sure what I expected, but I felt no different at all", "title": "OK", "rating": "3"}, {"helpful": 0, "body": "Seems to help my energy level..not huge difference and took a couple weeks to start helping", "title": "seems to help me", "rating": "5"}, {"helpful": 4, "body": "I heard about this product thru Dr Oz and decided to give it a try.  I used the first bottle and did notice a considerable difference in my mental state more alert, sharp, not fatigued.  Then I ran out for a few weeks and i began to feel fatigued stressed. That is when I realized how well these little capsules worked!!!  I am back on my Ginseng and feeling 100% better!", "title": "Wonderful...", "rating": "5"}, {"helpful": 0, "body": "Saw no difference in effect. Been taking it for about a month.", "title": "Don't waste your money.", "rating": "1"}, {"helpful": 1, "body": "Haven't used the product because amazon had a label over the directions on how to take. When i removed the amazon label everything came off so I'm not sure how to use this product. Too afraid to guess on the dosage to use. Wasted money", "title": "Wasted", "rating": "1"}, {"helpful": 0, "body": "Best Korean ginseng there is.", "title": "prince of peace makes great  products! !", "rating": "5"}, {"helpful": 0, "body": "Good product. Helps for me .", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "This product may have some Korean Ginseng in it, but it is a very small amount. The rest are fillers, rice etc. I returned mine.", "title": "No Good", "rating": "1"}, {"helpful": 0, "body": "Excellent! Thank You!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Didn't help much", "title": "Probably Need More than this", "rating": "3"}, {"helpful": 0, "body": "Great product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Like it!", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Great", "title": "Great product", "rating": "5"}, {"helpful": 0, "body": "makes you feel warm and good!  All natural - no silica!  Thanks, Rick", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Works well, will keep buying and using.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Made me nauseous. Be careful!", "title": "Not for me!", "rating": "1"}, {"helpful": 4, "body": "I heard about this product thru Dr Oz and decided to give it a try.  I used the first bottle and did notice a considerable difference in my mental state more alert, sharp, not fatigued.  Then I ran out for a few weeks and i began to feel fatigued stressed. That is when I realized how well these little capsules worked!!!  I am back on my Ginseng and feeling 100% better!", "title": "Wonderful...", "rating": "5"}, {"helpful": 0, "body": "Does work,", "title": "One Star", "rating": "1"}, {"helpful": 0, "body": "Still not sure are there any benefits - it's hard to tell. When I take it twice daily, for a few days in a row, I've noticed a stomach upset. Successfully reproduced it several times. When I take breaks, upsets are gone.", "title": "Stomach upset", "rating": "3"}, {"helpful": 1, "body": "Good price and works well for me..what else can I say...this price is way cheaper than most selling this same product..It was properly sealed and quickly shipped...", "title": "Prince Of Peace - Korean Red Ginseng, 518...", "rating": "5"}, {"helpful": 0, "body": "too early too tell results", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Nothing I order gets a top rating right away, I need time to USE it!", "title": "Four Stars", "rating": "4"}, {"helpful": 1, "body": "I LOVE this Ginseng!  It gives me a great burst of energy and lasts for hours.  I actually find myself pouring out some of the powder to keep from feeling too energized.  This really works!  Will buy this brand again.  Very happy!!!", "title": "I LOVE this Ginseng", "rating": "5"}, {"helpful": 2, "body": "I love my ginseng and this complex is my favorite , is easy on your stomach and the energy is wonderful is much better than caffeine.", "title": "Be ready to go every morning", "rating": "5"}, {"helpful": 0, "body": "It is hard to say if a supplement really works - but I take this as an immune system booster whenever I start to feel a cold or fever coming on, and so far I have never had a full on sickness when taking this brand of ginseng.", "title": "As an immune system booster: It works", "rating": "5"}, {"helpful": 3, "body": "The Ginseng Complex truly changed my energy level.  Usually, I feel tired and unfocused, however, my energy level increased drastically after using over the course of a week.  After reaching forty years old, I was unable to concentrate without feeling weak.  Taking this supplement has given me the energy to exercise and remember everyday tasks.  Thank you Nature's Bounty", "title": "Proven Results....It works!", "rating": "5"}, {"helpful": 3, "body": "There's something in this that makes me really dizzy, and I'm not sure what it is. I've been taking ginseng supplements for years and never had this problem.", "title": "Bad ingredients", "rating": "3"}, {"helpful": 1, "body": "I'm going neutral on these. No ill effects but I also noticed nothing when taking these.", "title": "Noticed Nothing By Taking These.", "rating": "3"}, {"helpful": 9, "body": "Bought this to help supply me with energy along with coffee to get through class.  I drink coffee on the regular, upwards of six cups a day and usually by mid afternoon I hit a crashing point.  I did some research and found that ginseng can help supply energy throughout the day.  I can tell a difference in my energy levels when taking this product, not only does it pair well with the caffeine in coffee but prevents the mid afternoon crash.  I now can focus better in class.", "title": "I know can focus better in class", "rating": "5"}, {"helpful": 3, "body": "Product description does not tell you the dosage, but here it is. Over-all not very impressive compared to others.", "title": "Product description does not tell you the dosage, but ...", "rating": "3"}, {"helpful": 2, "body": "Didn't notice any difference.", "title": "Three Stars", "rating": "3"}, {"helpful": 1, "body": "Good price. No results.", "title": "Save your money..", "rating": "3"}, {"helpful": 1, "body": "Not only do you get ginseng, but you get royal jelly as well. What's not to love. I've noticed the mental benefits from these during my use over the last couple of weeks, and the price is just right.", "title": "Great!", "rating": "5"}, {"helpful": 0, "body": "As expected.", "title": "As expected.", "rating": "4"}, {"helpful": 0, "body": "excellent- the best!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good product, good price.", "title": "Five Stars", "rating": "5"}, {"helpful": 9, "body": "Bought this to help supply me with energy along with coffee to get through class.  I drink coffee on the regular, upwards of six cups a day and usually by mid afternoon I hit a crashing point.  I did some research and found that ginseng can help supply energy throughout the day.  I can tell a difference in my energy levels when taking this product, not only does it pair well with the caffeine in coffee but prevents the mid afternoon crash.  I now can focus better in class.", "title": "I know can focus better in class", "rating": "5"}, {"helpful": 1, "body": "I can definitely feel an energy boost after taking this supplement minus the jitters that accompany caffeine.", "title": "*****FIVE STARS*****", "rating": "5"}, {"helpful": 0, "body": "Great product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "I found this to be a quality product at a reasonable price.  I have not noticed any big difference since taking this but I am working on curing vitamin deficiencies so it could take awhile to see anything .  The capsules are easy to swallow which is important to me.", "title": "quality product and easy to swallow", "rating": "5"}, {"helpful": 0, "body": "Great item. Great price!", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "I have been taking the ginseng for a couple of weeks now and can tell a difference in my energy levels.", "title": "I have been taking the ginseng for a couple of ...", "rating": "5"}, {"helpful": 1, "body": "Made me sick and gave me headaches.", "title": "One Star", "rating": "1"}, {"helpful": 1, "body": "easy to order and easy to use.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "What can I say? I thought I'd give ginseng a try, but I'm mostly unimpressed. My energy levels seem to be boosted best by other means (polyphenols).", "title": "Not Impressed", "rating": "3"}, {"helpful": 1, "body": "For me it's a great product and I'm very happy so I highly recommend, thanks for being so punctual amazon.", "title": "For me it's a great product and I'm very happy so I highly recommend", "rating": "5"}, {"helpful": 0, "body": "These are great. They give me the energy for a full day. Very effective.", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Great delivery, good source of energy", "title": "Great delivery, good source of energy", "rating": "5"}, {"helpful": 3, "body": "Product description does not tell you the dosage, but here it is. Over-all not very impressive compared to others.", "title": "Product description does not tell you the dosage, but ...", "rating": "3"}, {"helpful": 0, "body": "I bought this when I had a horrendous cold.  I couldn't tell if it helped or not.  As for energy or concentration, it does not seem to be effective at all.", "title": "I bought this when I had a horrendous cold. ...", "rating": "2"}, {"helpful": 0, "body": "I've been using this for years. I'm told how young I look, which is fantastic for me at my age.", "title": "which is fantastic for me at my age", "rating": "5"}, {"helpful": 1, "body": "Works.  That simple. Increases blood flow", "title": "Works. That simple.", "rating": "5"}, {"helpful": 4, "body": "Gives me a lot of energy - especially balancing working and nursing school.  I was looking for a much healthier option than Mountain Dew which gave me terrible cramps and coffee that I had become immune to.  This works!  Thank you.", "title": "I was looking for a much healthier option than Mountain Dew which gave me terrible cramps and coffee that I had become immune to", "rating": "5"}, {"helpful": 8, "body": "I had high expectations for the Ginseng Complex but, unfortunately, it caused me to have serious headaches. I tried them in a few occasions to make sure it wasn't caused by something else and each day I took these I ended up with headaches bordering on migraines.", "title": "Not at all recommended", "rating": "2"}, {"helpful": 2, "body": "Part of a dual pack, each capsule in both bottles only filled half way and neither bottles' caps/freshness seals showed any signs of tampering. I'm surprised with the lack of quality control from Nature's Bounty. Will NOT buy this brand anymore.", "title": "Brand new bottles and capsules half-filled!", "rating": "1"}, {"helpful": 1, "body": "Not only do you get ginseng, but you get royal jelly as well. What's not to love. I've noticed the mental benefits from these during my use over the last couple of weeks, and the price is just right.", "title": "Great!", "rating": "5"}, {"helpful": 1, "body": "I really like Nature's Bounty products and I'm certainly not disappointed with their Ginseng Complex Plus Royal, it does just what I expected and needed it to do. You can rely on Natures Bounty to be at the top when it comes providing a quality product.", "title": "Great Product.", "rating": "5"}, {"helpful": 1, "body": "I can definitely feel an energy boost after taking this supplement minus the jitters that accompany caffeine.", "title": "*****FIVE STARS*****", "rating": "5"}, {"helpful": 1, "body": "For me it's a great product and I'm very happy so I highly recommend, thanks for being so punctual amazon.", "title": "For me it's a great product and I'm very happy so I highly recommend", "rating": "5"}, {"helpful": 1, "body": "I have been taking the ginseng for a couple of weeks now and can tell a difference in my energy levels.", "title": "I have been taking the ginseng for a couple of ...", "rating": "5"}, {"helpful": 1, "body": "The second bottle I purchased ended up glued tight together at the 1/2 way mark of use. They were so stuck together I had to throw out the last half bottle. I hope this is niot common as I prefer to keep buying", "title": "Attention manufaturer", "rating": "2"}, {"helpful": 1, "body": "Works.  That simple. Increases blood flow", "title": "Works. That simple.", "rating": "5"}, {"helpful": 8, "body": "Nature's Bounty is an excellent brand, but it was a mistake to make this blend of several different Ginseng oils and extracts. Each of them has completely different effects- and side effects- so it is especially disappointing when you experience negative effects. A very large percentage of people experience immediate digestive upset from Ginseng. I was one, and had to throw it out.", "title": "Nature's Bounty is an excellent brand, but it was a mistake to make ...", "rating": "2"}, {"helpful": 1, "body": "Great delivery, good source of energy", "title": "Great delivery, good source of energy", "rating": "5"}, {"helpful": 1, "body": "Made me sick and gave me headaches.", "title": "One Star", "rating": "1"}, {"helpful": 1, "body": "easy to order and easy to use.", "title": "Five Stars", "rating": "5"}, {"helpful": 2, "body": "In addition to the capsules only being 3/4th full this Ginseng gave me a headache. Won't be purchasing this again.", "title": "Questionable quality", "rating": "1"}, {"helpful": 0, "body": "I bought this when I had a horrendous cold.  I couldn't tell if it helped or not.  As for energy or concentration, it does not seem to be effective at all.", "title": "I bought this when I had a horrendous cold. ...", "rating": "2"}, {"helpful": 0, "body": "What can I say? I thought I'd give ginseng a try, but I'm mostly unimpressed. My energy levels seem to be boosted best by other means (polyphenols).", "title": "Not Impressed", "rating": "3"}, {"helpful": 0, "body": "Excellent product. Only reason not re-ordering it is because of delivery date given. Almost out. Didn't want to wait almost two weeks for delivery.", "title": "Great product!!", "rating": "5"}, {"helpful": 0, "body": "This stuff works.  It gives me that extra boost without the crash.  I like this version because it's a blend of american and red ginseng.", "title": "I like this version because it's a blend of american and ...", "rating": "5"}, {"helpful": 0, "body": "Does what it's supposed to do - I guess. It'd be nice to get this in a larger bottle as this is only a month's supply.", "title": "It'd be nice to get this in a larger bottle as this ...", "rating": "5"}, {"helpful": 0, "body": "It is hard to diagnose prevention but if the ginseng is helping our overall health, this brand is priced right.", "title": "It is hard to diagnose prevention but if the ginseng ...", "rating": "5"}, {"helpful": 0, "body": "I've been using this for years. I'm told how young I look, which is fantastic for me at my age.", "title": "which is fantastic for me at my age", "rating": "5"}, {"helpful": 0, "body": "Absolutely magnificent, i think it came in less than 3 days which was really quick thank you.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "However I didn't recive the correct order", "title": "... But I had tried it b4 & it's very good", "rating": "4"}, {"helpful": 1, "body": "Good Price", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "This gives you super powers.  Or at least some more energy during the day.", "title": "Good Product", "rating": "5"}, {"helpful": 0, "body": "Great supplement, I really feel like I have more energy and clear mind.", "title": "Works as described...", "rating": "5"}, {"helpful": 0, "body": "Gives you a nice boost of energy during the day AND at night!! ;)", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "I'm mixing this with a Ginkgo Leaf supplement. Both are great!", "title": "Ginkgo!", "rating": "5"}, {"helpful": 1, "body": "The product itself seems to be good, but not sure why the pricing is how it is currently. A pack of 1 is $6.29 (.08/count). A pack of 3 is $21.89 (.10/count).", "title": "Good products, but prices are misleading!", "rating": "4"}, {"helpful": 0, "body": "Just an amazing supplement", "title": "Kawa", "rating": "5"}, {"helpful": 0, "body": "Not sure its doing anything i dont feel differently", "title": "Two Stars", "rating": "2"}, {"helpful": 1, "body": "Great!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "\"Very good product with fast shipping \"", "title": "Five Stars", "rating": "5"}, {"helpful": 5, "body": "This stuff give me energy, but eat with food or it can cause stomach upset", "title": "Works!", "rating": "5"}, {"helpful": 0, "body": "Appears to be consistent in quality.", "title": "Consistent", "rating": "5"}, {"helpful": 0, "body": "Notice a difference in energy level", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Natures bounty is one of my favorite brands because they stand buy their products. Ginseng is awesome for clarity, memory and energy plus I'm sure there is more.", "title": "Natures Bounty offers pure products that they stand behind", "rating": "5"}, {"helpful": 1, "body": "I have noticed a definite energy boost when I take these. It really helps me to get past the after lunch fallout. This is a great product with a great price.", "title": "Great natural replacement for five hour energy.", "rating": "5"}, {"helpful": 0, "body": "Prompt service.  Great product.", "title": "Great product.", "rating": "5"}, {"helpful": 1, "body": "I really like Nature's Bounty products and I'm certainly not disappointed with their Ginseng Complex Plus Royal, it does just what I expected and needed it to do. You can rely on Natures Bounty to be at the top when it comes providing a quality product.", "title": "Great Product.", "rating": "5"}, {"helpful": 0, "body": "no comment", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "Seems to have no effect.", "title": "One Star", "rating": "1"}, {"helpful": 1, "body": "Natures bounty is one of my favorite brands because they stand buy their products. Ginseng is awesome for clarity, memory and energy plus I'm sure there is more.", "title": "Natures Bounty offers pure products that they stand behind", "rating": "5"}, {"helpful": 1, "body": "I have noticed a definite energy boost when I take these. It really helps me to get past the after lunch fallout. This is a great product with a great price.", "title": "Great natural replacement for five hour energy.", "rating": "5"}, {"helpful": 1, "body": "This made me extremely nauseous. I quit use after a couple of weeks. I tried to give my body time to adjust but it was not for me.", "title": "Induced Nausea", "rating": "1"}, {"helpful": 1, "body": "Very fast shipping and well packaged. Just started taking it but all OK so far. Thanks", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Have been using Ginsana and it is expensive.  Nature's Bounty offers a larger bottle for less money.  Ginseng is a great energy product and has absolutely NO side effects.  A great product.", "title": "Ginseng is a great energy product and has absolutely NO side effects", "rating": "5"}, {"helpful": 7, "body": "I just started combining this with two Natures Bounty green tea caps each breakfast/dinner. The green tea by itself gives me a nice alertness, different from a caffeine buzz. I find that the ginseng seems to boost this effect even more making me feel more clearheaded...it removes much of the age fog I had become used to. In conversations I'm able to use unusual word choices and respond more quickly with observations than I used to...interesting. NOTE: I find a couple of drinks the night before tends to adds the fog back temporarily, so for max results during the week I try to take these 'clean'.", "title": "Surprisingly good effects", "rating": "5"}, {"helpful": 1, "body": "Nature's Bounty boosts my energy levels better than other products I've tried.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Really effective", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Easy tolerated.", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "great buy thanx", "title": "It's koo", "rating": "5"}, {"helpful": 0, "body": "Great product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "seems alright", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Great stuff!", "title": "Awesome", "rating": "4"}, {"helpful": 0, "body": "Good stuff.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Works well", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Awesome!!", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Great product, Great price..", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Pricey", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Have been using Ginsana and it is expensive.  Nature's Bounty offers a larger bottle for less money.  Ginseng is a great energy product and has absolutely NO side effects.  A great product.", "title": "Ginseng is a great energy product and has absolutely NO side effects", "rating": "5"}, {"helpful": 0, "body": "Great", "title": "Does the job", "rating": "5"}, {"helpful": 2, "body": "very good takes stress away and help on the manhood dep. it works for me", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "very good", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Easy to get, and to swallow, cheaper than CVS or Walgreens.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Tried without jelly. That makes a big difference.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Small box but you get what you pay for", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Meets expectations!  Will buy again!", "title": "Meets expectations!  Will buy again!", "rating": "4"}, {"helpful": 0, "body": "Feeling healthier already.", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "I don’t think this will help me, but thank you. Great Product.", "title": "Great Product.", "rating": "5"}, {"helpful": 5, "body": "This stuff give me energy, but eat with food or it can cause stomach upset", "title": "Works!", "rating": "5"}, {"helpful": 0, "body": "Good price,  received in a couple of days.  Will purchase again.", "title": "Good price, received in a couple of days", "rating": "5"}, {"helpful": 0, "body": "Didn't really notice anything starting or finishing. Worth a try.", "title": "Nothing special...", "rating": "3"}, {"helpful": 0, "body": "Very helpful, i recommend this product.", "title": "i recommend this product", "rating": "5"}, {"helpful": 0, "body": "I have taken this supplement for years, it help build my antibody", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good product, will have to use a while of course to get results !", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Jewel Osco quit stocking it, I found it here. Great product.", "title": "Great product.", "rating": "5"}, {"helpful": 0, "body": "Easy to swallow, tasteless, and energizing.", "title": "Highly recommended.", "rating": "5"}, {"helpful": 0, "body": "I'm a fan of Gensing as I think it helps the libido.", "title": "Libido Helper", "rating": "5"}, {"helpful": 0, "body": "Does what it's supposed to do. Could be in a larger package.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "I love you for everything", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Best price and I really like this product.", "title": "Good Stuff", "rating": "5"}, {"helpful": 0, "body": "Great product, great price, great service!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good deal on Ginseng supplement", "title": "Ginseng ' ed  :)", "rating": "4"}, {"helpful": 0, "body": "Was delivered on time, seems to be helping me.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "great item fast shipping", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Cant tell if it has ant effect.", "title": "Two Stars", "rating": "2"}, {"helpful": 0, "body": "Just Ok", "title": "OK", "rating": "3"}, {"helpful": 0, "body": "Repeat customer.", "title": "Good product", "rating": "5"}, {"helpful": 0, "body": "Ok", "title": "Two Stars", "rating": "2"}, {"helpful": 0, "body": "Does what it's supposed to do. Could be in a larger package.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Jewel Osco quit stocking it, I found it here. Great product.", "title": "Great product.", "rating": "5"}, {"helpful": 2, "body": "The dosage for 2 caps (37 servings per box):", "title": "Decent dosage, consumerlab friendly ginseng complex", "rating": "5"}, {"helpful": 0, "body": "I'm a fan of Gensing as I think it helps the libido.", "title": "Libido Helper", "rating": "5"}, {"helpful": 5, "body": "Ginseng is interesting as a \"nutrrient.\" Royal Jelly aka bee pollen is excellent if you have seasonal allergies. Combined quite beneficial when it finally gets warmer and green.", "title": "When it finally gets warmer and green try this.", "rating": "5"}, {"helpful": 0, "body": "I take these first thing in the morning I take two at a time and I get energy to get the things done", "title": "Energy Improved with These Pills", "rating": "5"}, {"helpful": 1, "body": "Ehh. Gave me some energy but also makes me sick if I don't eat with a lot of food. And 2 pills 3 times a week is too many", "title": "Ehh. Gave me some energy but also makes me ...", "rating": "2"}, {"helpful": 0, "body": "Was delivered on time, seems to be helping me.", "title": "Five Stars", "rating": "5"}, {"helpful": 4, "body": "Very effective. I love it. Definitely will re-purchase it.", "title": "I love it. Definitely will re-purchase it", "rating": "5"}, {"helpful": 0, "body": "Great", "title": "Great", "rating": "5"}, {"helpful": 0, "body": "good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Very good product .", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "good product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good price", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "no  review", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "It's a supplement. Who really knows...", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great buy for our health", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Ginseng is a Booster!", "title": "Good!", "rating": "5"}, {"helpful": 0, "body": "good product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Excellent product.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "arrived on time and as advertised.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "👍", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good", "title": "Four Stars", "rating": "4"}, {"helpful": 2, "body": "I dont feel any different. I eat well, im active, and i felt no different.  It didnt improve or degrade me.  Waste of money.", "title": "Waste of money", "rating": "1"}, {"helpful": 0, "body": "I take these first thing in the morning I take two at a time and I get energy to get the things done", "title": "Energy Improved with These Pills", "rating": "5"}, {"helpful": 7, "body": "I've had ginseng supplements before. This one made me sick. Don't know if I got a bad batch or it they used pseudo ginseng. If your looking for real ginseng, research Wisconsin coops or Wisconsin farms. You will pay more but you will get the real thing.", "title": "Don't know if I got a bad batch or it they used pseudo ginseng", "rating": "1"}, {"helpful": 1, "body": "Ehh. Gave me some energy but also makes me sick if I don't eat with a lot of food. And 2 pills 3 times a week is too many", "title": "Ehh. Gave me some energy but also makes me ...", "rating": "2"}, {"helpful": 0, "body": "Found this same product in our local Bed Bath & Beyond for a little bit less ... it's a good supplement!", "title": "Good Supplement", "rating": "4"}, {"helpful": 0, "body": "These vitamins were honestly the best I have ever taken. I plan and placing these on auto-ship, I love these.", "title": "Great GREAT great!", "rating": "5"}, {"helpful": 0, "body": "Very good product .", "title": "Four Stars", "rating": "4"}, {"helpful": 1, "body": "Great product for energy and losing weight!!", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Doesn't seem like much of a energy booster.", "title": "not worth it for a booster", "rating": "2"}, {"helpful": 0, "body": "Excellent product.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "It really works!", "title": "IT works!", "rating": "5"}, {"helpful": 0, "body": "Repeat customer.", "title": "Good product", "rating": "5"}, {"helpful": 3, "body": "It's amazing how these pills work so well. I never leave my house without drinking one of them.", "title": "Amazing!!!", "rating": "5"}, {"helpful": 0, "body": "good product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good product", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "immune system kick butt", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "immune system kick butt", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Nothing changed", "title": "One Star", "rating": "1"}, {"helpful": 0, "body": "I was disappointed....I went to buy this product again and couldn't believe how much the price increased. I might as well buy it in the store...", "title": "Disappointed", "rating": "5"}, {"helpful": 0, "body": "I did not notice any difference while taking it. maybe I did not take it long enough but to me it's not worth the money", "title": "I did not notice any difference while taking it.", "rating": "3"}, {"helpful": 0, "body": "These capsules are easy to swallow and gentle on the stomach. After taking these capsules I generally get a boost of energy.", "title": "Nature's Bounty Ginseng Complex", "rating": "4"}, {"helpful": 0, "body": "This is good. Help me with keeping my energy levels up when I'm to tired to exercise myself after work. Is not to strong, but good.", "title": "Good", "rating": "4"}, {"helpful": 0, "body": "Something that improves memory, no question about it. Take two a day for a week - and get back to me, lol.", "title": "Something that improves memory, no question about it.", "rating": "5"}, {"helpful": 0, "body": "gives me that little extra kick of energy..would buy again..highly recommend", "title": "Nature's Bounty Ginseng... Nature's Bounty", "rating": "5"}, {"helpful": 7, "body": "I have been taking ginseng for the year and I swear by it. I do not drink coffee or consume much caffeine at all but because of this product I never feel tired during times of the day I used to feel sluggish during when I was a coffee drinker.  I've also had no issues with sexual energy either since beginning to take this and a male energy supplement called Truplayer.", "title": "Priced well, great quality", "rating": "5"}, {"helpful": 0, "body": "Will serve the purpose....!", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "This is good. Help me with keeping my energy levels up when I'm to tired to exercise myself after work. Is not to strong, but good.", "title": "Good", "rating": "4"}, {"helpful": 0, "body": "These capsules are easy to swallow and gentle on the stomach. After taking these capsules I generally get a boost of energy.", "title": "Nature's Bounty Ginseng Complex", "rating": "4"}, {"helpful": 0, "body": "Great for memory.  I have been taking it for yrs.  It takes about 3 wks. to  feel results.  Ask your MD about it.  IT WORKS!", "title": "Great for memory", "rating": "5"}, {"helpful": 0, "body": "I did not notice any difference while taking it. maybe I did not take it long enough but to me it's not worth the money", "title": "I did not notice any difference while taking it.", "rating": "3"}, {"helpful": 0, "body": "These vitamins were honestly the best I have ever taken. I plan and placing these on auto-ship, I love these.", "title": "Great GREAT great!", "rating": "5"}, {"helpful": 0, "body": "good", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Something that improves memory, no question about it. Take two a day for a week - and get back to me, lol.", "title": "Something that improves memory, no question about it.", "rating": "5"}, {"helpful": 0, "body": "Found this same product in our local Bed Bath & Beyond for a little bit less ... it's a good supplement!", "title": "Good Supplement", "rating": "4"}, {"helpful": 3, "body": "Didn't notice any change at all.", "title": "One Star", "rating": "1"}, {"helpful": 0, "body": "Happy with the entire purchase.  Good price, good product, delivered when promised.  Will buy again.", "title": "Happy Customer", "rating": "5"}, {"helpful": 0, "body": "gives me that little extra kick of energy..would buy again..highly recommend", "title": "Nature's Bounty Ginseng... Nature's Bounty", "rating": "5"}, {"helpful": 0, "body": "no noticeable difference for me, may work for others though.", "title": "no difference", "rating": "1"}, {"helpful": 0, "body": "👍", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Great product especially with the royal jelly included, helps to keep energy level up longer.", "title": "Four Stars", "rating": "4"}, {"helpful": 2, "body": "Take these pills as directed at what out this stuff really works. I tried just about everything but nothing works the chinese know something we don't know", "title": "To increase Sexual Stampion", "rating": "5"}, {"helpful": 0, "body": "Will serve the purpose....!", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "blood work great with this", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "works great, my energy is up again", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "I've tried a variety of ginseng. this is OK. No big whop, no complaints. I do like the price.", "title": "I do like the price", "rating": "3"}, {"helpful": 0, "body": "price was right and mailed to my home the best", "title": "Five Stars", "rating": "5"}, {"helpful": 3, "body": "Didn't notice any change at all.", "title": "One Star", "rating": "1"}, {"helpful": 5, "body": "Ginseng is interesting as a \"nutrrient.\" Royal Jelly aka bee pollen is excellent if you have seasonal allergies. Combined quite beneficial when it finally gets warmer and green.", "title": "When it finally gets warmer and green try this.", "rating": "5"}, {"helpful": 6, "body": "This product did absolutely nothing for me except give me a headache.", "title": "One Star", "rating": "1"}, {"helpful": 2, "body": "not working...", "title": "One Star", "rating": "1"}, {"helpful": 0, "body": "Very good product and price. Will purchase again.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product! Great Service!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "it helped a lot when i was feeling tired it would give me the lift i needed, it was best to take in the morning", "title": "it gives you a boost of energy", "rating": "4"}, {"helpful": 1, "body": "I advise you to buy the product, and using for all time because it will enrage your power and healthy.", "title": "good tonic", "rating": "5"}, {"helpful": 2, "body": "The product gives me instant energy I tried many ginseng complex brands in the past none compares to this one", "title": "Great product", "rating": "5"}, {"helpful": 8, "body": "Good price and works well. I use this supplement as an immune booster, all around feel good booster, and to aide in my major digestive problems. It has done wonders for me over the year I have used it. I was on a more potent version but after side effects started creeping in [pressure feeling in my forehead] I decided to get a complex. This seems to have all the right levels of ginsenocides for my needs and it is well priced. Win win if you ask me.", "title": "Great value, great product, can't praise it enough!", "rating": "5"}, {"helpful": 0, "body": "great", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Heck to the yes! Really truely makes me feel calm and collected with a dash of energy. I experimented yesterday with a 24oz coffee....I do not recommend coffee with it (obviously) but just had to see for myself. I'm 23 and I drink a heck of a lot of redbull so I am serious....if you don't have experience with energy supplements and happen to do coffee and ginseng then you are in for a serious shaky jittery scary trip. But I think a cup of coffee won't hurt. I honestly think I'll quit coffee because this stuff is WAYYY better.", "title": "The god of supplements", "rating": "5"}, {"helpful": 0, "body": "This was recommended to me by a friend. I like that the capsules were NOT pork and that I do not get the jitters from it. I would definitely recommend this to others. Just call their  number on the bottle if you want to know what the capsule are made of. Their customer service was great.", "title": "I like this product", "rating": "5"}, {"helpful": 1, "body": "Great product. Good quality, effective, reliable. Overall awesome tonic I feel helps me stay well during times of stress and flu seasons/etc.", "title": "Highly recommend this product for health", "rating": "5"}, {"helpful": 1, "body": "Much better mix than others I have tried. It works with energy as well. Nice to see they put Royal Jelly into as well", "title": "UPDATE its quality of the root has gone down from earlier post", "rating": "3"}, {"helpful": 0, "body": "I found that this gave me energy and helped me. Will continue to use on a daily basis. Recommend it for anyone that needs some", "title": "Love it, will continue to use.", "rating": "5"}, {"helpful": 0, "body": "I an glad I purchased this product. I noticed immediate results. I will continue to use this product. I am very satisfied.", "title": "Great Purchase", "rating": "4"}, {"helpful": 0, "body": "boost my energy level ... so great you should tray this as your daily supplement, to help you in your routine activity.", "title": "good product", "rating": "4"}, {"helpful": 5, "body": "Great product, great price, and this Ginseng has noticeably helped my energy levels when I take it.  2 pills twice a day and I can stay out longer and enjoy things more.", "title": "Noticeably helps energy levels", "rating": "5"}, {"helpful": 0, "body": "Great product.", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Excellent and wonderful", "title": "I love it", "rating": "5"}, {"helpful": 1, "body": "Excelent product!  Thank you Very much! I depend on this product to get through work. It gives me great energy.", "title": "Love it!", "rating": "5"}, {"helpful": 2, "body": "I prefer Nature Made products however this product seems just as good.  It compliments my supplement regimen very well and I would buy it again.", "title": "Good", "rating": "5"}, {"helpful": 0, "body": "Excellent Product at a great price. Arrived fast and in good shape. Comes in gell cap form and releases gently.", "title": "Excellent Quality", "rating": "5"}, {"helpful": 9, "body": "I used to buy this supplement in my local grocery, but they stopped carrying it. Luckily it's Amazon to the rescue and PRIME eligible, no less. It contains three varieties of ginseng along with some royal jelly and Vitamin B-12 and is a superb energy supplement. I work out between 3 and 5 days a week and I take two of these every morning and occasionally 2 more in the afternoon if I need a natural boost. If you combine them with Gincko Biloba and Saint John's Wort, it's like a Power-Up for your brain and body.", "title": "The Best Ginseng Supplement Out There", "rating": "5"}, {"helpful": 2, "body": "The dosage for 2 caps (37 servings per box):", "title": "Decent dosage, consumerlab friendly ginseng complex", "rating": "5"}, {"helpful": 1, "body": "I have been taking for almost two months and have not really noticed a lot of affects.  My energy seems to be better and I have seen an uptick in my libido.", "title": "Nothing special", "rating": "3"}, {"helpful": 2, "body": "I bought these pills to help with my adrenal fatigue. Korean Ginseng is supposed to be one of the best herbs for increasing energy. I would take these pills 1 or 2 times a day. The bottle doesn't last very long especially if you are taking the pills twice a day. This supply lasted me a little less than a month. However, the price is reasonable enough that I think it's worth it. I did notice increased energy & focus while taking these pills. I also like that these capsules are vegetarian since that is important to me. Sometimes vegetarian pills are priced way more than the gelatin, but not with this product. It comes in a glass bottle which I find more appealing than the plastic ones, it seems more medicinal that way. Will definitely repurchase.", "title": "Good price for vegetarian capsules", "rating": "4"}, {"helpful": 0, "body": "Bought this to replace Monster Rehab energy drink lemonade. Calculated was spending approximately  $1400 a year on caffeine. This is an ingredient from the energy drink. Too much or too little caffeine gives me a headache, sometimes want to throw up. With the acid reflux of the past six months, don't need anything adding to my nausea. The first week I noticed nothing positive or negative, thought was useless. Second week seemed I could focus a little more. Third week there's a definite difference,  so much so my boyfriend is starting to wonder if he needs some too. Seems to be online order only, haven't seen this exact brand and dosage in brick and mortar store yet. Purchased several more bottles today. Use for six months, take one month break, then back to it . Hopefully things just keep getting better and better.", "title": "Postive results thus far", "rating": "5"}, {"helpful": 3, "body": "Good quality ginseng, have been taking it for a few months to treat coldness in hands and feet and boost energy levels a bit instead of drinking coffee all day. Seems to work well.", "title": "Helpful yang tonic", "rating": "5"}, {"helpful": 0, "body": "Great Service!  Great Product!  Thanks!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "This is amazing,my grandparents used to go out in the woods down south and dig up the root ,many benefits-check it out", "title": "This is amazing, my grandparents used to go out in the ...", "rating": "5"}, {"helpful": 0, "body": "works good for male libido mainly, don't notice much energy but down there lol.", "title": "good for male performance.", "rating": "4"}, {"helpful": 0, "body": "Good Quality product.", "title": "Very Good", "rating": "5"}, {"helpful": 2, "body": "No side effects to notice and helped keep me awake through the day. Needed vegetarian capsules and this one was quite worth the money.", "title": "Does the job", "rating": "5"}, {"helpful": 0, "body": "Good gave energy boost", "title": "Gave me a good Boost of energy", "rating": "4"}, {"helpful": 0, "body": "Love it", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "great energy", "title": "great", "rating": "5"}, {"helpful": 0, "body": "very good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Awesome!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Love it", "title": "Five Stars", "rating": "5"}, {"helpful": 3, "body": "What is wrong with some of these people writing pointless and meaningless reviews that doesn't even review the product. One not so smart guy said he hasn't tried it yet or just started using it so he gave it a 4 when he hasn't even tried the product or gave it a chance before writing a review!!!. I mean like seriously, what is wrong with you... You never tried it or just started using it so why would you spend your time to write a pointless review saying absolutely nothing besides showing how not smart you are sadly instead of waiting till you actually have something to say about the product. Well I do use the product for over a year and I love it and works great and gives me energy with no side affects and Korean is the best kind. Another not so genius reviewer gave it a 3 because she said \"hard to judge efficiency\" and spelled efficiency wrong just to show how smart she is lol. Hard to believe we share the planet with these people but hopefully they will get smarter and learn to actually write a review on the product.", "title": "peoples pointless unhelpful reviews", "rating": "5"}, {"helpful": 0, "body": "Hard to judge the efficacy.", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "I just recently received this product, so I can't give a full review yet (hence the 4 stars), but I am very satisfied with the vendor.", "title": "Ginseng for memory", "rating": "4"}, {"helpful": 3, "body": "This wonderful for fatigue.  I take 2 capsules twice a day.  When I tried this at first, I notices a difference within 2 weeks.  When I ran out, I became very fatigued so I know it works for me.  Just remember it's not the same as Korean Ginseng, which is more common in stores.", "title": "Great for fatigue", "rating": "5"}, {"helpful": 1, "body": "I am a vitamin freak taking them for 30 years am 75 still go to work every day and have to say now is a great brand", "title": "very good does the job", "rating": "5"}, {"helpful": 7, "body": "This seems to help my mood real well. Get upset at work or tired when things seem to build up.  Just taking one a day let's things not get to you as much.", "title": "Things just don't seem to push your button so easy.", "rating": "5"}, {"helpful": 1, "body": "withing a few days I noticed more mental focus and I was less anxious.", "title": "Recommend it for better focus and less anxiety", "rating": "5"}, {"helpful": 8, "body": "I took two pills of these capsules for a week and find it really helpful especially in terms of offering me more energy. I think the amount of Ginseng contained in each capsule is enough.", "title": "Not too bad! Really effective!", "rating": "5"}, {"helpful": 1, "body": "Now American Ginseng is good stuff. I do however prefer the brand \"Vermont Ginseng\" however this is not available most places. If you do manual labor or athletic activity in heat then this is what you want to help keep your cool. I use it every summer during harvest to keep me healthy and happy. :)", "title": "Good Stuff", "rating": "5"}, {"helpful": 2, "body": "I have found this product to be quite helpful in restoring my energy level while battling cancer.  After taking NOW's American Finding for 4 weeks I felt an increase in my energy level.", "title": "Boosted my lagging energy level.", "rating": "5"}, {"helpful": 5, "body": "This was recommended by my oncologist 6 mos post chemo and 4 mos post radiation for fatigue. I think it is helping.", "title": "This was recommended by my oncologist 6 mos post chemo and 4 ...", "rating": "5"}, {"helpful": 3, "body": "Makes a difference for me and my fatigue.  Does not make me hyper as can other non-American Ginseng.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product; as advertised.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product; as advertised.", "title": "Five Stars", "rating": "5"}, {"helpful": 2, "body": "Keeps me running on my usual 4 hrs sleep a day.  Not sure how I'd do without them!", "title": "Great quality Ginseng!", "rating": "5"}, {"helpful": 1, "body": "Now I feel energetic for study all the day till late night, great product!", "title": "Did enhance my strenth", "rating": "5"}, {"helpful": 1, "body": "I am taking this to get some more energy in my life. A good product, and worth the money. Going to need more soon, will be back to order.", "title": "Good Ginseng", "rating": "5"}, {"helpful": 1, "body": "Great product. Fast shipping.", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Good quality supplements", "title": "Five Stars", "rating": "5"}, {"helpful": 2, "body": "I've been using this for almost a year to help combat the fatigue of  chemo. It seems to help.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "My dad had been taking these, so I decided to give them a try. Unfortunately, I didn't see an increase in my energy level that I was hoping for. I've run out, and not reordered yet. May or may not.", "title": "What's the point?", "rating": "3"}, {"helpful": 1, "body": "Work great.", "title": "Okay", "rating": "5"}, {"helpful": 1, "body": "I've been using these for a while now and do seem to feel better.", "title": "Good supplement", "rating": "5"}, {"helpful": 2, "body": "seems to work well in a low one or 2 caps a day dose. I am changing the 4 to 5 stars. gradually increased dosage to four caps daily and am completely unfogged and functioning. wow. criticism of this product indicating that Korean ginseng is better is so mistaken. American ginseng(avoid extracts- it's too complex to unbalance it) is well known not to cause blood pressure spikes like oriental ginseng.", "title": "definately makes me more energetic and focused", "rating": "5"}, {"helpful": 1, "body": "seems ok. caps are easy and i believe in ginsengs affects after a few years of observation in asia (unlike most of the laboratory supplements, NONE of which these armies of entire-life-\"malnourished\", simple-exercising, 80/90+ year olds consumed). cooling compared to  korean ginseng, and better living in hot climate. but no way to know purity/ content really. emailed the company and they said should be at least 1% minimum ginsenoside content but no guarantee. dont know if this is made from potent root hairs or just whole root or what. DSHEA only requires saying [Root] and NOW is not benevolent enough to specify. could just be filled with rice flour for all we know, and some reports show that is actually the case. bottle says 2caps daily @1g, but chinese medicine traditionally uses at least 3g, up to 10g daily for any effect. cheap enough for just a minimal daily dose for probable minimal health benefit though. nice they finally actually use cellulose capsule instead of the worst legacy garbage Beef Gelatin, when most modern nations dont sell unhealthy laboratorized US beef product, and/or their public wont accept it. Gelatin simply cannot be accepted in any product that claims to be \"healthy\". These caps also contain Stearates (Magnesium), a risky hydrogenated-fat filler that is added only to coat powders in order to keep manufacturing machinery running at high speed. being evidenced as toxic and does decrease absorption of the product ingredient you pay for, up to 80%. Immunosuppressive likely as well. no surprise coming from laboratory ingredients duh. Stearates should also not be accepted as ingredients in foods, let alone supposedly \"healthy\" supplements. realize that all these claimed healthy supplement companies, who put *unnecessary Stearates or similar in their products, care more about a little increased output than they do about YOUR health. support products/ companies/ PEOPLE that dont use these fillers.", "title": "seems ok, if compared to all the other crap supplements. really its just the cheapest bottle with the right words & colors on it", "rating": "2"}, {"helpful": 2, "body": "Well I started with 2 every morning, now I'm taking 4 every morning.  I'll probably try 6/morning in a few days and if I still can't tell the difference I will be forced to yell \"shenanigans\".  I'll probably try a different brand or the real Korean stuff.", "title": "soooo tiirreeeedddddd I took 8 this morning btw", "rating": "1"}, {"helpful": 4, "body": "This is my second order/  I do feel it gives me more energy! I can GO, GO, GO AGAIN!  This is a lot cheaper than local health food stores.I have it on subscribe and save now. Saves even more!", "title": "This is my second order/ I do feel it gives ...", "rating": "5"}, {"helpful": 4, "body": "I could feel the extra energy from the first time I used it. I was also getting this feeling like nerves are twitching in my head which is sometimes a result of neurons  miss firing, I was able to get rid of this feeling by reducing the dose to only 2 a day. I will try to up the dose again to 4 in a couple of weeks.", "title": "I could feel the extra energy from the first time I used it", "rating": "4"}, {"helpful": 2, "body": "I've been using this for almost a year to help combat the fatigue of  chemo. It seems to help.", "title": "Five Stars", "rating": "5"}, {"helpful": 4, "body": "Tried it for a while. Saw no difference at all. Maybe it helps others but I won't restock this again.", "title": "No difference", "rating": "3"}, {"helpful": 2, "body": "Keeps me running on my usual 4 hrs sleep a day.  Not sure how I'd do without them!", "title": "Great quality Ginseng!", "rating": "5"}, {"helpful": 6, "body": "been taking Wisconsin Ginseng since the 1970's and swear by it as an aid to good health == I'm  81.6", "title": "... 1970's and swear by it as an aid to good health == I'm 81", "rating": "5"}, {"helpful": 4, "body": "I have been using ginseng for years. I first started using it while working in China. Now I am using American ginseng as it is a milder version. I am a 70 yr old grandmother and it is a great boost in the morning.", "title": "I am a 70 yr old grandmother and it is a great boost in the morning", "rating": "5"}, {"helpful": 0, "body": "I could not feel any difference in my energy level when taking these.", "title": "Two Stars", "rating": "2"}, {"helpful": 0, "body": "I take one everyday and feel good!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "great product", "title": "great", "rating": "5"}, {"helpful": 0, "body": "Great product, A+++", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good energy from these 1 cap lasts all day! A great price for a great brand", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Good", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "AAA", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "It really works.", "title": "excellent", "rating": "5"}, {"helpful": 0, "body": "Nothing bad to report but I didn't really notice any difference.", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Second time I've purchased this on here.  Love it", "title": "Love!", "rating": "5"}, {"helpful": 1, "body": "Good quality supplements", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "having a shortage of ginseng over the past few months [china glut] I decided to go online. now foods has great prices and quantity. fast fast shipping was awesome thanx a bunch.", "title": "need my ginseng", "rating": "5"}, {"helpful": 1, "body": "Very good product!", "title": "Four Stars", "rating": "4"}, {"helpful": 2, "body": "Fast shipment. Felt a boost of energy after starting to take 2-3 capsules per day.", "title": "Energy Booster", "rating": "5"}, {"helpful": 2, "body": "GREAT TRANSACTION.....FAST SHIPPING......A+A+A+......THANKS!!!!!!", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Work great.", "title": "Okay", "rating": "5"}, {"helpful": 0, "body": "good energy from these 1 cap lasts all day! A great price for a great brand", "title": "Four Stars", "rating": "4"}, {"helpful": 1, "body": "good deal", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great quality, price and product. Came as seen in picture. Very pleased.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "I could not feel any difference in my energy level when taking these.", "title": "Two Stars", "rating": "2"}, {"helpful": 0, "body": "Definitely helps on tough days! Like a cup of coffee in a capsule.", "title": "Great For Energy!", "rating": "5"}, {"helpful": 0, "body": "Nothing bad to report but I didn't really notice any difference.", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "I love the fact that it is American Ginseng...maybe grown in WI", "title": "Great product!!!", "rating": "5"}, {"helpful": 0, "body": "Dr. Weil recommends the Wisconsin Ginseng.  So I bought this.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Recommended for energy by my physician and it was perfect!", "title": "Exactly what the doctor ordered", "rating": "5"}, {"helpful": 2, "body": "Still mnot sure how good it works.", "title": "Three Stars", "rating": "3"}, {"helpful": 3, "body": "I have been using American ginseng for about 20 years it is the Best. I hardly ever get sick with colds like when I was younger  I am 62 now and swear by this product, Make sure it is American not Korean Ginseng, This site is the cheapest I have Found.", "title": "... American ginseng for about 20 years it is the Best. I hardly ever get sick with colds like ...", "rating": "5"}, {"helpful": 0, "body": "Second time I've purchased this on here.  Love it", "title": "Love!", "rating": "5"}, {"helpful": 2, "body": "Really ups you energy level.", "title": "Four Stars", "rating": "4"}, {"helpful": 1, "body": "Great", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Really works to give you energy every day.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Very good product.  My families love it!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "I take one everyday and feel good!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Seems to add energy to my life.", "title": "Seems to help energy", "rating": "5"}, {"helpful": 1, "body": "Just got it today and already being asked to review? Well, fast shipping and good price. The quality or does it help my health? Time will tell.", "title": "fast shipping and good price. The quality or does it help my ...", "rating": "3"}, {"helpful": 1, "body": "This is a great supplement to take as an additive for any energy supplement you are using. Any natural herb over a pharmacy made supplement I would reccomend. The price is reasonable too if you understood the overhead cost it is to grow ginseng in the United States.", "title": "Great energy supplement add on.", "rating": "5"}, {"helpful": 0, "body": "Seems to be working fine.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good stuff. quick service", "title": "Four Stars", "rating": "4"}, {"helpful": 1, "body": "This is a great product. I take them every day and make sure I never run out. I can tell a real difference.", "title": "Great product.", "rating": "5"}, {"helpful": 1, "body": "Product is great. Works well. Happy to find this at this price.  Would be happy to purchase this item again", "title": "Fast shipping", "rating": "5"}, {"helpful": 1, "body": "Just got it today and already being asked to review? Well, fast shipping and good price. The quality or does it help my health? Time will tell.", "title": "fast shipping and good price. The quality or does it help my ...", "rating": "3"}, {"helpful": 1, "body": "Does absolutely nothing", "title": "One Star", "rating": "1"}, {"helpful": 2, "body": "Still mnot sure how good it works.", "title": "Three Stars", "rating": "3"}, {"helpful": 2, "body": "We bought these to bring back to China for my father to give out as gifts. They are good gift items for Chinese. Arrived quickly without problem.", "title": "good product", "rating": "5"}, {"helpful": 1, "body": "Didn't notice a difference, but not many supplements work on me so may not be the brand.", "title": "Didn't notice anything.", "rating": "3"}, {"helpful": 1, "body": "This is a great product. I take them every day and make sure I never run out. I can tell a real difference.", "title": "Great product.", "rating": "5"}, {"helpful": 2, "body": "Really ups you energy level.", "title": "Four Stars", "rating": "4"}, {"helpful": 1, "body": "Has no effect whatsoever.", "title": "One Star", "rating": "1"}, {"helpful": 1, "body": "Long-term use, have the effect.Spirit a lot better", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Product is great. Works well. Happy to find this at this price.  Would be happy to purchase this item again", "title": "Fast shipping", "rating": "5"}, {"helpful": 1, "body": "excellent quality!", "title": "Five Stars", "rating": "5"}, {"helpful": 4, "body": "I could feel the extra energy from the first time I used it. I was also getting this feeling like nerves are twitching in my head which is sometimes a result of neurons  miss firing, I was able to get rid of this feeling by reducing the dose to only 2 a day. I will try to up the dose again to 4 in a couple of weeks.", "title": "I could feel the extra energy from the first time I used it", "rating": "4"}, {"helpful": 1, "body": "Great products!  Great supplier", "title": "Great products", "rating": "5"}, {"helpful": 0, "body": "seems to work, I use it with other supplements and I receive the desired effect / benefits I'm expecting - but not sure of it by its self.", "title": "easy to consume AM ginseng", "rating": "4"}, {"helpful": 1, "body": "good stuff", "title": "good", "rating": "5"}, {"helpful": 2, "body": "Well I started with 2 every morning, now I'm taking 4 every morning.  I'll probably try 6/morning in a few days and if I still can't tell the difference I will be forced to yell \"shenanigans\".  I'll probably try a different brand or the real Korean stuff.", "title": "soooo tiirreeeedddddd I took 8 this morning btw", "rating": "1"}, {"helpful": 0, "body": "Works great with fine details - there is a learning curve, but that's true of anything.", "title": "Helps me with memory and energy", "rating": "5"}, {"helpful": 1, "body": "Great for energy", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Does the job, but be careful if you have high blood pressure.  It can effect it.", "title": "Good Stuff!", "rating": "4"}, {"helpful": 0, "body": "TAKE IT DAILY FEEL GREAT, SHARP, ON THE TOP OF MY GAME, MENTALLY PHYSICALLY", "title": "NOW Foods American Ginseng, 100 Capsules, 500...", "rating": "5"}, {"helpful": 0, "body": "just average, if that", "title": "nah", "rating": "2"}, {"helpful": 6, "body": "been taking Wisconsin Ginseng since the 1970's and swear by it as an aid to good health == I'm  81.6", "title": "... 1970's and swear by it as an aid to good health == I'm 81", "rating": "5"}, {"helpful": 0, "body": "Top shelf quality at a bargain price", "title": "Top notch quality", "rating": "5"}, {"helpful": 0, "body": "looks good but not see the real reaction yet....", "title": "Four Stars", "rating": "4"}, {"helpful": 4, "body": "I have been using ginseng for years. I first started using it while working in China. Now I am using American ginseng as it is a milder version. I am a 70 yr old grandmother and it is a great boost in the morning.", "title": "I am a 70 yr old grandmother and it is a great boost in the morning", "rating": "5"}, {"helpful": 0, "body": "great value for the price.", "title": "Great value", "rating": "5"}, {"helpful": 0, "body": "Good product. Energizer!", "title": "Good product!", "rating": "5"}, {"helpful": 0, "body": "Excellent adaptogen for adrenal support", "title": "Effective", "rating": "5"}, {"helpful": 0, "body": "Helped with my nausea..", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "ok", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "Good product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Looks good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great,my friend love it.", "title": "Great, my friend love it", "rating": "5"}, {"helpful": 0, "body": "It's Okay.", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Good value", "title": "Good value", "rating": "5"}, {"helpful": 0, "body": "Very good.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great price online", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "great product!!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "It's very good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "great so far", "title": "Five Stars", "rating": "5"}, {"helpful": 4, "body": "This is a good slow burn, sustaining force that I take in the morning with breakfast. Then I add one more in the afternoon. Good stuff.", "title": "Good energy. Good Price.", "rating": "4"}, {"helpful": 1, "body": "ConsumerLabs found only 59.4% of expected minimum stated product. This product was NOT approved. I will look elsewhere.", "title": "FAILED TESTING BY CONSUMER LABS!", "rating": "1"}, {"helpful": 2, "body": "Recommended by my husbands oncologist for his energy level. We are both taking it, hard to tell for sure how well it works but we ran out for a week and were both more tired during that time.", "title": "Doctor recommended for energy levels.", "rating": "4"}, {"helpful": 1, "body": "This is a great supplement to take as an additive for any energy supplement you are using. Any natural herb over a pharmacy made supplement I would reccomend. The price is reasonable too if you understood the overhead cost it is to grow ginseng in the United States.", "title": "Great energy supplement add on.", "rating": "5"}, {"helpful": 1, "body": "The real bottle size received is much smaller than the image picture and also the seal of bottle had been teared when received.", "title": "I would recommend modified the image that try to make closer the ...", "rating": "3"}, {"helpful": 2, "body": "I purchased this to help my daughter with her autism symptoms, and praise God, it really works.", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "I love this product! It gives me so much energy during the day and helps decrease my appetite! I have energy to work out and get everything I need to do done during the day! It's wonderful!", "title": "Great energy booster!", "rating": "5"}, {"helpful": 1, "body": "Hard to review any supplement. I hope there are benefits but I'm not sure. If I have to  buy a cape for the role of super hero, I'll come back and add to my review.", "title": "Hard to review supplemnts. We hope they are helping us in some subtle way", "rating": "3"}, {"helpful": 1, "body": "If this doesn't help my male fertility, I'm going to feed it to my goldfish and see if they have any better chance.", "title": "Ginseng pills, what can I say?", "rating": "4"}, {"helpful": 3, "body": "I have been using American ginseng for about 20 years it is the Best. I hardly ever get sick with colds like when I was younger  I am 62 now and swear by this product, Make sure it is American not Korean Ginseng, This site is the cheapest I have Found.", "title": "... American ginseng for about 20 years it is the Best. I hardly ever get sick with colds like ...", "rating": "5"}, {"helpful": 0, "body": "Thank you for a positive and professional buying experience!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good price, and speedy processing and shipping. Thanks!", "title": "A+ Seller", "rating": "5"}, {"helpful": 0, "body": "Great stuff. And a lot cheaper than energy drinks and lasts longer.", "title": "Better than energy drinks", "rating": "5"}, {"helpful": 0, "body": "seem good,good deal", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "very good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great supplement.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "wow like now", "title": "fast", "rating": "5"}, {"helpful": 0, "body": "Great", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "have no effect.", "title": "One Star", "rating": "1"}, {"helpful": 0, "body": "Terrific", "title": "Terrific", "rating": "5"}, {"helpful": 0, "body": "Good ginseng, from what I can tell.  I think it's a good idea to take several times a day to start.  Saved my day today, as I went to check the oil on my Kubota GR2120 tractor and found the cooling system overflow cap was missing.  The cap from the ginseng fits, though, so with a tiny hole in it and keeping a close eye on it, I can cut grass today while I wait for my replacement cap ($3 part $8 shipping) to get here, which probably won't be until Monday.  (Today is Thurs.)", "title": "It Works.", "rating": "4"}, {"helpful": 1, "body": "It tastes fresh.  Now customer service told me that as of Dec 2015 this ginseng is cultivated in China, and is analyzed to contain not less than 1.5% ginsenosides.  1.5% is on the low end of the spectrum, and they should demand a higher minimum standard, although for the price it is about right even if they only contain the minimum.", "title": "It tastes fresh. Now customer service told me that ...", "rating": "4"}, {"helpful": 1, "body": "This product works great, these are more than satisfactory,very happy with them,this is a great buy,thank you very much. buy one!!!", "title": "This product works great,", "rating": "5"}, {"helpful": 1, "body": "seems ok. caps are easy and i believe in ginsengs affects after a few years of observation in asia (unlike most of the laboratory supplements, NONE of which these armies of entire-life-\"malnourished\", simple-exercising, 80/90+ year olds consumed). cooling compared to  korean ginseng, and better living in hot climate. but no way to know purity/ content really. emailed the company and they said should be at least 1% minimum ginsenoside content but no guarantee. dont know if this is made from potent root hairs or just whole root or what. DSHEA only requires saying [Root] and NOW is not benevolent enough to specify. could just be filled with rice flour for all we know, and some reports show that is actually the case. bottle says 2caps daily @1g, but chinese medicine traditionally uses at least 3g, up to 10g daily for any effect. cheap enough for just a minimal daily dose for probable minimal health benefit though. nice they finally actually use cellulose capsule instead of the worst legacy garbage Beef Gelatin, when most modern nations dont sell unhealthy laboratorized US beef product, and/or their public wont accept it. Gelatin simply cannot be accepted in any product that claims to be \"healthy\". These caps also contain Stearates (Magnesium), a risky hydrogenated-fat filler that is added only to coat powders in order to keep manufacturing machinery running at high speed. being evidenced as toxic and does decrease absorption of the product ingredient you pay for, up to 80%. Immunosuppressive likely as well. no surprise coming from laboratory ingredients duh. Stearates should also not be accepted as ingredients in foods, let alone supposedly \"healthy\" supplements. realize that all these claimed healthy supplement companies, who put *unnecessary Stearates or similar in their products, care more about a little increased output than they do about YOUR health. support products/ companies/ PEOPLE that dont use these fillers.", "title": "seems ok, if compared to all the other crap supplements. really its just the cheapest bottle with the right words & colors on it", "rating": "2"}, {"helpful": 0, "body": "Not impressive.", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "Wonderful!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "gppd", "title": "Three Stars", "rating": "3"}, {"helpful": 4, "body": "Let's see, the bottle says \"500 mg,\" and \"100 veg capsules\"--so you're getting 100 capsules of 500 mg each, right?", "title": "250 mg capsules, not 500", "rating": "1"}, {"helpful": 1, "body": "This important essential Korean red ginseng did not fortify the necessary six year term of cultivation and aging. Essential to the efficacy of Korean red ginseng. Upon taking this product to a lab in Brooklyn New York. Upon investigation. Each capsule out of thirty one tested only contained 4.614% of actual Korean red Ginseng. 3.738% of the actual product ( KOREAN RED GINSENG ) is Chinese ginseng. Amazon. Please inform your clientele. That all Panax ginseng ( KOREAN RED GINSENG ) MUST be processed and aged for a term of no less than six years. There were also synthetic fillers in the product capsules that are contrary to labeling.", "title": "Best regards, Larry", "rating": "1"}, {"helpful": 3, "body": "I bought these because Aurigin ginseng is so expensive. But I opened a capsule and the powder has no smell and almost no flavor. It tasted like flour. I doubt it contains much, if any ginseng. Aurigin has a very strong taste and smell like ginseng root I've sampled in Chinatown, SF.", "title": "Tastes like flour, not ginseng", "rating": "1"}, {"helpful": 1, "body": "I have been using it for more than a year. I never believed in this sort herbal meds being effective. I have been proven wrong. It really does help me with my sex life. It has really made an impact. Anyone thinking about it should try it out. You will be surprised.", "title": "Really good product! You should try it!", "rating": "5"}, {"helpful": 3, "body": "Great product I already order another bottle. Price is right! I have energy! Aaaaaaawwwww!!! No shakes like other brands I have tried. Fast delivery. Will tell friends & continue to order as long as this product is in stock very pleased.", "title": "Ginseng MaMa", "rating": "5"}, {"helpful": 1, "body": "I have been using these for over a month now and I have found them to work really well. I used them primarily as a mood enhancer due to the high levels of stress I had. I feel like most of the stress I had has dissipated since I have been on them. I would recommend these to anyone who is looking for something that may help them with stress and trying to get in a better mood.", "title": "I feel like most of the stress I had has dissipated since ...", "rating": "4"}, {"helpful": 0, "body": "Gives me heartburn, don't like this at all. Disappointed considering other Swanson products that are very good.", "title": "Heartburn, gross.", "rating": "1"}, {"helpful": 4, "body": "Have been taking them for 2 weeks now, and do not feel any difference.  Disappointed", "title": "Disappointed", "rating": "2"}, {"helpful": 0, "body": "started feeling the result in 2 days.  Was suffering from lack of concentration and this helped a lot", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Well tolerated", "title": "Five Stars", "rating": "5"}, {"helpful": 4, "body": "It's OK but didn't give the boost I was expecting, most likely won't buy again.", "title": "Just OK", "rating": "3"}, {"helpful": 5, "body": "I have been dealing with some ED issues for the past year or so. I have tried many of the male enhancement products that claim things that are simply to good to be true, and in the end this is almost always the case.", "title": "Helps with ED", "rating": "5"}, {"helpful": 4, "body": "Ginseng helps boost blood flow. Take it like the bottle says and it will easily boost both male and female libido. It doesn't actually make your horny, but your parts just get better blood flow and therefore react like you're a teenager again. The slightest brush of an article of clothing and you're aroused like when you were 15. For males, also dramatically decreases your \"refractory period\", the time between climax and being ready for intercourse again. In fact it damn near eliminates it completely.", "title": "Say goodbye to your refractory period", "rating": "5"}, {"helpful": 3, "body": "I bought these because Aurigin ginseng is so expensive. But I opened a capsule and the powder has no smell and almost no flavor. It tasted like flour. I doubt it contains much, if any ginseng. Aurigin has a very strong taste and smell like ginseng root I've sampled in Chinatown, SF.", "title": "Tastes like flour, not ginseng", "rating": "1"}, {"helpful": 8, "body": "Wow looks to be expired....the printed sticker was dated to expire 12/16....but after tearing the sticker back I can make out a date of 12/14....shady", "title": "expired....", "rating": "1"}, {"helpful": 2, "body": "It was expired!!! They pasted a tag in the expire date place, and try to overlap that date. I bought it in 2014, but it was expired in 2013.  They are cheating!!!", "title": "It was expired!!! They pasted a tag ...", "rating": "1"}, {"helpful": 3, "body": "Great product I already order another bottle. Price is right! I have energy! Aaaaaaawwwww!!! No shakes like other brands I have tried. Fast delivery. Will tell friends & continue to order as long as this product is in stock very pleased.", "title": "Ginseng MaMa", "rating": "5"}, {"helpful": 0, "body": "Swanson is a company I buy from semi-regularly and this product does not disappoint...price point was a big draw for sure...this Korean Red provides a nice, all-natural energy boost and also provides some extra sexual boost due to the increased healthy blood flow...very satisfied", "title": "An Excellent Product", "rating": "5"}, {"helpful": 1, "body": "Gives you energy and vitality and really works. make sure you take it after a meal. Go for it and do not think twice!!", "title": "Awesome Product!", "rating": "5"}, {"helpful": 4, "body": "Have been taking them for 2 weeks now, and do not feel any difference.  Disappointed", "title": "Disappointed", "rating": "2"}, {"helpful": 2, "body": "Squee... Great supplement to my daily vitamin regime. I use it to increase libido. It works Awesome! I do take a few other things as well but this is one that I can feel the difference immediately. It also helps with my energy level.", "title": "I love swanson products!", "rating": "5"}, {"helpful": 0, "body": "Hey, it actually works. Went in as a skeptic and tested it without any expsctations. I could tell a difference and where it counts.  Drink plenty of water.", "title": "Pretty good stuff", "rating": "5"}, {"helpful": 0, "body": "Very happy with this product. For me it really helps. Glad I was able to find a quality product online that was affordable and worked since this is very hard to find in a store anymore.", "title": "Very happy with this product", "rating": "5"}, {"helpful": 1, "body": "It does seem to increase blood flow and also seems to affect in a good way the kidneys. I haven't noticed any unpleasant side-effects. Web reviews support the use.", "title": "Has good benefits to the body", "rating": "4"}, {"helpful": 1, "body": "I take 2 each morning, along with cordyceps and rhodiola - for energy. Since I had several surgeries, I've had a problem with energy - this pretty much fixes it for me.", "title": "Great for energy - Full Spectrum Korean Red Ginseng Root", "rating": "5"}, {"helpful": 2, "body": "Love this item makes my man want to give me the best organism.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "This Ginseng from Swanson works! It always vets me a little spike of energy that I need especially when I'm getting ready to ride my treadmill. The Swanson Brand never disappoints!", "title": "It's good enough for me!", "rating": "5"}, {"helpful": 1, "body": "Getting difficult to find Ginseng in my local stores.  The item seems to be good quality and a very good price.", "title": "Ginseng is becoming difficult to locate.", "rating": "5"}, {"helpful": 1, "body": "This product is terrible!!! Please be careful. I took it and my eyes got red the next morning.", "title": "One Star", "rating": "1"}, {"helpful": 0, "body": "I take this daily and I really notice when I miss a dose. The price here is fantastic.", "title": "The price here is fantastic.", "rating": "5"}, {"helpful": 0, "body": "I took these as prescribed on the bottle but have seen no changes~ (sad face)", "title": "Two Stars", "rating": "2"}, {"helpful": 0, "body": "This ginseng is fantastic for focus! I use it on my long college study nights and with a cup of caffeine, i always stay awake and focused. ​", "title": "This ginseng is fantastic for focus", "rating": "5"}, {"helpful": 0, "body": "These make me sick to my stomach. Not for me, I guess.", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "I have been taking Ginseng for many years and I feel that it does give me the energy I am looking for.", "title": "Swanson Premium Full-Spectrum Korean Red Ginseng Root", "rating": "5"}, {"helpful": 0, "body": "Ihave ordered these for a year. The service is great and the product is excellent.", "title": "Good service and product", "rating": "4"}, {"helpful": 0, "body": "Helps give me more energy.  I would not be without this.  Great price too.", "title": "Get some.", "rating": "4"}, {"helpful": 3, "body": "Okay, theres quite a few bad reviews about the \"expiration date\". Let's clear this up. I just recieved my order on 9/17/2015. The bottle has a Manufacture date on it of 3/15. There is a sticker that covers this manufacture date. The sticker says \" Use by 3/1/2017.", "title": "Not an Expired Product.", "rating": "5"}, {"helpful": 0, "body": "I though it would work better than this, it does not", "title": "Two Stars", "rating": "2"}, {"helpful": 1, "body": "amazing stuff, works the best,did research read the reviews,this is legit", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Have been seeing some results on using. Not totally sure but will keep on buying.", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "purchased for someone else  so far so good", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "I wish I could say I feel different on the supplements I order so I could state what it is doing but I am on several supplements and though doing better, not sure if it is one or a combination of things I'm taking. I was happy to find this product for the price too though. I will reorder.", "title": "... but I am on several supplements and though doing better, not sure if it is one or a ...", "rating": "4"}, {"helpful": 1, "body": "I was surprised by how much to Ginseng improved my mood.  I only take it every four days, since I am on a four day rotation diet.  I suffered from depression most of my life, so feeling good is great.", "title": "Highly recommend!!!", "rating": "5"}, {"helpful": 8, "body": "I had high expectations for red ginseng after my research. I did read that people are either red or white ginseng takers based on their body chemistry. Well....I am a white ginseng person!  The red is just too much for me. I naturally have a lot of energy, and the red makes me jittery. The white on the other hand.....is just perfect for me. I notice a nice energy boost and a better sense of well being with just 100 mg of panax white ginseng per day. (taken with lunch)  This is not a knock on Swanson products, because they consistently manufacture great products. The red ginseng is for people that really need a boost in their day, with slower metabolisms, If that is you.....give it a try.....GT:)", "title": "Too Much For Me", "rating": "2"}, {"helpful": 2, "body": "Love this item makes my man want to give me the best organism.", "title": "Five Stars", "rating": "5"}, {"helpful": 7, "body": "I believed all the hype and reviews online as far as increased libido and increased energy. I have been using this product", "title": "So far does not work at all", "rating": "1"}, {"helpful": 6, "body": "Shipping was fast, and I like the product as well.", "title": "Impressed!", "rating": "5"}, {"helpful": 4, "body": "I can tell the difference when I take it or when it is wearing off.  I take one in the morning and one in mid-afternoon.  It gives me a sense of well being and a more \"do it now\" frame of mind.", "title": "I like the effects", "rating": "5"}, {"helpful": 2, "body": "I noticed absolutely no difference of any kind. After some browsing on the subject, i found that actual ginseng should not this cheap. I recommend that you beware, since this market is not regulated in any way.", "title": "Probably not the real deal.", "rating": "1"}, {"helpful": 0, "body": "Both in flavor and nutritional value this Ginseng seems more like the regular old stuff, not red korean panax.  I have no proof of where it was harvested, only my experience and having used many Ginseng extracts and capsules.", "title": "Seems more like regular old Ginseng.", "rating": "2"}, {"helpful": 1, "body": "I've only been on this a week, and am taking a low dose since I have certain medical issues. I haven't really noticed a difference in anything that this was supposed to help with, but that could be because I'm taking a low dose (1 capsule a day)", "title": "No news is good news.", "rating": "4"}, {"helpful": 0, "body": "Didn't experience any more energy with this product than without.", "title": "no energy", "rating": "2"}, {"helpful": 0, "body": "I normally don't write reviews however this product is great! It's only been 1 day and I've noticed a difference. Happy girlfriend right here ;).", "title": "I normally don't write reviews however this product is great! It's only been 1 day and I've noticed ...", "rating": "5"}, {"helpful": 0, "body": "Like others, I received an item that was well outside its best before date, which was hidden by a third-party barcode sticker. Expired 01/15.", "title": "Be cautious", "rating": "1"}, {"helpful": 0, "body": "No difference at all", "title": "One Star", "rating": "1"}, {"helpful": 0, "body": "Love this", "title": "Works good!", "rating": "5"}, {"helpful": 1, "body": "I will definitely reorder.  The key is the 400 mg.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "so far so good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Top quality product", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "not really sure it works. going to shop around for a better product.", "title": "ehh", "rating": "3"}, {"helpful": 1, "body": "They did nothing for me after taking them for a month.", "title": "One Star", "rating": "1"}, {"helpful": 0, "body": "Love this stuff! Works better than other brands I've been using.", "title": "Works better", "rating": "5"}, {"helpful": 0, "body": "Just received it.  Thank you!", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "This is a gr8 adrenal stress combatant - I recommend it to all adults", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "very nice", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Really works", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Excellent product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "thanks", "title": "Three Stars", "rating": "3"}, {"helpful": 1, "body": "Didn't help", "title": "Didn't help", "rating": "2"}, {"helpful": 0, "body": "Keeps me feeling level all through the day . Takes the edge off my stressful job running my own business .", "title": "Keeps me feeling level all through the day. Takes ...", "rating": "5"}, {"helpful": 0, "body": "Ok but it didn't do anything for me.", "title": "Don't waste your money.", "rating": "3"}, {"helpful": 1, "body": "Have been seeing some results on using. Not totally sure but will keep on buying.", "title": "Four Stars", "rating": "4"}, {"helpful": 1, "body": "Good quality ginseng, I feel it gives me energy. Good product, good brand.", "title": "Four Stars", "rating": "4"}, {"helpful": 1, "body": "amazing stuff, works the best,did research read the reviews,this is legit", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "I wanted to buy a Korean Red Ginseng Root product and this one was really cheap so I choose this product. I have no complaint, no side effects of anything but I can't feel any difference when taking this supplement. I don't know if that's just how ginseng root is or if it's just because this specific idea is cheap and inneffective", "title": "I wanted to buy a Korean Red Ginseng Root product ...", "rating": "3"}, {"helpful": 1, "body": "My husband began using these last year.  He stopped a couple of months ago when he ran out thinking maybe they weren't helping that much,  He finally began realizing he had been losing the energy he'd had and knew his improved circulatory function was lessening.  He had me order more and started a few days ago and said he immediately felt the difference.  These Korean Red Ginseng Root caps will be on our \"reorder\" list from now on.", "title": "Seems to Work", "rating": "5"}, {"helpful": 1, "body": "not really sure it works. going to shop around for a better product.", "title": "ehh", "rating": "3"}, {"helpful": 1, "body": "Noticeable energy & libido boost.  Cannot take close to bedtime.", "title": "Noticeable energy boost.", "rating": "5"}, {"helpful": 1, "body": "Noticed a substantial increase in libido within about 3-4 days, which is great for everyone involved. :D Also seems to give a longer, \"smoother\" energy curve than other things I've tried previously.", "title": "Use it daily.", "rating": "5"}, {"helpful": 2, "body": "I liked this ginseng. It was a great supplement. It had 90 capsules, and I took it over the last three months.", "title": "Great energizer and great supplement", "rating": "5"}, {"helpful": 1, "body": "Ginseng helps boost blood flow. Take it like the bottle says and it will easily help with helping me feel less cold in the extremities.  This dosage of this is just perfect amount, well order from this company again.", "title": "What I needed.", "rating": "5"}, {"helpful": 0, "body": "it's a pill, get over yourself", "title": "fine", "rating": "4"}, {"helpful": 1, "body": "No noticeable results", "title": "Two Stars", "rating": "2"}, {"helpful": 0, "body": "It's okey.", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "Works well you have to take it for a wild to get a build up in your system also helps with energy levels", "title": "Works well you have to take it for a wild ...", "rating": "4"}, {"helpful": 0, "body": "I was hoping it would work ...took it for 3 weeks and never felt any difference..disappointed 😟👎", "title": "disappointed 😟👎", "rating": "1"}, {"helpful": 0, "body": "would continue to order this", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Works wonders", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Can't tell a difference on it. Maybe I'm not taking enough  for a long enough period.", "title": "Three Stars", "rating": "3"}, {"helpful": 1, "body": "gives up great energy all out the day", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Since this is the root (not extract) I've needed to take up to 10 capsules at a time to get the same benefits as 2-3 extract capsules. Keeping this in mind and the need to exceed the one capsule dosage recommendation, as specified on the bottle. This is an excellent product with full benefits  and works effectively when consumed according to the lesser concentration per capsule of active ingredient.", "title": "Great product, just need more root per dosage!", "rating": "5"}, {"helpful": 1, "body": "Entire books have been written on the miraculous benefits of Ginseng Root. The Chinese call it the \"Root of Man\" and it is considered the imperial herb. It's hard to find an herbal formula nowadays that doesn't contain ginseng in it. My acupuncturist says \"we like to put ginseng in everything. We even cook with it.\" I've done my research and know that Korean Red Ginseng Root is more tonic and warming for the body, which is perfect for the winter. It gives me more energy, mental clarity, positive outlook on life, faster recovery after my workouts and believe or not, I sleep better. SWANSON is a brand I know and trust. It has never fail to deliver quality in any of their products. If there is one single herb you must take for overall ultimate health, this is it.", "title": "Can't Go Wrong", "rating": "5"}, {"helpful": 6, "body": "I got 12 pills left in the bottle and no real noticeable different in my personal experience so far yet.", "title": "Nothing Yet", "rating": "1"}, {"helpful": 1, "body": "Arrived in a timely manner but I don't think it really worked for me.  I could have purchased it at a local vit. shop and not spend the shipping cost.  I didn't see any changes after using this product for awhile.", "title": "ginseng root", "rating": "3"}, {"helpful": 4, "body": "Works well and of good quality.  Helps with my athsma and blood pressure.  Korean Red Ginseng is superior to other types for most uses.", "title": "It is what it is said to be.", "rating": "5"}, {"helpful": 1, "body": "Don't quite know what it did.", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "Started by taking 2 per day, which is 800 mg. Recommended dosage on bottle is 2-3 capsules per day.", "title": "Like it", "rating": "4"}, {"helpful": 3, "body": "This is a great product.  The Korean Red ginseng is far superior than other ginseng products.  My libido is strengthened and it has the additional effect of combating stress.", "title": "Libido is increased!", "rating": "5"}, {"helpful": 2, "body": "Works very well.It gives you energy and makes you feel great. My husband says it  gives him clarity, like a cup of coffee for his brain.", "title": "Great Product", "rating": "5"}, {"helpful": 0, "body": "Very happy with this product. For me it really helps. Glad I was able to find a quality product online that was affordable and worked since this is very hard to find in a store anymore.", "title": "Very happy with this product", "rating": "5"}, {"helpful": 0, "body": "This Ginseng from Swanson works! It always vets me a little spike of energy that I need especially when I'm getting ready to ride my treadmill. The Swanson Brand never disappoints!", "title": "It's good enough for me!", "rating": "5"}, {"helpful": 2, "body": "Purchased in hopes it will help with blood sugar control . Haven't noticed a difference yet but am giving it more time .", "title": "Purchased in hopes it will help with blood sugar control ...", "rating": "3"}, {"helpful": 2, "body": "Very good product, it is recommended for those who need extra energy in their daily activities. Helps relieve stress. Ok", "title": "Very Good", "rating": "5"}, {"helpful": 1, "body": "No noticeable results", "title": "Two Stars", "rating": "2"}, {"helpful": 2, "body": "this stuff is advertised all over the net for that, and when my shrink suggested it, I tried it. Doesn't do anything at ALL. I even tried huge doses for several days then threw it out. However, DHEA (which amazon sells), does work. Your liver metabolizes it into testosterone, which (per college sex ed class) is the way your brain tells your body to be sexually aroused. It's true of both men and women, guys just get more.", "title": "If you want this to increase your sex drive, buy DHEA instead", "rating": "1"}, {"helpful": 0, "body": "Hey, it actually works. Went in as a skeptic and tested it without any expsctations. I could tell a difference and where it counts.  Drink plenty of water.", "title": "Pretty good stuff", "rating": "5"}, {"helpful": 0, "body": "I normally don't write reviews however this product is great! It's only been 1 day and I've noticed a difference. Happy girlfriend right here ;).", "title": "I normally don't write reviews however this product is great! It's only been 1 day and I've noticed ...", "rating": "5"}, {"helpful": 4, "body": "I don't know what they put in it, but it is probably the most potent ginseng I ever used. Every time I take a pill before going to the gym, I feel aggressive and determined, while other kinds of ginseng had always been hit or miss for me. Maybe it is just the extraction method or their source, I don't know, but that will be my ginseng from now on. Good price/quality ratio.", "title": "Most potent ginseng I used so far", "rating": "5"}, {"helpful": 0, "body": "Like others, I received an item that was well outside its best before date, which was hidden by a third-party barcode sticker. Expired 01/15.", "title": "Be cautious", "rating": "1"}, {"helpful": 0, "body": "Brought it for my husband and hes getting result already.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Works.", "title": "good", "rating": "5"}, {"helpful": 0, "body": "as expected", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great value.", "title": "Bargain.  Works pretty well.", "rating": "4"}, {"helpful": 0, "body": "Did not work. Still felt tired. Korean Red Ginseng felt no difference", "title": "Two Stars", "rating": "2"}, {"helpful": 0, "body": "All good.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "great value", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Meets all expectations.", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Seems to be working but nothing over the top.", "title": "It's ok", "rating": "4"}, {"helpful": 0, "body": "Easy to Take.", "title": "Ginseg", "rating": "5"}, {"helpful": 1, "body": "gives up great energy all out the day", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "GREAT PRODUCT", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Outstanding product. Give me much needed energy.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "ok", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "item as described", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Swanson is the best price and quality I've found.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product!!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "quality product, amazing price.", "title": "amazing price.", "rating": "5"}, {"helpful": 0, "body": "Great price, they seem to be working...", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "how do we feel its effect? I can't evaluate.", "title": "Two Stars", "rating": "2"}, {"helpful": 0, "body": "My first time trying these, seems to make me feel a little happy which is good", "title": "seems to make me feel a little happy which is", "rating": "5"}, {"helpful": 0, "body": "I took these as prescribed on the bottle but have seen no changes~ (sad face)", "title": "Two Stars", "rating": "2"}, {"helpful": 2, "body": "I'm not sure I know how to rate supplements and folk remedies accurately, but the product appears to be good and doesn't seem to hurt me. Better yet, it is not one of those that breaks out the active ingredients per two-capsule dose, effectively delivering half the quantity per jar.", "title": "Good ginseng, good price", "rating": "4"}, {"helpful": 0, "body": "The Korean red ginseng to give me an upset stomach,  how can I return it?", "title": "The Korean red ginseng to give me an upset stomach ...", "rating": "1"}, {"helpful": 0, "body": "This is a gr8 adrenal stress combatant - I recommend it to all adults", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Did not work. Still felt tired. Korean Red Ginseng felt no difference", "title": "Two Stars", "rating": "2"}, {"helpful": 2, "body": "it didn't do nothing for me except diaarea", "title": "One Star", "rating": "1"}, {"helpful": 0, "body": "Good product, great price! I take it before workouts and it helps.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Didn't experience any more energy with this product than without.", "title": "no energy", "rating": "2"}, {"helpful": 2, "body": "This product doesn't do anything for me.", "title": "One Star", "rating": "1"}, {"helpful": 0, "body": "love it,,,what i was looking for", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "don't waste your timme", "title": "Two Stars", "rating": "2"}, {"helpful": 0, "body": "Stuff actually works !!!", "title": "Great product !!", "rating": "5"}, {"helpful": 0, "body": "It helped", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "expect only good things", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "it's good~!!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good s***", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "As Promised", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "works great", "title": "yes", "rating": "5"}, {"helpful": 0, "body": "Health", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Works Great.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "ok", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "I can't tell the difference", "title": "Meh", "rating": "3"}, {"helpful": 0, "body": "ok", "title": "diet", "rating": "3"}, {"helpful": 2, "body": "You know when you open up a spice or herb you can smell something? I never noticed a smell with Swanson ginseng, but didn't think much of it until I looked into getting a sage supplement and read a review for Swanson's Sage where the reviewer noted the lack of smell. So, I opened a capsule and not only did it not smell like ginseng, it didn't have any smell. Perhaps there is no ginseng in these pills. I ordered a different brand this time.", "title": "No ginseng smell?", "rating": "1"}, {"helpful": 0, "body": "Good stuff.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good stuff.", "title": "Five Stars", "rating": "5"}, {"helpful": 3, "body": "Do not feel any change in energy with this product. I have been taking this product for about 2 months now....It didn't work for me and I can say that I have tried swanson products before and they have done very little to increase my health in my opinion. Maybe its low quality I don't know.", "title": "Do not feel any change in energy with this product ...", "rating": "1"}, {"helpful": 3, "body": "item arrived on time and in good shape. this product works great. i havent took mant that have i will be buying more", "title": "great", "rating": "5"}, {"helpful": 3, "body": "After taking this for a  few weeks I have not noticd any difference.  Please don't waste your money.  Not worth it.", "title": "No Noticeable Effectss", "rating": "1"}, {"helpful": 0, "body": "Seems to be good quality and good price.", "title": "Ginseng Makes For a Mellow Day", "rating": "5"}, {"helpful": 1, "body": "I didn't want to say I hate it but it really does not seem to do much, if anything, for me. Some reviews said they did not use energy drinks anymore because of this. Wishful thinking on my part.", "title": "I saw no results", "rating": "2"}, {"helpful": 0, "body": "Great price, they seem to be working...", "title": "Four Stars", "rating": "4"}, {"helpful": 4, "body": "I bought this product after reading about its healing and natural energy effects and I love it. I had been trying to quit caffeine for over a year, but every time I had gone about three days without it, I would get excruciating headaches, and I would have no energy nor motivation. I finally got fed up with this and rather frightened when the headaches came just a few hours without caffeine, and I decided to research about methods of quitting caffeine. I read on the internet that ginseng is a good alternative, so I bought this product. I can't say that this product gives me the same amount of energy as caffeine, but it definitely got rid of the headaches and kept me awake all day with no crash. I guess this product made me normal again, which is amazing for me, since 19-year-olds shouldn't be dependent on caffeine in order to function.", "title": "Helped Me Kick Caffeine Dependency!", "rating": "5"}, {"helpful": 1, "body": "I feel more energy, maybe even more than coffee (maybe thats just me!) and i feel alert and my mood is better. I did read that you are not supposed to take this for more than 3 months, so i need to look into that but a bottle is 3 months worth of pills.", "title": "Good Product", "rating": "5"}, {"helpful": 2, "body": "This stuff is supposed to wake you up more naturally than caffiene.  While I didn't experience any negative side effects, even taking 2 at a time did nothing for waking me up. I still had to eventually take caffiene.", "title": "Didn't work", "rating": "2"}, {"helpful": 0, "body": "Ok but it didn't do anything for me.", "title": "Don't waste your money.", "rating": "3"}, {"helpful": 1, "body": "good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product for reducing stress!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Pleased with product and delivery.", "title": "Five Stars", "rating": "5"}, {"helpful": 8, "body": "This stuff works great. I have lots of energy, improves mood and keeps you sharp.I highly recommend, to anyone. No side affects. Aewsome!!", "title": "Great Stuff", "rating": "5"}, {"helpful": 0, "body": "good 4 you. feel better everyday.", "title": "great stuff!", "rating": "5"}, {"helpful": 0, "body": "Seems to be working. more energy", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Wow! I got \"full power\".", "title": "Excellent!", "rating": "5"}, {"helpful": 0, "body": "love it,,,what i was looking for", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "quality product, amazing price.", "title": "amazing price.", "rating": "5"}, {"helpful": 1, "body": "Just started taking this brand of Korean Read Ginseng, reputed to be a male enhancement herb. It is supposed to be an \"adaptogen\" and generally beneficial to the organism but is also supposed to increase male libido and improve male sexual performance. I have taken it now for a week and am happy to report no ill side effects.  I am hopeful it lives up to all the claims. Can't say I'm a raging 19-year old again (yet) but I will update this review in perhaps another month. Will see that the product appears to be a quality product, fresh, well packaged, and a good value for the price.", "title": "Quality Product", "rating": "4"}, {"helpful": 1, "body": "This Korean Red Ginseng Root Give You The Extra Blast of Energy In Your \"ROCKET\" when the time its needed...who would of thought untill you try this Super Product...!!!", "title": "Great Supplement...!!!", "rating": "5"}, {"helpful": 1, "body": "I do not feel any different taking these. Is there something going on inside? I have no idea. On the plus side I do not appear to have any negative reactions. I may have some blood work done to see if anything has changed for better or worse.", "title": "I may have some blood work done to see if anything has changed for better or worse", "rating": "4"}, {"helpful": 0, "body": "I take these every day, some days its 3 times a day one with every meal, and other days its only 2 times a day morning and night, just when ever I feel its needed. I reduces the stress feeling within my self and I get so mad and irritated and these pills reduce that, I get happy with out doctor prescription. the all natural way to feel happy.", "title": "i take these everyday and feel amazing", "rating": "5"}, {"helpful": 1, "body": "Ginseng helps boost blood flow. Take it like the bottle says and it will easily help with helping me feel less cold in the extremities.  This dosage of this is just perfect amount, well order from this company again.", "title": "What I needed.", "rating": "5"}, {"helpful": 1, "body": "Noticed a substantial increase in libido within about 3-4 days, which is great for everyone involved. :D Also seems to give a longer, \"smoother\" energy curve than other things I've tried previously.", "title": "Use it daily.", "rating": "5"}, {"helpful": 2, "body": "Better than others I've tried. No side affects that I can tell. The price has more than doubled though since the first time I bought these. Sometime free shipping, sometimes not but price reflects this. I would recommend this to others, watch for a favorable price.", "title": "Love the boost...", "rating": "4"}, {"helpful": 2, "body": "Purchased in hopes it will help with blood sugar control . Haven't noticed a difference yet but am giving it more time .", "title": "Purchased in hopes it will help with blood sugar control ...", "rating": "3"}, {"helpful": 1, "body": "Arrived in a timely manner but I don't think it really worked for me.  I could have purchased it at a local vit. shop and not spend the shipping cost.  I didn't see any changes after using this product for awhile.", "title": "ginseng root", "rating": "3"}, {"helpful": 1, "body": "I didn't want to say I hate it but it really does not seem to do much, if anything, for me. Some reviews said they did not use energy drinks anymore because of this. Wishful thinking on my part.", "title": "I saw no results", "rating": "2"}, {"helpful": 3, "body": "it really works, i've been taking this caps for over 2 weeks and i can see the results.  i would recommend this!!", "title": "it works!!!", "rating": "5"}, {"helpful": 3, "body": "I take it every day and I feel as though it is slightly helping me with my stressful days at work...", "title": "Ginseng", "rating": "4"}, {"helpful": 2, "body": "it didn't do nothing for me except diaarea", "title": "One Star", "rating": "1"}, {"helpful": 2, "body": "Works very well.It gives you energy and makes you feel great. My husband says it  gives him clarity, like a cup of coffee for his brain.", "title": "Great Product", "rating": "5"}, {"helpful": 2, "body": "This product doesn't do anything for me.", "title": "One Star", "rating": "1"}, {"helpful": 1, "body": "expired they were old and not what i was needing. Total waste of money. I just went to the GMC and got the real stuff", "title": "Total waste of money", "rating": "1"}, {"helpful": 2, "body": "Very good product, it is recommended for those who need extra energy in their daily activities. Helps relieve stress. Ok", "title": "Very Good", "rating": "5"}, {"helpful": 0, "body": "Both in flavor and nutritional value this Ginseng seems more like the regular old stuff, not red korean panax.  I have no proof of where it was harvested, only my experience and having used many Ginseng extracts and capsules.", "title": "Seems more like regular old Ginseng.", "rating": "2"}, {"helpful": 2, "body": "Didn't feel any difference", "title": "One Star", "rating": "1"}, {"helpful": 5, "body": "not worth the risk.  consumer report said that alot of korean ginseng product tested positive for toxic chemicals and substances that can be harmful to the liver and kidneys.  Because of that reason, I threw this $7 product in the garbage can.  At $7 who knows what ELSE is in this besides the gingseng.", "title": "Beware of possible toxic substances", "rating": "1"}, {"helpful": 1, "body": "Realizing that different people will have various results, I experienced little or none. So, I didn't and won't reorder. Curatis empmtor.", "title": "Tried the 30 day bottle", "rating": "2"}, {"helpful": 1, "body": "Tried it .....no bells went off for me.....did not see any difference.one might have to do 2 bottles or more to get on track.", "title": "It's ok......but", "rating": "2"}, {"helpful": 1, "body": "expected to improve as ginseng root supposed to be. but haven't seen any improvements or changes even after two months of using them.", "title": "probably good, but seen no effect of it even after using it for a month.", "rating": "3"}, {"helpful": 0, "body": "I received my package on the estimated delivery date. I use this along with other ingredients for a healthdrink and have not been disappointed.", "title": "Delivered on time !", "rating": "3"}, {"helpful": 0, "body": "Ive been taken it for a month and cant tell that its doing anything.  No energy, no nothing.  I will not buy this product again and would not recommend it to anyone..", "title": "No change at all.. No energy. No nothing.", "rating": "2"}, {"helpful": 2, "body": "gave me stomach problems", "title": "One Star", "rating": "1"}, {"helpful": 1, "body": "Excellent Transaction - Super Fast Delivery - Item as described - Highly Recommend - A +++", "title": "Four Stars", "rating": "4"}, {"helpful": 1, "body": "Does the trick...helps calm me down!", "title": "Awesome", "rating": "5"}, {"helpful": 1, "body": "I thought this would make me feel more energetic but I didn't really feel much of a difference.", "title": "Did not really seem to make much of a difference for me", "rating": "3"}, {"helpful": 7, "body": "This product doesn't do anything for me. Never buy it again.", "title": "One Star", "rating": "1"}, {"helpful": 0, "body": "The date on my bottles is the manufacturing date. Not the expiration date. I have not been on them long enough to tell a difference, more to come.", "title": "Being optimistic", "rating": "5"}, {"helpful": 1, "body": "Exactly what I ordered and got it faster than expected. I take this twice a day as it explains and feel great.", "title": "Great supplement!", "rating": "4"}, {"helpful": 0, "body": "no more comment", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "Great product!!", "title": "Five Stars", "rating": "5"}, {"helpful": 5, "body": "Even though I've been taking them for about four of weeks, I've yet to recognize or feel any different in my energy levels or stamina.  I'm not sure how long it will be before I can say yay or nay to the product.", "title": "Uncertain results", "rating": "2"}, {"helpful": 2, "body": "This is very good and strong to be so inexpensive. If you haven't tried you should. I have taken about everything there is and this is definitely one I am adding to the short list of ones I buy more of. Also if you have not read about ginseng benefits on wiki. It is a remarkable herb, possible help for cancer for some people. University studies show it shrinks some tumors-at least that is what it says on wikipedia.", "title": "Excellent Product and Price!", "rating": "5"}, {"helpful": 1, "body": "good item i love it i recomend to others that this item is nice.", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "This is better than a candy bar or energy drink at 4p.m. You get an even boost of energy that lasts. Even better you can take up to 3 pills during the day. BUT check with your doctor if you have high blood pressure.....Im definitely sold. 90 capsules in a bottle. You wont be disappointed theres no false advertisement", "title": "Full-Spectrum Korean Red Ginseng Root 400mg 90 caps", "rating": "5"}, {"helpful": 0, "body": "so far so good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product!", "title": "Five Stars", "rating": "5"}, {"helpful": 4, "body": "With normal exercise, a healthy diet and this product will help with stamina and keep you standing attention. Recommended for sure", "title": "Its not a mircle but it does increase blood flow and circulation", "rating": "4"}, {"helpful": 0, "body": "Works wonders", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "great product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Easy to Take.", "title": "Ginseg", "rating": "5"}, {"helpful": 0, "body": "GREAT PRODUCT", "title": "Five Stars", "rating": "5"}, {"helpful": 9, "body": "I bought this for my Mom and she loves it!She takes it for improving the function of the blood vessels.Highly recommend it!", "title": "Great product", "rating": "5"}, {"helpful": 0, "body": "Really works", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good Product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "works for me", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good product", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "Great value.", "title": "Bargain.  Works pretty well.", "rating": "4"}, {"helpful": 0, "body": "it's good~!!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Works Great.", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Ok. Found myself on the toilet for the first week.", "title": "Ok. Maybe better for others.", "rating": "3"}, {"helpful": 4, "body": "the product did not have much effect on me. so i could not tell for sure if really works or not..", "title": "not sure", "rating": "1"}, {"helpful": 0, "body": "as expected", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "great value", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "works great", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "works great", "title": "good stuff", "rating": "5"}, {"helpful": 0, "body": "As Promised", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Awesome product! Will be buying again!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "So far I've noticed it has helped my health.", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Works well, and can notice the difference!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "I'm happy with  result", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "what to say, I did not use it", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good energy", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Fast delivery and great product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Got it super fast seems to help.", "title": "awesome", "rating": "5"}, {"helpful": 0, "body": "Excellent product, great product.", "title": "Five Stars", "rating": "5"}, {"helpful": 4, "body": "I can tell the difference when I take it or when it is wearing off.  I take one in the morning and one in mid-afternoon.  It gives me a sense of well being and a more \"do it now\" frame of mind.", "title": "I like the effects", "rating": "5"}, {"helpful": 0, "body": "All good.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "It helped", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Good s***", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Does the trick...helps calm me down!", "title": "Awesome", "rating": "5"}, {"helpful": 2, "body": "I've been taking .  I've just started to see results in the last week. Feb/21/---Feb/27/2014.  But I don't even know if this part of the reason.", "title": "This part of a cocktail", "rating": "3"}, {"helpful": 2, "body": "I have tried 5 different brands and this product is the strongest and the best. I found this brand is actually stronger than some 1000mg brands.", "title": "The Best", "rating": "5"}, {"helpful": 0, "body": "Works ok", "title": "Three Stars", "rating": "3"}, {"helpful": 2, "body": "Full-Spectrum Korean Red Ginseng Root 400 mg 90 Caps - Swanson Premium", "title": "SWANSON PREMIUM, Red Ginsend Root", "rating": "4"}, {"helpful": 2, "body": "I would buy this again. It seemed to help improve energy level and mood. It was shipped quickly and is a good value for the price.", "title": "Good product", "rating": "4"}, {"helpful": 1, "body": "The following was listed:", "title": "Somewhat disappointed", "rating": "3"}, {"helpful": 0, "body": "Good product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "works very good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "great vitamins.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Perfect", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "good stuff", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good so far", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "As promised", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good product", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "does the work", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Cool", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Fair price.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "WORKS GREAT", "title": "SUPPLEMENT", "rating": "5"}, {"helpful": 0, "body": "excelent", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great Stuff", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "Great", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good stuff.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Excellent!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Like", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "good", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "The date on my bottles is the manufacturing date. Not the expiration date. I have not been on them long enough to tell a difference, more to come.", "title": "Being optimistic", "rating": "5"}, {"helpful": 0, "body": "thank you very much for the product I've been taking it daily I see a lot of change and I will order it again thank you very much", "title": "the product", "rating": "5"}, {"helpful": 0, "body": "I tried the more expensive ones and discovered that you do not always get what you pay for, sticking with these for life", "title": "Great energy and focus", "rating": "5"}, {"helpful": 0, "body": "This product does every thing it saY's I will purchase again it does everything It says including bedroom haha try it", "title": "5 star", "rating": "5"}, {"helpful": 0, "body": "I used this for about 2 1/2 weeks and didn't notice any increase in energy or anything else.  I had been drinking diet mt. dew during the day to keep me awake, so after about a week of taking this product, I didn't drink any mt. dew, and began getting tired!  I drive a truck, so I had to stop and get a diet mt. dew, and I was awake again.", "title": "Didn't work for me", "rating": "2"}, {"helpful": 3, "body": "The product is a very good natural general tonic. It sustains the immunity system and fights depression. I like using natural herbs as they have less side-effects.", "title": "Good product, fast shipping, and awsome seller", "rating": "5"}, {"helpful": 0, "body": "This the the best product haven't had in a long time, it's says what it mean and means what it says.", "title": "I LOVE IT", "rating": "5"}, {"helpful": 3, "body": "I have taken ginseng many times in the past. These do work, but have minimal impact. I recommend looking for a different brand. Enough said.", "title": "Very little impact", "rating": "2"}, {"helpful": 3, "body": "Supplements are very subjective, you have to take them for a while to notice. I wonder if you notice more when you don't take them.", "title": "I think it's good", "rating": "4"}, {"helpful": 0, "body": "Capsules quite easy to swallow.To short usage to say anything about supplementing effects.", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "I don't believe this is pure Red ginseng - BUT, it works great! Especially for the PRICE!", "title": "Great!", "rating": "4"}, {"helpful": 4, "body": "This excellent Korean Red Ginseng is unbelievably low priced. It has all the properties it should have. It's good for the nerves and it is a good tonic. I assure you it isn't old merchanise, it seems to be fresh. Red Panax Ginseng has many benefit for men and women. It is classified as a major stimualant and an adaptogen. Used properly, it will improve your health. This is a brand I recommend. I use many ginsengs, so I am qualified to compare.", "title": "Red Hot Panax", "rating": "5"}, {"helpful": 0, "body": "I have anxiety and this really helps take the edge off without having to take Xanax.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "This product is great. I've had problems with other red ginseng upsetting my tummy, but don't have a single problem with this kind. It helps with my problems alot more than the other brand I used before which according to doctor that means it more bioavailable, which is really what you want.", "title": "This product is great. I've had problems with other red ginseng upsetting ...", "rating": "5"}, {"helpful": 2, "body": "I have not noticed any benefits from using this product whatsoever. HOWEVER - keep in mind, sometimes what will not work for one person may actually yield benefits to someone else. Buy it & try it. If it works for you - great! If not, then you learned not to buy any more. :-)", "title": "Maybe its just me?", "rating": "1"}, {"helpful": 0, "body": "The item was exactly what I wanted. I would order from this seller again.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "ok", "title": "Four Stars", "rating": "4"}, {"helpful": 2, "body": "I would buy this again. It seemed to help improve energy level and mood. It was shipped quickly and is a good value for the price.", "title": "Good product", "rating": "4"}, {"helpful": 1, "body": "The capsules appear to work just fine, but the bottle has so much dust and powder, it's as if at least one of the capsules came open inside the bottle.  Both bottles are the same!", "title": "Very dusty!", "rating": "2"}, {"helpful": 2, "body": "I bought this for the bedroom specifically and it certainly made things easier. I have not felt any side-effects from it", "title": "increased blood flow", "rating": "4"}, {"helpful": 1, "body": "This stuff really puts the pep back in your step with no side effects.I don't know how many bottles I've ordered.It's priced right & ships quick!", "title": "Great product", "rating": "5"}, {"helpful": 2, "body": "It is a pill any man would love to have. Ladies get your men on this, my girl recommends it too", "title": "It works", "rating": "5"}, {"helpful": 2, "body": "Great price but u get a manufacture date not an experation date so good luck n enjoy the product s", "title": "fair", "rating": "3"}, {"helpful": 4, "body": "I found that I needed to pour out some of the contents of the capsule to get to a point where it doesn't keep me up at night. I'm 250 lbs but sensitive to caffeine and stuff. Although I thought this was to make me mellow.  Once I started pouring some of it out and taking only one a day, in the morning things work out much better. I can't specifically pinpoint that it has helped me with stress but I know if I need to be up, this will be my go-to item!", "title": "Too much to handle!", "rating": "4"}, {"helpful": 0, "body": "This product is great. I've had problems with other red ginseng upsetting my tummy, but don't have a single problem with this kind. It helps with my problems alot more than the other brand I used before which according to doctor that means it more bioavailable, which is really what you want.", "title": "This product is great. I've had problems with other red ginseng upsetting ...", "rating": "5"}, {"helpful": 1, "body": "am wating too much time to receive but finally i received it from 4 days and  am trying to use it", "title": "good", "rating": "3"}, {"helpful": 2, "body": "Product arrived quickly, and just as advertised. Good quality and fast shipping.", "title": "Good Vitamin.", "rating": "5"}, {"helpful": 0, "body": "This ginseng is helping my husband's energy.", "title": "Good", "rating": "5"}, {"helpful": 0, "body": "So far I've noticed it has helped my health.", "title": "Four Stars", "rating": "4"}, {"helpful": 1, "body": "This stuff really puts the pep back in your step with no side effects.I don't know how many bottles I've ordered.It's priced right & ships quick!", "title": "Great product", "rating": "5"}, {"helpful": 0, "body": "works great fell better all the way around", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Works well, and can notice the difference!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Very Good stuff.  Has helped me improve.", "title": "Very Good stuff. Has helped me improve", "rating": "5"}, {"helpful": 0, "body": "Awesome product! Will be buying again!", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Very fast and good service! All around good purchase. I would purchase this again for sure. Good quality and price.", "title": "great", "rating": "5"}, {"helpful": 0, "body": "Excellent product, great product.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Got it super fast seems to help.", "title": "awesome", "rating": "5"}, {"helpful": 1, "body": "This made me very jittery", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "I like it really good, i like it very much. And I believe  Tissot is a good brand. Buy it!", "title": "I like it really good, i like it very much. And I believe  Tissot is a good brand. Buy it!", "rating": "5"}, {"helpful": 4, "body": "This excellent Korean Red Ginseng is unbelievably low priced. It has all the properties it should have. It's good for the nerves and it is a good tonic. I assure you it isn't old merchanise, it seems to be fresh. Red Panax Ginseng has many benefit for men and women. It is classified as a major stimualant and an adaptogen. Used properly, it will improve your health. This is a brand I recommend. I use many ginsengs, so I am qualified to compare.", "title": "Red Hot Panax", "rating": "5"}, {"helpful": 1, "body": ":)", "title": "Three Stars", "rating": "3"}, {"helpful": 2, "body": "I have not noticed any benefits from using this product whatsoever. HOWEVER - keep in mind, sometimes what will not work for one person may actually yield benefits to someone else. Buy it & try it. If it works for you - great! If not, then you learned not to buy any more. :-)", "title": "Maybe its just me?", "rating": "1"}, {"helpful": 3, "body": "The product is a very good natural general tonic. It sustains the immunity system and fights depression. I like using natural herbs as they have less side-effects.", "title": "Good product, fast shipping, and awsome seller", "rating": "5"}, {"helpful": 2, "body": "I am not sure about this product. I have followed the directions and took 3 pills a day with food and water but do not feel a big difference. I am still very fatigued and tired throughout the day at work and at school. I will give it more time.", "title": "Not sure >.<", "rating": "4"}, {"helpful": 3, "body": "I ordered this product because I heard good things about Ginseng.  When I got the bottle, I realized that there capsules were made of cheap gelatin - pork or bovine.  All reputed manufacturers make product out of vegetarian ingredients now and Swanson needs to follow the way.", "title": "Why Gelatin caps?", "rating": "1"}, {"helpful": 0, "body": "Great price for Ginseng and delivered in 2 days! Awesome!!", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "This ginseng works better than any I have ever used before. First time I used it I took one capsule and it gave me nice energy, a good pick me up. Then I took one more and I was to amped up, not jittery but just to much. I guess if your dead tired or really have to stay on your toes for a long day at work or whatever you might test the waters and take 1 then about an hour later one more.", "title": "Wow.....", "rating": "5"}, {"helpful": 4, "body": "It d osent work i tied the whole bottle and took it like I was suppose to and it fidnt work", "title": "Dont buy", "rating": "1"}, {"helpful": 0, "body": "great product and service", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "aaaa1 the best  !!!!!!!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "I'm happy with  result", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "This stuff is great!", "title": "Fantastic", "rating": "5"}, {"helpful": 0, "body": "Excelente producto", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great all around!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "works very good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "great vitamins.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "great product", "title": "Five Stars", "rating": "5"}, {"helpful": 4, "body": "the product did not have much effect on me. so i could not tell for sure if really works or not..", "title": "not sure", "rating": "1"}, {"helpful": 0, "body": "AAAAAA+++++++", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great", "title": "Five Stars", "rating": "5"}, {"helpful": 9, "body": "This is my 3rd 3-bottle order, so I've been taking them over a year.", "title": "Increased Energy, Stamina, and Mood", "rating": "4"}, {"helpful": 3, "body": "I have taken ginseng many times in the past. These do work, but have minimal impact. I recommend looking for a different brand. Enough said.", "title": "Very little impact", "rating": "2"}, {"helpful": 0, "body": "Too soon to notice any results.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Meeeh!", "title": "Three Stars", "rating": "3"}, {"helpful": 3, "body": "Supplements are very subjective, you have to take them for a while to notice. I wonder if you notice more when you don't take them.", "title": "I think it's good", "rating": "4"}, {"helpful": 5, "body": "I feel a little better having used this stuff for a few weeks. I feel like I might get better sleep too. It is supposed to be a stress reliever, as per a recent article in Details magazine it is also supposed to help increase sex drive and improve libido. Not sure about any of that, from the stress features I think it works.", "title": "Works good. Suggested by details magazine.", "rating": "5"}, {"helpful": 1, "body": "WHo ever knows really if this stuff works, but I think it does. Price was good and it came quickly.", "title": "Ginseng  for all", "rating": "5"}, {"helpful": 0, "body": "good stuff.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good stuff", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Excellent!", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "This made me very jittery", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "excelent", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Perfect", "title": "Four Stars", "rating": "4"}, {"helpful": 3, "body": "Full-Spectrum Korean Red Ginseng Root 400 mg 90 Caps - Swanson Premium works as I expected.  Thanks for your integrity.", "title": "Full-Spectrum Korean Red Ginseng Root 400 mg 90 Caps - Swanson Premium", "rating": "5"}, {"helpful": 3, "body": "This hasn't done anything for me yet.  Maybe in a few more weeks, but so far I feel as tired and lousy as always.", "title": "Nothing so far.", "rating": "1"}, {"helpful": 0, "body": "Great", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great", "title": "Five Stars", "rating": "5"}, {"helpful": 2, "body": "Yes, these replaced the 100mg I've been taking, good service came sooner then expected. I will buy this item again.", "title": "Very Pleased", "rating": "5"}, {"helpful": 1, "body": "Gives you energy and vitality and really works. make sure you take it after a meal. Go for it and do not think twice!!", "title": "Awesome Product!", "rating": "5"}, {"helpful": 3, "body": "I took this product for 2 weeks and kept feeling like my heart was plugging up again. I finally figured out this product was making me sick. I was told it would give me energy but it was the opposite effect. If you have heart disease don't even try this product.", "title": "Watch out", "rating": "1"}, {"helpful": 1, "body": "This Ginseng root was very powerful in the way it worked especially after a workout, I will certainly recommend it to others that are looking for a natural lift.", "title": "Getting to the root...", "rating": "5"}, {"helpful": 4, "body": "It d osent work i tied the whole bottle and took it like I was suppose to and it fidnt work", "title": "Dont buy", "rating": "1"}, {"helpful": 9, "body": "Just at the end of my first bottle. It indeed boost my energy. I take it about every other day, and forget some days. I've mostly stopped drinking coffee. The days I take it I can definitely tell I'm more alert in the afternoon. Plus there's no crash like you might have with sugar/caffeine.", "title": "Great!", "rating": "4"}, {"helpful": 1, "body": "My husband and I take it regularly and it works well, providing us with overall energy.  The price was right and delivery quick.", "title": "Ginsent 400 mg", "rating": "5"}, {"helpful": 1, "body": "If you have problem with libido, the problem could be a low testoterone and this could be caused for a low HDL, so I would like to suggest you the following: 1) Take Ginseng and Ginko Bilova daily; 2) Vitamin C (1,000 mg) daily; 3) Zinc 50 daily; 4) Two cups of red wine daily; 5) One cup of honey (do not use sugar) daily; 6) one spoon of olive oil daily; 7) Lecitine of soy daily (very important); 8) Omega 3 (1,000 mg) daily; 9) Eat eggplant; 10) one stalk of celery daily; 11) one spoon of honey pollen daily; 12) Do not take bath with hot water; 13) Use the clasic boxer briefs; 14) Eat cauliflower, broccoli and cabbage; 15) Eat lean meat and a lot of fish; 16) Do not eat the milk products; 17)Eat nuts daily.  These could increase the testoterone and HDL.", "title": "It's okay, but .......", "rating": "3"}, {"helpful": 4, "body": "it done nothing ..not even one half of a pound ..just another  diet scam thing to make money off people ..thanks", "title": "nothing", "rating": "1"}, {"helpful": 9, "body": "I've been so tired for so long and it's hard to accomplish so many of my projects etc.  Then I remember something about Ginseng.  I purchased some from Amazon, and to  my surprise, it really works!  Now I have to take four to get a real strong burst of energy, but it lasts for hours.", "title": "Real Energy -- Fast", "rating": "5"}, {"helpful": 3, "body": "Full-Spectrum Korean Red Ginseng Root 400 mg 90 Caps - Swanson Premium works as I expected.  Thanks for your integrity.", "title": "Full-Spectrum Korean Red Ginseng Root 400 mg 90 Caps - Swanson Premium", "rating": "5"}, {"helpful": 3, "body": "This hasn't done anything for me yet.  Maybe in a few more weeks, but so far I feel as tired and lousy as always.", "title": "Nothing so far.", "rating": "1"}, {"helpful": 8, "body": "This stuff works great. I have lots of energy, improves mood and keeps you sharp.I highly recommend, to anyone. No side affects. Aewsome!!", "title": "Great Stuff", "rating": "5"}, {"helpful": 0, "body": "No comments.", "title": "Four Stars", "rating": "4"}, {"helpful": 2, "body": "I really can't see any difference after taking this, no change in energy levels. I wouldn't by this none of these supplements seem to really do what they claim", "title": "I really can't see any difference after taking this, no change in energy levels.", "rating": "2"}, {"helpful": 1, "body": "Entire books have been written on the miraculous benefits of Ginseng Root. The Chinese call it the \"Root of Man\" and it is considered the imperial herb. It's hard to find an herbal formula nowadays that doesn't contain ginseng in it. My acupuncturist says \"we like to put ginseng in everything. We even cook with it.\" I've done my research and know that Korean Red Ginseng Root is more tonic and warming for the body, which is perfect for the winter. It gives me more energy, mental clarity, positive outlook on life, faster recovery after my workouts and believe or not, I sleep better. SWANSON is a brand I know and trust. It has never fail to deliver quality in any of their products. If there is one single herb you must take for overall ultimate health, this is it.", "title": "Can't Go Wrong", "rating": "5"}, {"helpful": 9, "body": "I bought this for my Mom and she loves it!She takes it for improving the function of the blood vessels.Highly recommend it!", "title": "Great product", "rating": "5"}, {"helpful": 1, "body": "This product completely lacked the ginseng scent, even when I opened one capsule and tasted the content. And, it had no effect on my energy level.", "title": "What's in the bottle?", "rating": "1"}, {"helpful": 1, "body": "Ok so I am pretty impatient sometimes and I work with kids. This ginseng root has given me ALOT more patience with everyone I encounter and I really do enjoy how it also gives me a clear head and just allows me not to be so tense. I used to be in the military and I often am very tense and not very social, however these allow me to relax and feel like I dont always have to have my guard up. I would definitely recommend these to anyone trying to cope with stress and feel more clear headed and calm about things.", "title": "Calm your nerves and improve your clarity!", "rating": "5"}, {"helpful": 8, "body": "This is essentiam for brain function, and at over 60 now, I take this to stay sharp! When you add the Korean Red Ginsing Root to your daily regiment, you will see a difference in mental accuity and function within 7-15 days!", "title": "Brain Health!", "rating": "5"}, {"helpful": 0, "body": "AAAAAA+++++++", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good purchase", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "very good", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "I like it", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "Meeeh!", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "Great", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good", "title": "Three Stars", "rating": "3"}, {"helpful": 1, "body": "If you have problem with libido, the problem could be a low testoterone and this could be caused for a low HDL, so I would like to suggest you the following: 1) Take Ginseng and Ginko Bilova daily; 2) Vitamin C (1,000 mg) daily; 3) Zinc 50 daily; 4) Two cups of red wine daily; 5) One cup of honey (do not use sugar) daily; 6) one spoon of olive oil daily; 7) Lecitine of soy daily (very important); 8) Omega 3 (1,000 mg) daily; 9) Eat eggplant; 10) one stalk of celery daily; 11) one spoon of honey pollen daily; 12) Do not take bath with hot water; 13) Use the clasic boxer briefs; 14) Eat cauliflower, broccoli and cabbage; 15) Eat lean meat and a lot of fish; 16) Do not eat the milk products; 17)Eat nuts daily.  These could increase the testoterone and HDL.", "title": "It's okay, but .......", "rating": "3"}, {"helpful": 3, "body": "i bought this product two days ago, the first time i took a capsule my eyes were itching me throat was hurting me i couldn't stand it i was fine before. the second day i tried it again just to see if it was the pill that made me feel like that. and it was so i recommend you not to buy it", "title": "DO NOT BUY IT WILL MAKE YOU SICK", "rating": "1"}, {"helpful": 2, "body": "This is very good and strong to be so inexpensive. If you haven't tried you should. I have taken about everything there is and this is definitely one I am adding to the short list of ones I buy more of. Also if you have not read about ginseng benefits on wiki. It is a remarkable herb, possible help for cancer for some people. University studies show it shrinks some tumors-at least that is what it says on wikipedia.", "title": "Excellent Product and Price!", "rating": "5"}, {"helpful": 2, "body": "I was skeptical, but I purchased this product to handle some personal issues.  To my surprise, the product works, and can bring vitality back to your worn out limb.", "title": "Great Product, and works within a few days.", "rating": "4"}, {"helpful": 1, "body": "No comments", "title": "One Star", "rating": "1"}, {"helpful": 3, "body": "I`m 48 years old and have ED , but not many more, I use this product for one month and went from not getting it up to 1 to 2 hard on ,My wife can`t believe the turn around , She use to want more now I wear her out, I feel 20 again in bed , also loss 30lbs of weight too not sure from this or just from all the sex I`m having", "title": "If you have ED and or over 30 and don`t feel like in your 20`s in bed with your wife or girl friend PLease read this", "rating": "5"}, {"helpful": 1, "body": "you need to be honest with what you are selling to your customers,if doesnt work like a real ginseng .", "title": "wastage of money", "rating": "1"}, {"helpful": 2, "body": "okay, I read all the negative reviews saying that it's a placebo, it doesn't work, can't see differences, etc. There even was this one review where it said the company website doesnt even exist. Um, i typed in on google swanson premium ginseng and it took me to this product. The website is legit, and has other products like this one. Also, i read the reviews on the website and the overall ratings for it were 4.6 out of 5. so idk why there's so much hate on this product. unless people are looking for a miracle herb that will increase their libido and sexual desire, which there is not i believe. I've taken ginseng in the past, and it has made me more active with my energy. I gave up coffee, and started taking 400 mg of ginseng a day. ever since, i have not taken naps in the middle of the day, i have increased sexual desires and libido. hopefull this product does the same.", "title": "It's legit.", "rating": "4"}, {"helpful": 2, "body": "I COULDN'T TELL ANY DIFFERENCE WHEN TAKEN THIS DRUG. GO AND PURCHASE THE LITTLE BLUE PILL INSTEAD.", "title": "NOT THIS ONE", "rating": "1"}, {"helpful": 0, "body": "works well for my wife's Samsung II", "title": "Four Stars", "rating": "4"}, {"helpful": 3, "body": "This is a great product.  The Korean Red ginseng is far superior than other ginseng products.  My libido is strengthened and it has the additional effect of combating stress.", "title": "Libido is increased!", "rating": "5"}, {"helpful": 0, "body": "I use a lot of vitamins and nutrients and for all of them, use the same review. I CANNOT RECOMMEND TO ANONE ELSE WHAT TO USE OR SAY WHY IT MAY BE GOOD FOR YOU.", "title": "Vitamins & Nutrients", "rating": "4"}, {"helpful": 1, "body": "I sometimes experiment with male enhancement products and herbs.", "title": "Doesnt help with male enhancement", "rating": "1"}, {"helpful": 0, "body": "I use a lot of vitamins and nutrients and for all of them, use the same review. I CANNOT RECOMMEND TO ANONE ELSE WHAT TO USE OR SAY WHY IT MAY BE GOOD FOR YOU.", "title": "Vitamins & Nutrients", "rating": "4"}, {"helpful": 4, "body": "I bought it from Amazon.com its result is not too good,its normal product. I do not really like it, I would like to use an other product", "title": "comments", "rating": "2"}, {"helpful": 3, "body": "The capsules smell strange, and when I see what the powder looks like inside the clear capsules, it's tiny flicks of orange in a mostly white powder substance.", "title": "300mg CAPSULES, ONLY! DECEPTIVE marketing...", "rating": "1"}, {"helpful": 0, "body": "Very good my husband has more energy and is not always tired", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Subscribe to this and get one every year", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "This works very well. Gives me a lot of energy. I plan to continue to order this product.", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "I did not see really anything with this roduct", "title": "Five Stars", "rating": "2"}, {"helpful": 0, "body": "I've used this product for years, excellent source.", "title": "excellent source.", "rating": "5"}, {"helpful": 0, "body": "seems to help  who knows", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "ok", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Product was received on time going to buy more", "title": "Four Stars", "rating": "4"}, {"helpful": 1, "body": "Taking this every day definitely helps my energy level. Its just a little overpriced for the amount of pills you get.", "title": "Helps but pricey", "rating": "4"}, {"helpful": 1, "body": "gives me energy  gives this 60 yr body  a some  groove in my moves and pep in my steps. Some pep in my steps", "title": "great energy pill", "rating": "5"}, {"helpful": 1, "body": "Take this daily.  Does the job.  Not much more to say about this product.  Will continue to use it for now.", "title": "Works as advertised.", "rating": "4"}, {"helpful": 4, "body": "Helps me keep going! This is the highest quality capsule ginseng I have found.  I travel for business and often have meetings from early to late in the day.  I take two in the AM and maybe another two in the afternoon.", "title": "Great Product!", "rating": "5"}, {"helpful": 1, "body": "Taking this product for approx. 1 month and had the following benefits: 1. Energy level has increased 2.Increased libido (not a miracle worker for ED problems - but definately helped! 3. I used to take a lot of aspirin for headaches and surprisingly dont have near as many headaches anymore - I guess this is a bonus. 4. Lastly, I feel less stressed - I dont get uptight over little things and my mood is great - This is also great for calming anxiety problems in my opinion! I'm not sure everyone will benefit from this product like I did because everyones body is different, but I'm very satisfied with this product! In my opinion it is at least worth giving a try. By the way, I took two capsules in the morning with a 8 oz. glass of water(on an empty stomach). Thanks!", "title": "Multiple Purpose", "rating": "5"}, {"helpful": 1, "body": "This works very well. Gives me a lot of energy. I plan to continue to order this product.", "title": "Five Stars", "rating": "5"}, {"helpful": 3, "body": "This is the highest quality red ginseng I have found in a long time.  Looking into the capsules you can actually see the red tint to the powder, and you can feel the boost it gives you.  However, be forewarned, I began having difficulty with my blood pressure being too high.  I've never had an issue with hypertension in my life, in fact I am on a beta blocker for other issues that forces my blood pressure into a low state at all times.  Taking this ginseng regularly, brought my blood pressure up sometimes to uncomfortable levels, borderline dangerous.  I would highly recommend keeping an eye on your blood pressure while starting and taking this medication, especially if you have a history of hypertension.", "title": "Excellent quality, but watch your blood pressure!", "rating": "4"}, {"helpful": 3, "body": "I noticed a definite change. I was more energetic, and my libido resurfaced. It wasn't outrageous, but was enough to get back into bed. It tastes a little like peanuts. I take a little more than the recommended dose on the bottle, because I read in a study that determined the efficiency of KRG on libido and they were taking nearly twice the amount of KRG then the bottle recommends. There were no negative side-effects, but once you stop taking the pills effects stop almost immediately. But I continue to buy it whether it works 100% or not because I did notice enough of a change to continue.", "title": "Good product.", "rating": "4"}, {"helpful": 1, "body": "I did not see really anything with this roduct", "title": "Five Stars", "rating": "2"}, {"helpful": 4, "body": "I am very pleased with this product. It has exceeded all my expectations and all it's claims. It is well worth the money. I'm ordering more.", "title": "Red Ginseng review", "rating": "5"}, {"helpful": 1, "body": "I have no idea what other Red Ginseng is like, but this is very body friendly. Easy to swallow, no uncomfortable reactions, etc. I had read about ginseng, so thought it would be well worth a try. Note: It is also an excellent choice price-wise!", "title": "Healthy Choice", "rating": "5"}, {"helpful": 0, "body": "Worked for me", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "essential", "title": "ED therapy", "rating": "4"}, {"helpful": 0, "body": "this product is excellent for people working hard every day. I recommendable for men have sexual impotence, it is wonderful product for virility....good price and excellent quality.", "title": "ginseng pills", "rating": "4"}, {"helpful": 0, "body": "Have always liked Ginseng", "title": "Good procuct", "rating": "5"}, {"helpful": 1, "body": "Taking this product for approx. 1 month and had the following benefits: 1. Energy level has increased 2.Increased libido (not a miracle worker for ED problems - but definately helped! 3. I used to take a lot of aspirin for headaches and surprisingly dont have near as many headaches anymore - I guess this is a bonus. 4. Lastly, I feel less stressed - I dont get uptight over little things and my mood is great - This is also great for calming anxiety problems in my opinion! I'm not sure everyone will benefit from this product like I did because everyones body is different, but I'm very satisfied with this product! In my opinion it is at least worth giving a try. By the way, I took two capsules in the morning with a 8 oz. glass of water(on an empty stomach). Thanks!", "title": "Multiple Purpose", "rating": "5"}, {"helpful": 0, "body": "Love it", "title": "Three Stars", "rating": "3"}, {"helpful": 1, "body": "after only a month of taking this authentic and 100% pure ginseng. I take 2 capsules a day and lots of water on the go.", "title": "I already feel better", "rating": "5"}, {"helpful": 0, "body": "Too early to judge", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Haven't felt much of a difference in my energy levels.", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "Good product", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Works fine", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "This is not pure Ginseng. Pure Korean Ginseng is not cut with rice powder, and who knows what else. Not the real thing.", "title": "Korean Ginseng", "rating": "2"}, {"helpful": 2, "body": "The bottle claims to have 100 tablets, each containing 600 mg.  In fact, capsules contain 300 mg.  The daily dosage is 600 mg, but to get that you need to take TWO capsules.  The bottle contains 30 grams of ginseng, not 60.", "title": "False advertizing", "rating": "1"}, {"helpful": 1, "body": "I have no idea what other Red Ginseng is like, but this is very body friendly. Easy to swallow, no uncomfortable reactions, etc. I had read about ginseng, so thought it would be well worth a try. Note: It is also an excellent choice price-wise!", "title": "Healthy Choice", "rating": "5"}, {"helpful": 3, "body": "This is the highest quality red ginseng I have found in a long time.  Looking into the capsules you can actually see the red tint to the powder, and you can feel the boost it gives you.  However, be forewarned, I began having difficulty with my blood pressure being too high.  I've never had an issue with hypertension in my life, in fact I am on a beta blocker for other issues that forces my blood pressure into a low state at all times.  Taking this ginseng regularly, brought my blood pressure up sometimes to uncomfortable levels, borderline dangerous.  I would highly recommend keeping an eye on your blood pressure while starting and taking this medication, especially if you have a history of hypertension.", "title": "Excellent quality, but watch your blood pressure!", "rating": "4"}, {"helpful": 3, "body": "I purchase this product after seeing Dr. Oz on TV. I started taking them last week, feeling more energy don't seem to get the afternoon let down!?", "title": "Ginseng", "rating": "4"}, {"helpful": 3, "body": "mixed with hot tea and worked good! Sent blood flo in the right direction. Just mix 2 pills in with hot tea and your good to go!", "title": "Hardness!!!!!!", "rating": "4"}, {"helpful": 1, "body": "This seems to give me a gentle elevation of energy without a crash afterword. I like using it in the morning. A Korean friend says it is good for my immune system too.", "title": "I like using it in the morning", "rating": "5"}, {"helpful": 2, "body": "Excellent shipping and absolutely what i wanted.", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "I follow the directions.  I feel great and ready to work.", "title": "Energy!", "rating": "5"}, {"helpful": 3, "body": "I noticed a definite change. I was more energetic, and my libido resurfaced. It wasn't outrageous, but was enough to get back into bed. It tastes a little like peanuts. I take a little more than the recommended dose on the bottle, because I read in a study that determined the efficiency of KRG on libido and they were taking nearly twice the amount of KRG then the bottle recommends. There were no negative side-effects, but once you stop taking the pills effects stop almost immediately. But I continue to buy it whether it works 100% or not because I did notice enough of a change to continue.", "title": "Good product.", "rating": "4"}, {"helpful": 1, "body": "I like this packaging (capsule) than any other I have found. Easy to take and swallow with or without water. I like the scent of authentic and fresh.", "title": "Good Source of Energy", "rating": "5"}, {"helpful": 1, "body": "Great stuff.", "title": "Popeye's Spinach!!!", "rating": "5"}, {"helpful": 6, "body": "It totally gives you huge boost, im 31 but i had recently some problems in general health like getting tired and in sexual encounter i couldn't manage to be in action for longer time. When i started using this product, everything is awesomely great and you will feel the difference.", "title": "GOTTA have it guys", "rating": "5"}, {"helpful": 1, "body": "Only kind/brand I would buy.  It has made an actually difference in my life.  Try it --you will like it.", "title": "Red Ginseng", "rating": "5"}, {"helpful": 0, "body": "Don't buy this one. Buy the Chinese Red Ginseng version. Trust me it works. This Korean version didn't do anything for me.", "title": "Don't buy this one. Buy the Chinese Red Ginseng ...", "rating": "1"}, {"helpful": 0, "body": "It's ok... use with other  products it help with the neccessary engery that I need to get through the work day.", "title": "No energy explosion but it's ok.", "rating": "2"}, {"helpful": 1, "body": "Korean Ginseng is the King of Ginsengs, from what I read just about everywhere. I'm not affiliated with this company at all. I'm always skeptical about glowing reviews but I've been using this product for years and for me, it works. It doesn't give you a jittery feeling like some of the energy boosters out there. It just gives you more energy. There's no \"buzz\" or whatever. You just end up with more energy. The effect is very subtle but it's definitely there. It's increases my stamina for both physical (and mental) activiities. I've tried American ginseng and it did nothing for me. This really works (for me).", "title": "The real deal in Ginseng", "rating": "5"}, {"helpful": 1, "body": "excellent", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Amazing product!! I am a 54 yr old cattle rancher in Oklahoma. ED is not something I was comfortable talking about. I could get an erection...BUT had trouble keeping it. I decided to try this after a friend of mine in the ranching business shared his struggle and outcome with me. Within 4 days of taking this I noticed  a WONDERFUL change. My erections were faster, firmer and lasted long than when I was in my 20s. Now I have to be careful about sexual thoughts because.. Let's just say..it could be a bit embarrassing in the wrong situation now.  I last longer in sex and enjoy it more now. It is amazing. Every man with any type of ED should think seriously about this. It has changed my life and outlook on sex.", "title": "Gave a 54 year old cowboy his smile back!!", "rating": "5"}, {"helpful": 0, "body": "Did not fulfill advertisement !", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "So far good", "title": "Four Stars", "rating": "4"}, {"helpful": 4, "body": "Helps me keep going! This is the highest quality capsule ginseng I have found.  I travel for business and often have meetings from early to late in the day.  I take two in the AM and maybe another two in the afternoon.", "title": "Great Product!", "rating": "5"}, {"helpful": 4, "body": "I am very pleased with this product. It has exceeded all my expectations and all it's claims. It is well worth the money. I'm ordering more.", "title": "Red Ginseng review", "rating": "5"}, {"helpful": 1, "body": "I like this product because it does work, the only thing I don't like is it can take a few weeks to feel the effects of it. However, when it starts to work, it really works! I find that late nights are stronger now than in the past decade. I would recommend this product to anyone who's having mild Erectile Dysfunction, it really works!", "title": "Great product and no side effects.", "rating": "4"}, {"helpful": 3, "body": "ginseng has givinen my husband more energy, and is in a better mood.i would recommend this product.it has helped in the bedroom too.", "title": "very happy with results", "rating": "5"}, {"helpful": 1, "body": "This is a good product and I just finished my first bottle have been told to give it some time taking it for my Diabetes if you want to get regular shipments this company does take time to deliver I ordered have way through the first bottle the next shipment didn't arrive till 4 days after I was out.", "title": "Not lapsing is important", "rating": "4"}, {"helpful": 2, "body": "Read some research published about korean red ginseng being shown as effective for reducing tinnitus in 3g doses. After finishing the bottle, I'm not too sure that there was any improvement in my tinnitus.", "title": "Ineffective", "rating": "2"}, {"helpful": 6, "body": "Writing a review on a pill is difficult, but here goes.  I purchased this item about a month ago (2nd time) because of the valued price on Amazon.com and the fact that I feel it does help my tired old mind to focus a little better.  I only take five pills per week.", "title": "Imperial Elixir, Korean Red Ginseng, 600 mg, 100 Capsules", "rating": "4"}, {"helpful": 9, "body": "Recommended by my physician for blood sugar control. Felt much better within a few days of taking it/.", "title": "Doctor Recommended", "rating": "5"}, {"helpful": 1, "body": "The best red ginseng I feel 100% better and when coupled with the tea", "title": "Great suppliment.", "rating": "5"}, {"helpful": 1, "body": "It seems to be Fake tablet. It is not working out for me............. waste of money only and waste of time", "title": "Waste of Money", "rating": "1"}, {"helpful": 0, "body": "Did not fulfill advertisement !", "title": "Three Stars", "rating": "3"}, {"helpful": 2, "body": "Be aware, some people may react to this product with the shakes, lightheadedness, and dizziness. Use caution!!!! Stopped using the product and symptoms went away.", "title": "Jstockton", "rating": "1"}, {"helpful": 0, "body": "So far good", "title": "Four Stars", "rating": "4"}, {"helpful": 1, "body": "I read a review about the benefits of Ginseng and wanted to try the product. As I compared the prices in the local health food stores to the same product on Amazon I opted to order thru Amazon. My product arrived only a few days after submitting my order. Great service", "title": "Imperial Elixir Ginseng", "rating": "5"}, {"helpful": 1, "body": "Been using for one month now and the results are the same. Do not see any positive results using this product that promised much but no help. Trying something else now.", "title": "Promises not realized", "rating": "1"}, {"helpful": 3, "body": "This wonderful for fatigue.  I take 2 capsules twice a day.  When I tried this at first, I notices a difference within 2 weeks.  When I ran out, I became very fatigued so I know it works for me.  Just remember it's not the same as Korean Ginseng, which is more common in stores.", "title": "Great for fatigue", "rating": "5"}, {"helpful": 1, "body": "I am a vitamin freak taking them for 30 years am 75 still go to work every day and have to say now is a great brand", "title": "very good does the job", "rating": "5"}, {"helpful": 7, "body": "This seems to help my mood real well. Get upset at work or tired when things seem to build up.  Just taking one a day let's things not get to you as much.", "title": "Things just don't seem to push your button so easy.", "rating": "5"}, {"helpful": 1, "body": "withing a few days I noticed more mental focus and I was less anxious.", "title": "Recommend it for better focus and less anxiety", "rating": "5"}, {"helpful": 8, "body": "I took two pills of these capsules for a week and find it really helpful especially in terms of offering me more energy. I think the amount of Ginseng contained in each capsule is enough.", "title": "Not too bad! Really effective!", "rating": "5"}, {"helpful": 1, "body": "Now American Ginseng is good stuff. I do however prefer the brand \"Vermont Ginseng\" however this is not available most places. If you do manual labor or athletic activity in heat then this is what you want to help keep your cool. I use it every summer during harvest to keep me healthy and happy. :)", "title": "Good Stuff", "rating": "5"}, {"helpful": 2, "body": "I have found this product to be quite helpful in restoring my energy level while battling cancer.  After taking NOW's American Finding for 4 weeks I felt an increase in my energy level.", "title": "Boosted my lagging energy level.", "rating": "5"}, {"helpful": 5, "body": "This was recommended by my oncologist 6 mos post chemo and 4 mos post radiation for fatigue. I think it is helping.", "title": "This was recommended by my oncologist 6 mos post chemo and 4 ...", "rating": "5"}, {"helpful": 3, "body": "Makes a difference for me and my fatigue.  Does not make me hyper as can other non-American Ginseng.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product; as advertised.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product; as advertised.", "title": "Five Stars", "rating": "5"}, {"helpful": 2, "body": "Keeps me running on my usual 4 hrs sleep a day.  Not sure how I'd do without them!", "title": "Great quality Ginseng!", "rating": "5"}, {"helpful": 1, "body": "Now I feel energetic for study all the day till late night, great product!", "title": "Did enhance my strenth", "rating": "5"}, {"helpful": 1, "body": "I am taking this to get some more energy in my life. A good product, and worth the money. Going to need more soon, will be back to order.", "title": "Good Ginseng", "rating": "5"}, {"helpful": 1, "body": "Great product. Fast shipping.", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Good quality supplements", "title": "Five Stars", "rating": "5"}, {"helpful": 2, "body": "I've been using this for almost a year to help combat the fatigue of  chemo. It seems to help.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "My dad had been taking these, so I decided to give them a try. Unfortunately, I didn't see an increase in my energy level that I was hoping for. I've run out, and not reordered yet. May or may not.", "title": "What's the point?", "rating": "3"}, {"helpful": 1, "body": "Work great.", "title": "Okay", "rating": "5"}, {"helpful": 1, "body": "I've been using these for a while now and do seem to feel better.", "title": "Good supplement", "rating": "5"}, {"helpful": 4, "body": "I have a considerable amount of experience as an herbalist, nutritional counselor, and product application specialist.", "title": "Excellent Value", "rating": "5"}, {"helpful": 0, "body": "Great stuff", "title": "Four Stars", "rating": "4"}, {"helpful": 1, "body": "Great", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "having a shortage of ginseng over the past few months [china glut] I decided to go online. now foods has great prices and quantity. fast fast shipping was awesome thanx a bunch.", "title": "need my ginseng", "rating": "5"}, {"helpful": 1, "body": "These seem OK and fair for the price, but there is better quality. I need to take two every day to notice any difference.", "title": "but there is better quality. I need to take two every day ...", "rating": "3"}, {"helpful": 0, "body": "Great quality, price and product. Came as seen in picture. Very pleased.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Recommended for energy by my physician and it was perfect!", "title": "Exactly what the doctor ordered", "rating": "5"}, {"helpful": 0, "body": "Definitely helps on tough days! Like a cup of coffee in a capsule.", "title": "Great For Energy!", "rating": "5"}, {"helpful": 0, "body": "I love the fact that it is American Ginseng...maybe grown in WI", "title": "Great product!!!", "rating": "5"}, {"helpful": 0, "body": "I really like it", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "I am taking this to get some more energy in my life. A good product, and worth the money. Going to need more soon, will be back to order.", "title": "Good Ginseng", "rating": "5"}, {"helpful": 3, "body": "It works in boosting my energy. But it also makes me bleed a little bit in the ear and nose... I guess it's a side effect?", "title": "It works in boosting my energy. But it also ...", "rating": "3"}, {"helpful": 1, "body": "These seem OK and fair for the price, but there is better quality. I need to take two every day to notice any difference.", "title": "but there is better quality. I need to take two every day ...", "rating": "3"}, {"helpful": 1, "body": "I've been using these for a while now and do seem to feel better.", "title": "Good supplement", "rating": "5"}, {"helpful": 1, "body": "very effective! highly recommended!", "title": "highly recommended!", "rating": "5"}, {"helpful": 4, "body": "This is a good slow burn, sustaining force that I take in the morning with breakfast. Then I add one more in the afternoon. Good stuff.", "title": "Good energy. Good Price.", "rating": "4"}, {"helpful": 1, "body": "Great product. Fast shipping.", "title": "Five Stars", "rating": "5"}, {"helpful": 2, "body": "I should have read the contents more carefully but I wanted to draw attention to the rice flour in this supplement in case any one else is sensitive to rice like I am.", "title": "Contains rice flour :(", "rating": "2"}, {"helpful": 2, "body": "We bought these to bring back to China for my father to give out as gifts. They are good gift items for Chinese. Arrived quickly without problem.", "title": "good product", "rating": "5"}, {"helpful": 0, "body": "My dad had been taking these, so I decided to give them a try. Unfortunately, I didn't see an increase in my energy level that I was hoping for. I've run out, and not reordered yet. May or may not.", "title": "What's the point?", "rating": "3"}, {"helpful": 0, "body": "All good.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Love it", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Seems to be working fine.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Didn't work for me", "title": "no go", "rating": "1"}, {"helpful": 1, "body": "Very good product!", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Really works to give you energy every day.", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "very effective! highly recommended!", "title": "highly recommended!", "rating": "5"}, {"helpful": 0, "body": "Good product", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Seems to add energy to my life.", "title": "Seems to help energy", "rating": "5"}, {"helpful": 0, "body": "good for extra energy!", "title": "energizing", "rating": "5"}, {"helpful": 1, "body": "good deal", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good deal", "title": "Five Stars", "rating": "5"}, {"helpful": 2, "body": "seems to work well in a low one or 2 caps a day dose. I am changing the 4 to 5 stars. gradually increased dosage to four caps daily and am completely unfogged and functioning. wow. criticism of this product indicating that Korean ginseng is better is so mistaken. American ginseng(avoid extracts- it's too complex to unbalance it) is well known not to cause blood pressure spikes like oriental ginseng.", "title": "definately makes me more energetic and focused", "rating": "5"}, {"helpful": 0, "body": "Very good product.  My families love it!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Dr. Weil recommends the Wisconsin Ginseng.  So I bought this.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Highly recommended.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good stuff. quick service", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Good stuff", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "great", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Really works to give you energy every day.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Very good product.  My families love it!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "I take one everyday and feel good!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Seems to add energy to my life.", "title": "Seems to help energy", "rating": "5"}, {"helpful": 1, "body": "Just got it today and already being asked to review? Well, fast shipping and good price. The quality or does it help my health? Time will tell.", "title": "fast shipping and good price. The quality or does it help my ...", "rating": "3"}, {"helpful": 1, "body": "This is a great supplement to take as an additive for any energy supplement you are using. Any natural herb over a pharmacy made supplement I would reccomend. The price is reasonable too if you understood the overhead cost it is to grow ginseng in the United States.", "title": "Great energy supplement add on.", "rating": "5"}, {"helpful": 0, "body": "Seems to be working fine.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "good stuff. quick service", "title": "Four Stars", "rating": "4"}, {"helpful": 1, "body": "This is a great product. I take them every day and make sure I never run out. I can tell a real difference.", "title": "Great product.", "rating": "5"}, {"helpful": 1, "body": "Product is great. Works well. Happy to find this at this price.  Would be happy to purchase this item again", "title": "Fast shipping", "rating": "5"}, {"helpful": 0, "body": "good for extra energy!", "title": "energizing", "rating": "5"}, {"helpful": 1, "body": "Didn't notice a difference, but not many supplements work on me so may not be the brand.", "title": "Didn't notice anything.", "rating": "3"}, {"helpful": 0, "body": "Great product, A+++", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Highly recommended.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Didn't work for me", "title": "no go", "rating": "1"}, {"helpful": 0, "body": "I really like it", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "It really works.", "title": "excellent", "rating": "5"}, {"helpful": 1, "body": "The real bottle size received is much smaller than the image picture and also the seal of bottle had been teared when received.", "title": "I would recommend modified the image that try to make closer the ...", "rating": "3"}, {"helpful": 0, "body": "great product", "title": "great", "rating": "5"}, {"helpful": 0, "body": "Great product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good product", "title": "Four Stars", "rating": "4"}, {"helpful": 1, "body": "Long-term use, have the effect.Spirit a lot better", "title": "Five Stars", "rating": "5"}, {"helpful": 2, "body": "Recommended by my husbands oncologist for his energy level. We are both taking it, hard to tell for sure how well it works but we ran out for a week and were both more tired during that time.", "title": "Doctor recommended for energy levels.", "rating": "4"}, {"helpful": 0, "body": "Good stuff", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "All good.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good deal", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Great products!  Great supplier", "title": "Great products", "rating": "5"}, {"helpful": 0, "body": "Love it", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Has no effect whatsoever.", "title": "One Star", "rating": "1"}, {"helpful": 2, "body": "I purchased this to help my daughter with her autism symptoms, and praise God, it really works.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "just average, if that", "title": "nah", "rating": "2"}, {"helpful": 6, "body": "been taking Wisconsin Ginseng since the 1970's and swear by it as an aid to good health == I'm  81.6", "title": "... 1970's and swear by it as an aid to good health == I'm 81", "rating": "5"}, {"helpful": 0, "body": "Top shelf quality at a bargain price", "title": "Top notch quality", "rating": "5"}, {"helpful": 0, "body": "looks good but not see the real reaction yet....", "title": "Four Stars", "rating": "4"}, {"helpful": 4, "body": "I have been using ginseng for years. I first started using it while working in China. Now I am using American ginseng as it is a milder version. I am a 70 yr old grandmother and it is a great boost in the morning.", "title": "I am a 70 yr old grandmother and it is a great boost in the morning", "rating": "5"}, {"helpful": 0, "body": "great value for the price.", "title": "Great value", "rating": "5"}, {"helpful": 0, "body": "Good product. Energizer!", "title": "Good product!", "rating": "5"}, {"helpful": 0, "body": "Excellent adaptogen for adrenal support", "title": "Effective", "rating": "5"}, {"helpful": 0, "body": "Helped with my nausea..", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "ok", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "Good product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Looks good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great,my friend love it.", "title": "Great, my friend love it", "rating": "5"}, {"helpful": 0, "body": "It's Okay.", "title": "Four Stars", "rating": "4"}, {"helpful": 0, "body": "Good value", "title": "Good value", "rating": "5"}, {"helpful": 0, "body": "Very good.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great price online", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great,my friend love it.", "title": "Great, my friend love it", "rating": "5"}, {"helpful": 0, "body": "Helped with my nausea..", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great price online", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "great product!!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "It's very good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good product", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "great so far", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Looks good", "title": "Five Stars", "rating": "5"}, {"helpful": 1, "body": "Hard to review any supplement. I hope there are benefits but I'm not sure. If I have to  buy a cape for the role of super hero, I'll come back and add to my review.", "title": "Hard to review supplemnts. We hope they are helping us in some subtle way", "rating": "3"}, {"helpful": 1, "body": "If this doesn't help my male fertility, I'm going to feed it to my goldfish and see if they have any better chance.", "title": "Ginseng pills, what can I say?", "rating": "4"}, {"helpful": 3, "body": "I have been using American ginseng for about 20 years it is the Best. I hardly ever get sick with colds like when I was younger  I am 62 now and swear by this product, Make sure it is American not Korean Ginseng, This site is the cheapest I have Found.", "title": "... American ginseng for about 20 years it is the Best. I hardly ever get sick with colds like ...", "rating": "5"}, {"helpful": 0, "body": "Thank you for a positive and professional buying experience!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Good price, and speedy processing and shipping. Thanks!", "title": "A+ Seller", "rating": "5"}, {"helpful": 0, "body": "Great stuff. And a lot cheaper than energy drinks and lasts longer.", "title": "Better than energy drinks", "rating": "5"}, {"helpful": 0, "body": "seem good,good deal", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "very good", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great supplement.", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "Great product!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "wow like now", "title": "fast", "rating": "5"}, {"helpful": 0, "body": "Great", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "have no effect.", "title": "One Star", "rating": "1"}, {"helpful": 0, "body": "Terrific", "title": "Terrific", "rating": "5"}, {"helpful": 0, "body": "Good ginseng, from what I can tell.  I think it's a good idea to take several times a day to start.  Saved my day today, as I went to check the oil on my Kubota GR2120 tractor and found the cooling system overflow cap was missing.  The cap from the ginseng fits, though, so with a tiny hole in it and keeping a close eye on it, I can cut grass today while I wait for my replacement cap ($3 part $8 shipping) to get here, which probably won't be until Monday.  (Today is Thurs.)", "title": "It Works.", "rating": "4"}, {"helpful": 1, "body": "It tastes fresh.  Now customer service told me that as of Dec 2015 this ginseng is cultivated in China, and is analyzed to contain not less than 1.5% ginsenosides.  1.5% is on the low end of the spectrum, and they should demand a higher minimum standard, although for the price it is about right even if they only contain the minimum.", "title": "It tastes fresh. Now customer service told me that ...", "rating": "4"}, {"helpful": 1, "body": "This product works great, these are more than satisfactory,very happy with them,this is a great buy,thank you very much. buy one!!!", "title": "This product works great,", "rating": "5"}, {"helpful": 1, "body": "seems ok. caps are easy and i believe in ginsengs affects after a few years of observation in asia (unlike most of the laboratory supplements, NONE of which these armies of entire-life-\"malnourished\", simple-exercising, 80/90+ year olds consumed). cooling compared to  korean ginseng, and better living in hot climate. but no way to know purity/ content really. emailed the company and they said should be at least 1% minimum ginsenoside content but no guarantee. dont know if this is made from potent root hairs or just whole root or what. DSHEA only requires saying [Root] and NOW is not benevolent enough to specify. could just be filled with rice flour for all we know, and some reports show that is actually the case. bottle says 2caps daily @1g, but chinese medicine traditionally uses at least 3g, up to 10g daily for any effect. cheap enough for just a minimal daily dose for probable minimal health benefit though. nice they finally actually use cellulose capsule instead of the worst legacy garbage Beef Gelatin, when most modern nations dont sell unhealthy laboratorized US beef product, and/or their public wont accept it. Gelatin simply cannot be accepted in any product that claims to be \"healthy\". These caps also contain Stearates (Magnesium), a risky hydrogenated-fat filler that is added only to coat powders in order to keep manufacturing machinery running at high speed. being evidenced as toxic and does decrease absorption of the product ingredient you pay for, up to 80%. Immunosuppressive likely as well. no surprise coming from laboratory ingredients duh. Stearates should also not be accepted as ingredients in foods, let alone supposedly \"healthy\" supplements. realize that all these claimed healthy supplement companies, who put *unnecessary Stearates or similar in their products, care more about a little increased output than they do about YOUR health. support products/ companies/ PEOPLE that dont use these fillers.", "title": "seems ok, if compared to all the other crap supplements. really its just the cheapest bottle with the right words & colors on it", "rating": "2"}, {"helpful": 0, "body": "Not impressive.", "title": "Three Stars", "rating": "3"}, {"helpful": 0, "body": "Wonderful!", "title": "Five Stars", "rating": "5"}, {"helpful": 0, "body": "gppd", "title": "Three Stars", "rating": "3"}, {"helpful": 4, "body": "Let's see, the bottle says \"500 mg,\" and \"100 veg capsules\"--so you're getting 100 capsules of 500 mg each, right?", "title": "250 mg capsules, not 500", "rating": "1"}]