[{"title": "Good quality, Great Price.", "rating": "5", "body": "Glutamine is really good for you. I use it because I weight train and that is a killer on your body. Glutamine helps your body release HGH (Human Growth Hormone). HGH helps to burn body fat and increase the size of your muscles. It also helps your body support your muscles (rather than breaking them down). It is also supposed to help keep your GI tract working properly.", "helpful": 1}, {"title": "I compared them ALL: This one is the best price for the same ingredients and quality.", "rating": "5", "body": "I compared them ALL: This one is the best price for the same ingredients and quality.", "helpful": 1}, {"title": "Weight loss secret weapon!", "rating": "5", "body": "Glutamine is such a great supplement. Yes, it helps with your muscles a bunch, but what I truly value it for is assisting me with weight loss. Glutamine stops your cravings for carbs and sugar. If you're counting calories and get hunger pains between meals take a teaspoon of this stuff and you'll not only feel slightly euphoric but you'll stop day dreaming about food. It's very versatile too. It barely has a discernible taste. I like to add it to smoothies, yogurt, juice, or in a pinch just a bit of water.", "helpful": 3}, {"title": "L-Glutamine is essential to healing your digestive system if you ...", "rating": "5", "body": "L-Glutamine is essential to healing your digestive system if you suffer from leaky gut syndrome or food intolerances. I really feel the difference after I started taking this", "helpful": 3}, {"title": "Body Fortress Pure Glutamine is described by labdoor as a ...", "rating": "5", "body": "Body Fortress Pure Glutamine is described by labdoor as a top Glutamine supplement. In 30 days of (daily) consumption I have experienced a difference in recovery and strength. My recovery time has shortened, and understand the process of muscle tissue breakdown and repair. The white powder is tasteless,", "helpful": 2}, {"title": "Body Fortress Glutamine Powder", "rating": "5", "body": "I am a supplement junkie.  Especially when I am weight training. I love preworkouts, postworkouts, proteins. GIVE THEM ALL TO ME.  L-Glutamine is a wonderful addition to any diet or routine.  People use it to help with upset stomachs.  It helps speed up recovery after a good workout. Less muscle soreness, quicker recovery!  Glutamine is used to stave off carbohydrate cravings. Which is a huuuuuge help if you're trying to eat low carb (especially if you have unbearable cravings that blow your diet ALL THE TIME *cough cough*), or just watching your food intake at all.  This is odorless, flavorless, and can be added to pretty much anything.  I add it into my preworkout intensifier, my postworkout recovery drink, or a protein shake.  It's pretty versatile, and this was a great price.  I would repurchase.", "helpful": 5}, {"title": "BF Glutamine Powder mixes well in water and in green tea and is pretty much tasteless", "rating": "4", "body": "Got the cheapest Glutamine I could find to add to my supplement stack. Given its just one ingredient, didn't think I needed an expensive version.", "helpful": 4}, {"title": "Supposed to be great for leaky gut but I can only take a ...", "rating": "3", "body": "Supposed to be great for leaky gut but I can only take a small amount as it makes me feel nauseous", "helpful": 2}, {"title": "great for stomach", "rating": "5", "body": "I use this daily for stomach issues. Works like a dream!!!", "helpful": 0}, {"title": "I love this stuff", "rating": "5", "body": "I love this stuff!  It's great for the immune system but really helps me to see results with my recovery post-workout.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product! Took 15 minutes off of my workout routine.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "LOVE IT", "helpful": 0}, {"title": "One Star", "rating": "1", "body": "The outside condition was very bad", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Best Glutamine", "helpful": 0}, {"title": "Love it", "rating": "5", "body": "Great product.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "It is good  need plastic spoon", "helpful": 0}, {"title": "Glutamine goes great with Citrulline Malate", "rating": "5", "body": "As anyone who trains or works out with weight knows very well, this type of training is tough on your muscles. It takes its toll. Using supplements like Glutamate can really help to speed up your recovery times. This is actually a conditionally essential amino acid, and I have found it really makes my workouts much more effective.", "helpful": 4}, {"title": "Dangerous to open", "rating": "1", "body": "As others have said, the last container I is bought is impossible to open.  Who makes open-proof supplements??  I had to use pruning shears to break into the lid, and I cut my hand on the resulting sharp shards.  AND they don't include a scoop.  I will NEVER buy this junk again.", "helpful": 1}, {"title": "Glutamine = Gains", "rating": "5", "body": "cheap and effictive glutamine best ive ever tried was mhp maximum human performance micro glutamine but that cost too much. Glutamine works and is a essential part of any serious body builders regimen. When i want to get huge like a beast i do one scoop in the morning one before working out one after and one before bed. Remember glutamine is the most abundant amino acid in our muscle", "helpful": 1}, {"title": "Totally awesome glutamine powder", "rating": "5", "body": "Totally awesome glutamine powder.  Combine with L-Arginine, and BCAAs and you have a potent pre-workout.  By far the best price per serving.  Just because it is sold at the grocery store does NOT mean that it is an inferior product to larger brand names.  Don't pay for a label or an advertisement.", "helpful": 1}, {"title": "Not worth it.", "rating": "1", "body": "A magazine article said to mix this in food to lose weight. It made me gain weight!", "helpful": 0}, {"title": "will throw away", "rating": "1", "body": "Too gross to use lol. Super nasty other supplements are available", "helpful": 1}, {"title": "meh", "rating": "3", "body": "Honestly for body fortress this should be cheaper. I'm hesitant to buy their products especially after buying their whey protein for years because it had higher protein per serving than any other brand, only to find out they were spiking and it actually had much less and there was a class action lawsuit. Look it up. Also they should include a scoop at this price. Cut some more corners BF, that's the way to a stellar reputation.", "helpful": 8}, {"title": "A MUST HAVE!", "rating": "5", "body": "I've purchased more expensive Glutamine in the past and was worried if I got it cheaper it wouldn't work.  Well this glutamine powder put my worries to rest.  I can't tell the difference at all.  I will continue to purchase this from Body Fortress instead of at my gym.", "helpful": 3}, {"title": "Best glutamine on the market", "rating": "5", "body": "cheap and effictive glutamine best ive ever tried was mhp maximum human performance micro glutamine but that cost too much. Glutamine works and is a essential part of any serious body builders regimen. When i want to get huge like a beast i do one scoop in the morning one before working out one after and one before bed. Remember glutamine is the most abundant amino acid in our muscle", "helpful": 1}, {"title": "Best value per serving I have found", "rating": "5", "body": "I've used this Glutamine powder a few times over the years.  It is by far the best value out there.  I've been able to find nothing comparable on a per serving basis.  It is flavorless so you can mix it with your favorite drink and it mixes really well.  No clumping or gritty texture after you add it.  I will not go out on a limb and say this is some sort of miracle supplement if you are a weightlifter that is looking for big gains.  It is an essential supplement along with BCAA, creatine, and protein at the least.  It will help you recover from a serious workout more quickly, but its not going to keep you from ever getting sore.  The fact you feel better should allow you to work out longer and harder everyday which will eventually lead to bigger gains.  You still have to put in the work, but this is a good glutamine powder to add to your pre and post workout shakes.", "helpful": 5}, {"title": "Amazing , life changing!!", "rating": "5", "body": "This product (L Glutamine) has made a huge difference in myself and my husband life.  My knee does not ache any longer. My Husband was amazed at the difference this product made in how his joint felt.  He has even quit wearing his knee braces!  NO KIDDING.  I am 57 and he is 62. He takes a capsule every day, I prefer the powder mixed in smoothie .", "helpful": 3}, {"title": "On my second tub. It does not come with ...", "rating": "5", "body": "On my second tub. It does not come with a scoop. I use the scoop from a different brand that I purchased before. I notice a difference when I lift with vs lifting without. I mix it in with my BCAAs and drink during my lifting sessions. One container lasts awhile about 2 BCAA containers for every 1 glutamine container.", "helpful": 0}, {"title": "No scooper and great price.", "rating": "5", "body": "What can I say? For the price, you can't go wrong. It doesn't come with a scoop so hopefully you have saved one from another supplement. On the back it says \"Free of: yeast, wheat, milk or mild derivatives, lactose, sugar, preservatives, soy, artificial color, artificial flavor and sodium.\" Blends in easy with protein and carbs or just water. Will be buying again. Oh, arrived in a day and a half to Utah.", "helpful": 2}, {"title": "Gross taste, however it works", "rating": "2", "body": "Bottom line, it works. Significant improvement in recovery time and compliments my supplement stack very nicely (I take it directly after my workout with a protein shake). However, let me tell you that the taste is nearly unbearable, and even worse, you will very presently feel it sit in your stomach for about 20 minutes. Make sure to cover it up with a concentrated protein shake or any supplement formula with a strong flavor profile.", "helpful": 2}, {"title": "Maybe helps with muscle growth? Definitely helps my acne.", "rating": "5", "body": "Okay so this is maybe not going to be my most helpful review for people looking for muscle growth but I have to say: this stuff clears up my acne.", "helpful": 4}, {"title": "IT WORKS!", "rating": "5", "body": "This stuff is legit. A few weeks ago, I had horrible recovery from my workouts. Now, I pop this in my Whey and boom! It's like it never happened. Only legs still require recovery, and it's not nearly as bad. I also highly recommend taking it first thing in the morning. It has almost no taste, and will mix well into oatmeal.", "helpful": 2}, {"title": "Noticeable Results within a day for Muscle Soreness", "rating": "5", "body": "Definitely works for me. There are a lot of supplements that you read about the benefits of, and it's hard to tell whether or not it's working, and depending on why you're taking this, that still might be the case. Part of the reason I use this is for the health benefits associated with healing a leaky gut-- and I don't really have any way of knowing if it's working or not.", "helpful": 1}, {"title": "Good for Recovery!", "rating": "4", "body": "This is pure glutamine. It is great for recovery from intense workouts. If it takes a while for you to recover from workouts and remain sore for many days then you may want to try taking glutamine. Also good when you are cutting as it will help with recovery since your body will not be taking in enough nutrients as it normally would from a regular diet.", "helpful": 2}, {"title": "This product is pretty new", "rating": "5", "body": "This product is pretty new so I thought I'd give it a try. Ive been taking Glutamine from GNC for quite some time.  I have to say this Glute is working very well.  I take before and after my workouts and it has helped me recover faster and more complete than me not using it.  I workout 6 days a week with weights and cardio everyday...Without the Glute I would not be able to keep this pace.. All in all this is a solid product that I will probably buy it again.", "helpful": 3}, {"title": "Amazing price, no taste, helps alot.", "rating": "5", "body": "Have been using this with BCAA'S and preworkout. It has helped me muscles a lot. No more soreness, and that goes a long way since that used to really shut me down for a couple days after a hard workout. Don't take with creatine, only because your body uses the same transports to deliver to Muscle and one of the suplements will just get passed through the body not absorbed. Take 2-4 hours apart.", "helpful": 1}, {"title": "It is great for everyday use when working out", "rating": "5", "body": "I take extra glutamine when injuries pop up. It is great for everyday use when working out. Will double up when low black flares up & currently taking 2-3 servings a day for recently torn MCL to move the healing process along.", "helpful": 1}, {"title": "+SUPERIOR PRODUCT+", "rating": "5", "body": "I'm on week one of the insanity workout. This helped with soreness. There's no unnecessary flavoring or useless bonus supplements. It's straight up powder. It also looks like more than 66 servings. Close to a 3 month supply. I'm more than happy about that not to mention increased libido, and a heartburn cure. ;)", "helpful": 1}, {"title": "Cost-effective Gluatmine for general purposes.", "rating": "5", "body": "If you drink a lot of alcohol you'll want to take a TBSP of this mixed in some grape or orange juice after a night of drinking to help keep your muscles hydrated. It also helps prevent flatulence from food sensitivities and reduces muscle pain post workout.", "helpful": 1}, {"title": "This is Magic!", "rating": "5", "body": "This is a Great product. There are no additional ingredients just pure 100% Glutamine!  It is pretty tasteless. I mix it in 4-8 oz of water at night and down it really fast. I can feel the magic it works inside my body. Glutamine is the most abundant amino acid in the body so its great to replenish those stores after a intense workout. Another huge plus is Glutamine is perfect for intestinal health!", "helpful": 1}, {"title": "By far the best i've tasted (i've had nearly every flavor)", "rating": "5", "body": "By far the best i've tasted (i've had nearly every flavor). Even though i looked up the advantages to glutamine and the answers were pretty vague and inconclusive, i enjoy the taste and have been feeling a shorter recovery.", "helpful": 1}, {"title": "cant take this", "rating": "3", "body": "Unfortunately I did not do well on this product. The seller was great and the delivery time was great. However, this turns into a neurotoxin in my body. So I cannot use this as part of my supplement regimen. But that's my own individual experience. Everybody's body is different so I suggest you try it and see if it helps you.", "helpful": 1}, {"title": "Excellent product!", "rating": "5", "body": "I used to order the products at Walmart but now Amazon's prices are unbeatable. Excellent product especially for the money. My husband who works out all the time and is also a personal trainer loves it!", "helpful": 1}, {"title": "great for DOMS", "rating": "5", "body": "Been taking this for a year for my Leaky Gut. I guess it helps there, I'm really not sure. But I've also been lifting weights daily and this does help with DOMS. I still get sore, just not crippling sore. Recommend.", "helpful": 1}, {"title": "and this is great for coating and being healing for the gut", "rating": "5", "body": "We use L-Glutamine in our daily supplement routine for both us and our kids. My son has GI issues, and this is great for coating and being healing for the gut. We give him  250 2x a day of this powder in his bottle and he has seen a decrease in GI discomfort and issues since starting him on it. While this specific formula of L-Glutamine is marketed to Body builders/ weight lifters, but L-Glutamine is beneficial in other ways as well and I love that this was MUCH cheaper than the tabs or capsules.  I do wish that it wasn't an add on item but all in all the product is fantastic.", "helpful": 0}, {"title": "I think its what caused my migraines.", "rating": "1", "body": "I have used glutamine for years. Usually stuck to with a popular name brand.  I bought this one because of the significantly lower cost.  I started getting migraines shortly after taking it.  A friend using this exact brand complained of the same thing.  I switched back to my previous brand and no migraines.  I'm not claiming this product is positively the cause but, for me, I rather be not chance it again and my friend said they will never take it again.", "helpful": 0}, {"title": "It works just like it says. Must try.", "rating": "4", "body": "I started using this glutamine powder for about 3 weeks now, and I noticed I recover faster for my next workouts. This could be a placebo effect but I am ok with that, it works for me. The fact that this powder does not have flavor makes it even better since you can combine it with any drink. I will be restocking another tub for next month. I am currently cutting weight and this glutamine powder has been doing the job, a must try for the price.", "helpful": 0}, {"title": "The cheapest glutamine I found on Amazon. I used ...", "rating": "5", "body": "The cheapest glutamine I found on Amazon. I used Optimum Nutrition glutamine for a while, and the only reason I made the switch was price. I can't really make a comparison about the efficacy of each product, but they both seem to work. The one noticeable difference is that a teaspoon of ON contained 5 g of glutamine, whereas a teaspoon of Body Fortress contains only 4.5 g.", "helpful": 0}, {"title": "slight sweet taste) or mixed on a smoothie", "rating": "5", "body": "I use this to help with gut issues.  I just my 3rd had of this.  It makes a big difference for me as a notice when I don't take it.  For maintenance I take one serving a day either just in water (almost flavorless, slight sweet taste)  or mixed on a smoothie.", "helpful": 0}, {"title": "Great value and helps with recovery", "rating": "5", "body": "Great value for Glutamine if buying individually instead of in a mixed supplement. This makes a big difference in recovery for me... greatly reduces soreness after workout.", "helpful": 0}, {"title": "Great glutamine", "rating": "5", "body": "This is a great product. dissolve quickly, is tasteless and help recover from workouts. I workout 6 days a week and it's essential to supplement with glutamine before and after daily exercise.", "helpful": 0}, {"title": "Sour Urine", "rating": "1", "body": "Tastes like soured piss and I can't find any third party lab studies to even confirm its purity.", "helpful": 1}, {"title": "Body Fortress Glutamine", "rating": "5", "body": "Mixes well. I usually mix this with my aminos, so I dont know how it tastes by itself, but it doesn't affect the taste of my aminos, so I will say it tastes fine. This is actually my second bottle from this brand.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Recommended to used.. Super fast delivery.. A+", "helpful": 2}, {"title": "Five Stars", "rating": "5", "body": "Excellent thank you very much.", "helpful": 1}, {"title": "Great mixablilty and awesome price per serving", "rating": "5", "body": "Great mixablilty and awesome price per serving.", "helpful": 0}, {"title": "Definitely helps!", "rating": "5", "body": "Have ordered this twice now.  It has absolutely made a huge difference in how I feel after a workout.  My energy level is much better, and I'm not wiped out for the day if I have pushed and done a tough workout.", "helpful": 0}, {"title": "A must", "rating": "5", "body": "Helps me to recover from intense workouts. Helps with my gut issues. Great price and it really works.  A winner here", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great supplement! It's good quality and helps me recovery from workout faster. Highly recommended for everybody!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Best Glutamine", "helpful": 0}, {"title": "Vinny sahay feels good .", "rating": "5", "body": "This product i use it in everything from shakes to protein ice creams  it's like an important part of life ,helps you recover fast ,you sleep good after workout .overall a must for everyone .", "helpful": 0}, {"title": "Maybe helps with muscle growth? Definitely helps my acne.", "rating": "5", "body": "Okay so this is maybe not going to be my most helpful review for people looking for muscle growth but I have to say: this stuff clears up my acne.", "helpful": 4}, {"title": "Love it", "rating": "5", "body": "Great product.", "helpful": 0}, {"title": "Didn't work for me", "rating": "3", "body": "I tried this as a recommendation from a doctor. I didn't see much difference after about a month of use. I purchased 2 tubs and have about 1/2 tub left. I'll finish it out but probably will not replace.", "helpful": 0}, {"title": "I use this Glutamine everyday.", "rating": "5", "body": "I use this when I'm trying to lose body fat. I like the results. I seem to recover from workouts quicker and I feel when I am eating at a calorie deficit that I only burn fat, not muscle.", "helpful": 0}, {"title": "It serves it's purpose", "rating": "5", "body": "This is the second tub I bought of glutamine from this company. Glutamine is glutamine to me but the price is right and has some its effectiveness for helping with recovery after a long gym session. Worth the buy.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I have been taking this regularly to remedy a digestive issue.  It seems to be working well.", "helpful": 0}, {"title": "Lifetime user of this product", "rating": "5", "body": "Unbelievable product at the right price!!", "helpful": 1}, {"title": "Still using this but works great thus far", "rating": "5", "body": "Still using this but works great thus far. I actually feel an improvement in my recovery after workouts or just playing mid level sports. Thanks seller.", "helpful": 0}, {"title": "great product", "rating": "5", "body": "great product...I put a little in my pre/during/post workout drinks...helps the recovery", "helpful": 1}, {"title": "Lifetime user of this product", "rating": "5", "body": "Unbelievable product at the right price!!", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Why didn't it come with a scooper", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Excellent thank you very much.", "helpful": 1}, {"title": "Good stuff", "rating": "5", "body": "Great price and does its job !", "helpful": 1}, {"title": "effective, economical, hard to open", "rating": "4", "body": "Hard to open! Really a bizarre thing, this canister. I got it to budge a little bit, but needed my husband tohulk it out.... now that he did the iniinitial opening, it's normal now.", "helpful": 0}, {"title": "Never purchased with this supplement apart from BCAA's and Creatine ...", "rating": "4", "body": "Never purchased with this supplement apart from BCAA's and Creatine.  When combining them all, I have not noticed a difference. Based on all other reviews, I dont doubt I received a quality product, I only doubt it's effectiveness with my body chemistry.", "helpful": 0}, {"title": "No Scoop, good post workout.", "rating": "3", "body": "Good for post workout drink mixes.  Tastes ok and works.  Only complaint is mine didn't have a scoop in the container so when it says 60 servings I may not get that because I'm guessing at the scoop.", "helpful": 0}, {"title": "Great glutamine", "rating": "5", "body": "This is a great product. dissolve quickly, is tasteless and help recover from workouts. I workout 6 days a week and it's essential to supplement with glutamine before and after daily exercise.", "helpful": 0}, {"title": "Vinny sahay feels good .", "rating": "5", "body": "This product i use it in everything from shakes to protein ice creams  it's like an important part of life ,helps you recover fast ,you sleep good after workout .overall a must for everyone .", "helpful": 0}, {"title": "I use this Glutamine everyday.", "rating": "5", "body": "I use this when I'm trying to lose body fat. I like the results. I seem to recover from workouts quicker and I feel when I am eating at a calorie deficit that I only burn fat, not muscle.", "helpful": 0}, {"title": "Works great. For better results", "rating": "5", "body": "Works great. For better results, use at night right before you go to bed.", "helpful": 0}, {"title": "Nice and smooth", "rating": "5", "body": "Nice and smooth, not gritty. Dissolves instantly and I can add it to all my other powder vitamins in apple juice and drink it over a couple of hours. Flavorless. Will order again", "helpful": 0}, {"title": "Great value and helps with recovery", "rating": "5", "body": "Great value for Glutamine if buying individually instead of in a mixed supplement. This makes a big difference in recovery for me... greatly reduces soreness after workout.", "helpful": 0}, {"title": "i like it for the price", "rating": "4", "body": "i like it for the price. my old stuff had 5 grams per serving and this has 4.5- not the end of the world, but i wish i would have noticed that before i bought this.", "helpful": 0}, {"title": "Still using this but works great thus far", "rating": "5", "body": "Still using this but works great thus far. I actually feel an improvement in my recovery after workouts or just playing mid level sports. Thanks seller.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good for gut health", "helpful": 1}, {"title": "Mixes good. No taste when mixed with Crystal Light", "rating": "5", "body": "Mixes good. No taste when mixed with Crystal Light. I stack with unflavored protein and creatine for my post workout drink. Recovery seems quicker.", "helpful": 0}, {"title": "I mix this into my water bottle that I drink ...", "rating": "5", "body": "I mix this into my water bottle that I drink during weightlifting. I really helps overcoming the fatigue that usually results from weightlifting.", "helpful": 0}, {"title": "Best price for 100% pure glutamine.", "rating": "5", "body": "I don't understand why other glutamine products out there cost so much more than this.  This is 100% pure glutamine.  I haven't been able to find anything online that states one glutamine brand is higher quality/more effective than another.", "helpful": 2}, {"title": "Great for the older weightlifter. Muscle recovery and additional benefits.", "rating": "5", "body": "I am an older 50s+ person that lifts weights. I feel that it is important to use Glutamine as a supplement in my muscle recovery. As we age our muscles recover slower so anything that benefits the recovery process, is something to consider using.", "helpful": 0}, {"title": "Great glutamine to help recover after a brutal workout", "rating": "5", "body": "Great glutamine to help recover after a brutal workout! Quality for an extremely affordable price! Don't lift legs again without this.", "helpful": 0}, {"title": "So far i love this, there is no jittery or heart pumping ...", "rating": "4", "body": "I mix this in my pre-workout powder and I noticed I am less sore than before. I would only use it if the workout routine is intense.", "helpful": 0}, {"title": "Simply The Best All Around Glutamine", "rating": "5", "body": "Does the job for half the price of the big names.  Its %100 glutamine so Its the exact same stuff without the big brand name price.", "helpful": 0}, {"title": "Awesome Stuff! NO better bang for the buck!", "rating": "5", "body": "I've used this product since it was on the shelf at Wal-Mart and I LOVE it. I was skeptical at first, as one should. For the price, this works flawlessly. I tested this product against my own workout routine during a 1 month period, just to see if my recovery was indeed sped up. I has reduced my recovery time by a good 2 days whereas without this product my recovery would take much longer and I felt weaker as a result. Buy this...it works. Period.", "helpful": 0}, {"title": "Tastes terrible.", "rating": "1", "body": "Tastes terrible.  couldn't stomach the taste.  Threw it out.", "helpful": 4}, {"title": "Great mixablilty and awesome price per serving", "rating": "5", "body": "Great mixablilty and awesome price per serving.", "helpful": 0}, {"title": "Good stuff and definitely the best for the price", "rating": "5", "body": "Good stuff and definitely the best for the price. It really helps with muscle soreness and recovery. Will purchase again", "helpful": 0}, {"title": "... but this product is much more effective and real easy to take", "rating": "5", "body": "I had been using glutamine capsules for digestive issues but this product is much more effective and real easy to take.", "helpful": 0}, {"title": "A must", "rating": "5", "body": "Helps me to recover from intense workouts. Helps with my gut issues. Great price and it really works.  A winner here", "helpful": 0}, {"title": "Gross.", "rating": "2", "body": "The taste is absolutely disgusting!", "helpful": 0}, {"title": "... but this product is much more effective and real easy to take", "rating": "5", "body": "I had been using glutamine capsules for digestive issues but this product is much more effective and real easy to take.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good for gut health", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Product as described.", "helpful": 0}, {"title": "Good stuff and definitely the best for the price", "rating": "5", "body": "Good stuff and definitely the best for the price. It really helps with muscle soreness and recovery. Will purchase again", "helpful": 0}, {"title": "Noticeable Results within a day for Muscle Soreness", "rating": "5", "body": "Definitely works for me. There are a lot of supplements that you read about the benefits of, and it's hard to tell whether or not it's working, and depending on why you're taking this, that still might be the case. Part of the reason I use this is for the health benefits associated with healing a leaky gut-- and I don't really have any way of knowing if it's working or not.", "helpful": 1}, {"title": "Great product and a must have for gym and daily use!", "rating": "5", "body": "Excellent product which I use daily can tell a big improvement in strength during my workouts, definitely recommend!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good", "helpful": 0}, {"title": "Mixes good. No taste when mixed with Crystal Light", "rating": "5", "body": "Mixes good. No taste when mixed with Crystal Light. I stack with unflavored protein and creatine for my post workout drink. Recovery seems quicker.", "helpful": 0}, {"title": "Quality glutamine at a reasonable price", "rating": "5", "body": "Quality glutamine at a reasonable price", "helpful": 0}, {"title": "Great price", "rating": "5", "body": "Great price for glutamine. Love this stuff", "helpful": 0}, {"title": "Great product", "rating": "5", "body": "Glutamine helps with recovery it really does help", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good recovery", "helpful": 0}, {"title": "If that's what you are looking for then this is perfect.", "rating": "5", "body": "It's glutamine powder.  If that's what you are looking for then this is perfect.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Serves its purpose", "helpful": 0}, {"title": "Better than another powder I tried", "rating": "5", "body": "Has no taste! Better than another powder I tried. I'll be purchasing this again.", "helpful": 0}, {"title": "Excellent", "rating": "5", "body": "Tasteless, odorless, mixes with any liquid. A very easy way to get the extra glutamine you may need.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "muy bueno", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Grazie!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "gets the job done!", "helpful": 0}, {"title": "Perfect!", "rating": "5", "body": "Exactly what I ordered. No taste at all. Perfect!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great Price - timely shipping.", "helpful": 0}, {"title": "Good powder for a great price!", "rating": "5", "body": "I like the price and the consistency of this Glutamine.", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "This does not mix very good and the taste it not good.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "as advertised they do the job well", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "muscles really rest better and is very long-lasting, powder do not waste", "helpful": 0}, {"title": "nice, would buy again", "rating": "5", "body": "nice, would buy again", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I like using glutamine and this product works well at a good price.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Item arrived on time, well packaged and ready for use.  Item performs as advertised.", "helpful": 0}, {"title": "Great glutamine to help recover after a brutal workout", "rating": "5", "body": "Great glutamine to help recover after a brutal workout! Quality for an extremely affordable price! Don't lift legs again without this.", "helpful": 0}, {"title": "fine", "rating": "5", "body": "fine", "helpful": 0}, {"title": "don't taste it so that's good.", "rating": "4", "body": "I use it in my protein shakes, don't taste it so that's good.", "helpful": 0}, {"title": "Good price", "rating": "5", "body": "I used this product after my gym workout. Very good value.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "gives me energy", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Works pretty well no complaints", "helpful": 0}, {"title": "Nice", "rating": "5", "body": "Shipped on time! First time trying & im sure it will work out", "helpful": 0}, {"title": "Great all around", "rating": "5", "body": "Mixes great.  No issues.  Great product to get your Glutamine intake for the day.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Def. a noticeable difference with my recovery time! no other training or supplement changes.", "helpful": 0}, {"title": "i really liked it so far and is a great product also ...", "rating": "5", "body": "i really liked it so far and is a great product also very affordable try to keep it like that.", "helpful": 0}, {"title": "Great money value!!!", "rating": "5", "body": "Great product!!! Does marvels for me !! Thanks", "helpful": 0}, {"title": "It's glutamine", "rating": "5", "body": "Its hard to beat for he price", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Will buy it again and again", "helpful": 0}, {"title": "Recommend", "rating": "5", "body": "I take it because I hear it helps with muscle recovery and I supose it does", "helpful": 0}, {"title": "Good texture and value.", "rating": "4", "body": "Great tuxture, no flavor or grit which is great.  Price is good, will probably get this again.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Slight sweet taste, great for my protein and milk mixes", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Recovery is wonderful after an intense workout.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Dissolves really well and doesn't add any kind of offensive or noticeable taste to anything.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good price and fast shipping", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Does it do anything? No idea, just read somewhere about taking glutamine helped GAINS.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "love it! been feeling great ever since i've starting taking this! will order again", "helpful": 0}, {"title": "Great!", "rating": "5", "body": "Good quality product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "i really love this product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent", "helpful": 0}, {"title": "Shredded", "rating": "5", "body": "Gained 15 lbs shredded muscle in one month. ..", "helpful": 0}, {"title": "Simple To Use", "rating": "5", "body": "I can use this like a powder sugar for a donut.", "helpful": 0}, {"title": "GOOD", "rating": "5", "body": "GOOD", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Well it works", "helpful": 0}, {"title": "Taste good", "rating": "4", "body": "Decent price.  Taste good.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product, easy hassle free purchase, have bought multiple times", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "powder, protein, mixes into drinks well.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "fast shipping, helps with recovery time.", "helpful": 0}, {"title": "Quality glutamine at a reasonable price", "rating": "5", "body": "Quality glutamine at a reasonable price", "helpful": 0}, {"title": "Faulty Packaging", "rating": "3", "body": "The product itself does what it should do, but you will not be able to just open, I had to smash the top of the container open in order to gain access to the powder. Faulty packaging", "helpful": 1}, {"title": "Four Stars", "rating": "4", "body": "Not sure if it is working yet or not.", "helpful": 0}, {"title": "Perfect", "rating": "5", "body": "It was perfect.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "So far so good. Too soon for results.", "helpful": 0}, {"title": "Two Stars", "rating": "2", "body": "to hard to mix, even tried a blender", "helpful": 0}, {"title": "Great!", "rating": "5", "body": "Good quality product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good product, exactly as advertised", "helpful": 0}, {"title": "Good stuff!", "rating": "5", "body": "I use this in my post protein drink. Good stuff!", "helpful": 0}, {"title": "Good stuff", "rating": "5", "body": "This stuff works good and even better for the price.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great price on glutamine", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great price and works as expected.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Best value for the money on Glutamine powder that I have found online.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "dose great for healing at night after a hard workout", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "Cmon guys give us some more powder", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "It worked ok.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good product fast recovery. Thanks", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Helps immensely with recovery.", "helpful": 0}, {"title": "It's glutamine", "rating": "5", "body": "Its hard to beat for he price", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "just like any other glutamine", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Nice product at a good price!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good price and fast shipping", "helpful": 0}, {"title": "which is perfect!", "rating": "5", "body": "Tasteless, which is perfect!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works great for my boyfriend", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Will buy it again and again", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Best Value on the Internet!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "i really love this product", "helpful": 0}, {"title": "Taste good", "rating": "4", "body": "Decent price.  Taste good.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good quality for the price", "helpful": 0}, {"title": "happy", "rating": "5", "body": "Good price, fast shipping", "helpful": 0}, {"title": "Ok", "rating": "3", "body": "Ok. Nothing to rave about", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Must have for gym buddies", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great price on glutamine", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good bang for your buck.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Tastes funky on its own", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Product as described.", "helpful": 0}, {"title": "nice, would buy again", "rating": "5", "body": "nice, would buy again", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "So far so good. Too soon for results.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "very good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I recommend.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product and price. Works really well.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Must have for gym buddies", "helpful": 0}, {"title": "meh", "rating": "3", "body": "Honestly for body fortress this should be cheaper. I'm hesitant to buy their products especially after buying their whey protein for years because it had higher protein per serving than any other brand, only to find out they were spiking and it actually had much less and there was a class action lawsuit. Look it up. Also they should include a scoop at this price. Cut some more corners BF, that's the way to a stellar reputation.", "helpful": 8}, {"title": "Four Stars", "rating": "4", "body": "fast shipping, helps with recovery time.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Nice product at a good price!", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "It works.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "works well", "helpful": 0}, {"title": "Great", "rating": "5", "body": "Bought for a friend", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works great for my boyfriend", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Helps immensely with recovery.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good in smoothies", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excellent !", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good product, exactly as advertised", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "fine", "helpful": 0}, {"title": "Good for Recovery!", "rating": "4", "body": "This is pure glutamine. It is great for recovery from intense workouts. If it takes a while for you to recover from workouts and remain sore for many days then you may want to try taking glutamine. Also good when you are cutting as it will help with recovery since your body will not be taking in enough nutrients as it normally would from a regular diet.", "helpful": 2}, {"title": "This is a really nice amino acid from a reputable company", "rating": "5", "body": "This is a really nice amino acid from a reputable company. I have taken glutamine since I have started working out and I don't plan on stopping anytime soon. Great for recovery when added right to a protein shake. Came in a full, sealed container and Is probably the most you can get for the price. Is a tad chalky if drank on its own with water but that is to be expected.", "helpful": 1}, {"title": "Great for the older weightlifter. Muscle recovery and additional benefits.", "rating": "5", "body": "I am an older 50s+ person that lifts weights. I feel that it is important to use Glutamine as a supplement in my muscle recovery. As we age our muscles recover slower so anything that benefits the recovery process, is something to consider using.", "helpful": 0}, {"title": "effective, economical, hard to open", "rating": "4", "body": "Hard to open! Really a bizarre thing, this canister. I got it to budge a little bit, but needed my husband tohulk it out.... now that he did the iniinitial opening, it's normal now.", "helpful": 0}, {"title": "4.5 Stars for Body Fortress 100% Pure Glutamine Powder", "rating": "5", "body": "I was introduced to the effectiveness of L-Glutamine particularly when used in conjunction with L-Arginine back in the 1990's. Its difficult to find one that tastes good. I will say this; if you intend on using the Arginine/ Glutamine combination to increase Growth Hormone Levels it seems to work. In fact it is one of the ways that endocrinologists stimulate the pituitary gland to verify GH levels in the body. There has been some degree of testing and studies to back that claim. However the doses required to do this type of supplementing are extremely high.", "helpful": 3}, {"title": "Awesome Stuff! NO better bang for the buck!", "rating": "5", "body": "I've used this product since it was on the shelf at Wal-Mart and I LOVE it. I was skeptical at first, as one should. For the price, this works flawlessly. I tested this product against my own workout routine during a 1 month period, just to see if my recovery was indeed sped up. I has reduced my recovery time by a good 2 days whereas without this product my recovery would take much longer and I felt weaker as a result. Buy this...it works. Period.", "helpful": 0}, {"title": "Haven't noticed any changes", "rating": "2", "body": "Been taking this a couple weeks now.  Haven't noticed any changes or feelings positive or negative.  granted, everyone is different, so it may work for you. Me, I'm not very impressed. Body Fortress products are typically low-end supplements anyhow, so I had low expectations.", "helpful": 1}, {"title": "buy this all the time great price and always take it with BCAA's and Protein ...", "rating": "5", "body": "buy this all the time great price and always take it with BCAA's and Protein about 3 times a day really see a difference.  I earned money from Ebates shopping on amazon its easy you shop and get paid they send you a check and you get a free $10 gift card just for signing up http://www.ebates.com/rf.do?referrerid=Hjf3h5bp2D3FQTgnsKrV5Q%3D%3D&eeid=26471", "helpful": 0}, {"title": "Great Product", "rating": "5", "body": "I stack it with many things but am experiencing my greatest gains so far. I am not sure if directly related but I like where it is taking me.", "helpful": 1}, {"title": "BF FAMOUS FOR FILLING JARS BARELY TO HALF OF JAR,LAST TIME PURCHASING THIS BRAND", "rating": "1", "body": "ANOTHER ONE OF THOSE CONTAINERS BARELY FILLED TO THE MIDDLE OF JAR POWDERS,I DON'T CARE WHAT KIND OF EXCUSE WOULD MAKERS GIVE ME ,TO ME THAT'S RIP OFF,WILL LOOK ELSEWHERE TO BUY AGAIN.", "helpful": 2}, {"title": "Five Stars", "rating": "5", "body": "Works good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "It's great", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "works well", "helpful": 0}, {"title": "Too much plastic", "rating": "2", "body": "A great price for a small amount of glutamine. However there is too much extra space inside of the container. The powder takes up about 1/4th of the space. Why would a company use extra plastic just to make it seem like you're getting more? Plastic is not good for the environment. We need to work together on this planet if the human race is going to survive. One of the ways we can do that is by not supporting companies who have so little disreguard for the environment.", "helpful": 0}, {"title": "Works well for chemo", "rating": "5", "body": "When we started chemo the nurse suggested adding this for joint pain and helping with the neuroopthy side effects. We couldn't get any locally so I ordered this from Amazon.  We were already into the chemo problems a few days before my wife actually took the glutamine.  It made a huge difference in both her pain and the tingling in her toes.  This brand is very finely ground and uniform.  It seems very clean.  We mix it into sports drinks and also into plain bottled water.  It mixes well in both, but seems to dissolve or stay suspended better in plain water.  It is tasteless in both and is detectable only as a very small amount of grittiness.  You have to kind of swirl the sports drink before every sip to keep the glutamine suspened. My wife drinks 3 bottles of sports drink a day, and the dosage recommended by the infusion nurse works out to 2 teaspoons per bottle of sport drink.  We have done 3 chemo treatments and have gone through 3 bottles, so it sems to work out to about 1 bottle per treatment cycle.", "helpful": 2}, {"title": "Five Stars", "rating": "5", "body": "muy bueno", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "very good", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "It works.", "helpful": 0}, {"title": "I love it especially because it is tasteless", "rating": "5", "body": "I love it especially because it is tasteless, and it dissolves very well and fast. I take 2 scoops per day, taken only once a day I added in my Amazing Grass Energy green superfood powder and water. But can easily be taken with plain water as it has no after taste or no taste at all.", "helpful": 1}, {"title": "Great price", "rating": "5", "body": "Needed glutamine powder for my recovery from weight training.  I can't provide a review for the actual product because I don't know what benefits I'm getting out of it.  But the price was great and I received it in a short time period.", "helpful": 1}, {"title": "Glutamine, first thing in the morning!", "rating": "5", "body": "When I wake up, I mix a TBS. of this powder in some water and drink it quickly. I am in my mid 40's and it really helps give me energy and helps my aches and pains. I have lower back trouble, and if I quit drinking this, the pain gets intense every time. Also, it is great for after surgeries, to help your body recover healthily, and an all around immune booster. I recommend this to everyone as a \"first step\" toward better health, in addition to a healthy diet. Drinking it on an empty stomach, just helps you to absorb everything quickly:-)", "helpful": 4}, {"title": "Five Stars", "rating": "5", "body": "Grazie!", "helpful": 0}, {"title": "Body Fortress Pure Glutamine Powder for Recovery", "rating": "5", "body": "I take a teaspoon of this product every day before going to bed and wake up feeling less sore. On workout days I mix it Body Fortress Super Advanced Creatine HP, Fruit Punch and Body Fortress Super Advanced Whey Protein, Strawberry for a awesome recovery drink right after my workout! I've been using this stack for about one month and it has helped me gain about 4lbs of muscle!", "helpful": 4}, {"title": "Glutamine", "rating": "5", "body": "Great recovery supplement. Take this after a lifting session and your soreness afterwards is diminished! Just be mindful of over-training. You feel so good with taking it that you almost forget about rest days!", "helpful": 1}, {"title": "Decent product but no scoop", "rating": "4", "body": "after I received the product I went to the gym immediately so I could take it after my workout and monitor my soreness, well after dumping out all the powder into a Ziploc bag I realized this thing doesn't come with a scoop you have to have your own, not a big deal all in all but would have been nice to know ahead of time since I don't bake I don't have a teaspoon just sitting around", "helpful": 4}, {"title": "Four Stars", "rating": "4", "body": "Good.", "helpful": 0}, {"title": "No complaints, good price.", "rating": "4", "body": "Compared to other glutamine powders I've tried in this past, this seems to be just as good and was much cheaper at the add-on price.", "helpful": 0}, {"title": "i liked", "rating": "5", "body": "mer really liked this product, but maybe someday buy that actually siene well when I take it.", "helpful": 0}, {"title": "Love it", "rating": "5", "body": "Hello,", "helpful": 0}, {"title": "Great for add-on", "rating": "4", "body": "This is great in my view for combining with other pre or post workout powders. Also good to have in general if you workout often.", "helpful": 0}, {"title": "Pain gone!", "rating": "5", "body": "Makes post workout muscle pain vanish. Just take some 30 mins before workout and immediately after workout and you'll see!!!", "helpful": 0}, {"title": "seem to be getting much wanted results when it comes to recovery", "rating": "5", "body": "taken morning in my sahke and afternoons after workouts, amazing increase in recovery time, and gluten free too,..BIG bonus there", "helpful": 0}, {"title": "So far, so good", "rating": "4", "body": "Recommmended by a friend, both my wife and I have been using for a few weeks and it has definitely helped in workout recovery.", "helpful": 0}, {"title": "$$", "rating": "4", "body": "Price was good. I'm not sure if this stuff will help my aching body but I'll give it a try.. EZ mix with juice & goes down well.", "helpful": 0}, {"title": "Good Product", "rating": "4", "body": "Does the job and for less than the competition. Glutamine is a very important supplement for muscle regeneration and recovery.", "helpful": 0}, {"title": "would recommend to everyone", "rating": "5", "body": "Good stuff..quick recovery..definitely recommend it to those who workout hard all week..this jar will laat you a long to time", "helpful": 0}, {"title": "LOVE IT.  WISH IT CAME IN BULK WITH THIS COMPANY...", "rating": "4", "body": "LOVE IT.  WISH IT CAME IN BULK WITH THIS COMPANY...Good product, best for the price!!!  This is the only glutamine for me...", "helpful": 0}, {"title": "great recovery when you have soreness", "rating": "5", "body": "does what it does, great recovery with soreness, add it to my protein powder, would refer to a friend. great price....", "helpful": 0}, {"title": "I have been using this a while and I do ...", "rating": "5", "body": "I have been using this a while and I do find I am less sore if I use this after my workout.", "helpful": 0}, {"title": "A good Boost", "rating": "5", "body": "I am naturally pudgy and puny. This helps build muscle very fast. No workouts in vain, with very impressive results.", "helpful": 0}, {"title": "get it", "rating": "5", "body": "great product. I take it every time i work out or play sports. should be essential to add to any other supliment", "helpful": 0}, {"title": "Best price for 100% pure glutamine.", "rating": "5", "body": "I don't understand why other glutamine products out there cost so much more than this.  This is 100% pure glutamine.  I haven't been able to find anything online that states one glutamine brand is higher quality/more effective than another.", "helpful": 2}, {"title": "good quality and purity", "rating": "5", "body": "I've tried many brands but this one seems to be the best and is a good value.", "helpful": 0}, {"title": "perfect", "rating": "5", "body": "coach set this is a great source of the glutamine that he said i need to keep taking", "helpful": 0}, {"title": "powder", "rating": "5", "body": "I have bought this product before through gnc.  I liked this because it was the same thing but for less.", "helpful": 0}, {"title": "Excellent!", "rating": "5", "body": "It is a good product, I take it before and after my workout and I think it has work perfect for me!", "helpful": 0}, {"title": "Add it to whatever", "rating": "5", "body": "I like to have this after I train hard. It is perfect for my casien powder chocolate shake. The price is better here then going to GNC.", "helpful": 0}, {"title": "Wonderful product", "rating": "5", "body": "This is a great price for this product. I used to use a different website to purchase supplements. I am happy that you carry this item.", "helpful": 0}, {"title": "BF Glutamine", "rating": "5", "body": "Great value for what I paid. It noticeably improves recovery and because its unflavored, it's easy to mix in with just about whatever.", "helpful": 0}, {"title": "No complaints, good price.", "rating": "4", "body": "Compared to other glutamine powders I've tried in this past, this seems to be just as good and was much cheaper at the add-on price.", "helpful": 0}, {"title": "i liked", "rating": "5", "body": "mer really liked this product, but maybe someday buy that actually siene well when I take it.", "helpful": 0}, {"title": "Love it", "rating": "5", "body": "Hello,", "helpful": 0}, {"title": "seem to be getting much wanted results when it comes to recovery", "rating": "5", "body": "taken morning in my sahke and afternoons after workouts, amazing increase in recovery time, and gluten free too,..BIG bonus there", "helpful": 0}, {"title": "Great for add-on", "rating": "4", "body": "This is great in my view for combining with other pre or post workout powders. Also good to have in general if you workout often.", "helpful": 0}, {"title": "$$", "rating": "4", "body": "Price was good. I'm not sure if this stuff will help my aching body but I'll give it a try.. EZ mix with juice & goes down well.", "helpful": 0}, {"title": "Good Product", "rating": "4", "body": "Does the job and for less than the competition. Glutamine is a very important supplement for muscle regeneration and recovery.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "This product works even when I go harder in the gym than usually!", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "good product but too small amount for the value.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Great supplement, that I cycle on and off on a rountine basis.", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "It does what it needs to do. Difficult to dissolve in water.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good amino acid in need during times of exertion and stress", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I just add this to my protein shakes prior to my workout.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good stuff. Recovery is a little better when using this.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Best value for glutamine... even cheaper than Wal-Mart!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excellent!  \"All that, and a Bag of Chips\"", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "Not a bad product for the $.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Great product, great price for it's quality!", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "haven't noticed any difference.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Best bang for your buck", "helpful": 0}, {"title": "As described", "rating": "5", "body": "A+as described", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent if the product they offer", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good recovery!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I love it and its very helpful", "helpful": 0}, {"title": "It works!", "rating": "5", "body": "This is my first time taking glutamine and I'm so surprised that it actually works! I over did my biceips workout on a monday. By tuesday i was looking like a t-rex unable to fully extend my arms out do the the painful soreness. The pain was no different by wednesday. By thursday the pain got only 10% better, I could still not fully extend my arm straight without trying really really hard. Finally this packaged came and I took the recommended teaspoon scoop with a glass of soymilk, and took a 2 hour nap. When i woke up.. WOW.. the soreness healed by 40%. This is amazing. I'm truly surprised this product or glutamine for that matter actually works.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great buy.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "thank you , very god products", "helpful": 0}, {"title": "Good product", "rating": "5", "body": "Good glutamine supplement.", "helpful": 0}, {"title": "Cheap and affordable", "rating": "4", "body": "Works great and good price.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "My go to glutamine powder!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good quality for the price", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Very good.... thanks", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good product!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excellent", "helpful": 0}, {"title": "Good Product", "rating": "5", "body": "works well", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Excelent", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "perfect", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "fine", "helpful": 0}, {"title": "LOVE!!!!!!", "rating": "5", "body": "The BEST supplement ever! I am able to work so much harder during my workouts it's insane. Of course, this means I get sore, but the recovery time for me has been greatly reduced. Instead of being sore to the point where I cant move or function, I  am able to be sore and still put 100% into my next workout! It's tasteless, so I mix this with water and I love that the container lasts a couple months. Great value. LOVE IT <3", "helpful": 0}, {"title": "Great Product", "rating": "5", "body": "I stack it with many things but am experiencing my greatest gains so far. I am not sure if directly related but I like where it is taking me.", "helpful": 1}, {"title": "its glutamine", "rating": "2", "body": "Bought this when glutamine was the craze, meaning it was a top 5 supp and a 'must-have' for any serious gym-goers supp stack. Never felt its effects like i do with proven and cheaper supps like creatine and beta alanine. Turned out that studies never found glutamine to be effective at all. Great. No wonder I never 'felt' it or had any kind of results from it as claims suggest.", "helpful": 1}, {"title": "Works better than advertised", "rating": "5", "body": "I bought this product from the advice of reviewers and I'm very impressed at how well it does. One scoop 30 before the workout and one after if you go hard and this helps all of your soreness and joint issues. For years I would use creatine and that helped but its gotten so expensive and this works just as well. Use warm water as it helps to dilute the crystals.", "helpful": 1}, {"title": "Tastes terrible.", "rating": "1", "body": "Tastes terrible.  couldn't stomach the taste.  Threw it out.", "helpful": 4}, {"title": "but the pain that I learned to love for so long is like 80% gone", "rating": "5", "body": "I lift weights very often, which can make my muscles hurt the next day. When my muscles hurt the next day, I lose motivation. The solution is glutamine! I take 2 teaspoons after my workout in combination with protein and creatine. The next day, I still know that I worked out my muscles, but the pain that I learned to love for so long is like 80% gone.  I've been through a lot of different varieties of glutamine and they all seem to work the same. This is one of the cheapest prices. I was skeptical since it's Body Fortress, but it works just fine. Since it's a pretty large manufacturer, you can assume that more quality assurance is available. Smaller companies may sell for less, but there has been a lot of reports of strong ammonia smells and such. Something I would never want to experience.", "helpful": 3}, {"title": "I love it especially because it is tasteless", "rating": "5", "body": "I love it especially because it is tasteless, and it dissolves very well and fast. I take 2 scoops per day, taken only once a day I added in my Amazing Grass Energy green superfood powder and water. But can easily be taken with plain water as it has no after taste or no taste at all.", "helpful": 1}, {"title": "Does its job and mixes well", "rating": "5", "body": "I definitely notice the difference day after a hard workout when I've taken this glutamine vs. when I haven't.  Soreness seems to be reduced, it mixes very easily with whatever liquid I'm using, and besides a slight powdery texture, it's virtually tasteless.  As a bonus, I've noticed that I can take this with other supplements that normally upset my stomach, and it eliminates that.", "helpful": 0}, {"title": "Blends great, virtually tasteless.", "rating": "4", "body": "It's way too early to write this review about results. Instead, I'm writing about how it blends/tastes. I use a little less than what they say - 1 tsp per 16 oz water versus 1 tsp per 8 oz water. But I drink a lot of water, so it doesn't matter. It dissolves completely (I used a blender bottle) and is almost entirely tasteless. It's really very impressive. I hope to see some results with soreness and will update then.", "helpful": 0}, {"title": "Great product", "rating": "5", "body": "If you are looking for a pre-workout and post-workout supplement, this is your powder.  It gives energy and aids in recovery by using natural glutamine, which your body produces anyways.  This product is safe and reduces the amount of soreness after workouts by increasing your body's glutamine level.", "helpful": 0}, {"title": "Actually works", "rating": "5", "body": "This is one of the few supplements I can say actually works. After a long hard workout I mix a spoonful of this stuff in some orange juice and feel 40% less sore the next day then I do if I don't take it. Awesome awesome product!!! I have ordered this same product 3 times and will continue to.", "helpful": 1}, {"title": "Works well for chemo", "rating": "5", "body": "When we started chemo the nurse suggested adding this for joint pain and helping with the neuroopthy side effects. We couldn't get any locally so I ordered this from Amazon.  We were already into the chemo problems a few days before my wife actually took the glutamine.  It made a huge difference in both her pain and the tingling in her toes.  This brand is very finely ground and uniform.  It seems very clean.  We mix it into sports drinks and also into plain bottled water.  It mixes well in both, but seems to dissolve or stay suspended better in plain water.  It is tasteless in both and is detectable only as a very small amount of grittiness.  You have to kind of swirl the sports drink before every sip to keep the glutamine suspened. My wife drinks 3 bottles of sports drink a day, and the dosage recommended by the infusion nurse works out to 2 teaspoons per bottle of sport drink.  We have done 3 chemo treatments and have gone through 3 bottles, so it sems to work out to about 1 bottle per treatment cycle.", "helpful": 2}, {"title": "BF FAMOUS FOR FILLING JARS BARELY TO HALF OF JAR,LAST TIME PURCHASING THIS BRAND", "rating": "1", "body": "ANOTHER ONE OF THOSE CONTAINERS BARELY FILLED TO THE MIDDLE OF JAR POWDERS,I DON'T CARE WHAT KIND OF EXCUSE WOULD MAKERS GIVE ME ,TO ME THAT'S RIP OFF,WILL LOOK ELSEWHERE TO BUY AGAIN.", "helpful": 2}, {"title": "Needed supplement for a workout", "rating": "4", "body": "This product did assist me with recovery after a workout along with sometimes taking it before a workout to make it through a tough one. Over all I did notice that when I did not take it, I felt that I was on a slower level of workout and would not complete sets. This could be a placebo effect but when i do take it I am able to continue through a rigorous workout with out any problems", "helpful": 0}, {"title": "Best Value", "rating": "5", "body": "So, I take this product in very high doses and pretty much daily. I take many supplements and work out. I have tried many glutamine supplements but this one is the best value hands down. It is really not even close to anything to compare. Hands down the best. Washes easily with water almost a sugar like taste, and I hate gross tasting supplements.", "helpful": 0}, {"title": "Great price", "rating": "5", "body": "Needed glutamine powder for my recovery from weight training.  I can't provide a review for the actual product because I don't know what benefits I'm getting out of it.  But the price was great and I received it in a short time period.", "helpful": 1}, {"title": "Body Fortress got some good stuff but tah-", "rating": "2", "body": "Compared to tabs I get little bitty muscle fiber snaps(good) when I flex a little less soreness(good) and a kind of muscle tension I like, I figure powder is easy to consume(good), but the results I need are not even really close(bad). I say potency for me just isn't there, one company with different products will definitely have different standards for each product.", "helpful": 0}, {"title": "Too much plastic", "rating": "2", "body": "A great price for a small amount of glutamine. However there is too much extra space inside of the container. The powder takes up about 1/4th of the space. Why would a company use extra plastic just to make it seem like you're getting more? Plastic is not good for the environment. We need to work together on this planet if the human race is going to survive. One of the ways we can do that is by not supporting companies who have so little disreguard for the environment.", "helpful": 0}, {"title": "Glutamine", "rating": "5", "body": "Great recovery supplement. Take this after a lifting session and your soreness afterwards is diminished! Just be mindful of over-training. You feel so good with taking it that you almost forget about rest days!", "helpful": 1}, {"title": "Good price, basic - like it should be", "rating": "4", "body": "There's little to be said about supplements like this.  You shouldn't feel any results.  It's unlikely you'll see any direct results from taking it and one brand of pure glutamine should be exactly the same as another brand of pure glutamine costing twice as much.  For this stuff, always buy it based on cost per gram.", "helpful": 0}, {"title": "Solid", "rating": "5", "body": "I really feel a difference in my health when i supplement with glutamine, and this is a good price. One issue with this brand is clumping. I keep it closed tight but i guess there is still some moisture getting in because its turned into a rock in the container. Powder still beats pills price wise so i will re-buy.", "helpful": 0}, {"title": "Great Product", "rating": "4", "body": "I dont know how true is after workout you lose alot of Glutamine, but it does recover you while you are workout so this is my during mix when im exhausted and need to recover verse a boost.", "helpful": 1}, {"title": "Highly recommend", "rating": "5", "body": "Love this product.  Can get more workouts in due to faster recovery time and don't have any issues with cramps or soreness like before using this product!", "helpful": 1}, {"title": "very good glutamine", "rating": "5", "body": "good product good price. Its very finely powdered glutamine and it works pretty well. I assume it's pretty pure quality was the cheapest price glutamine I've ever been able to find", "helpful": 1}, {"title": "OOOo Amazing", "rating": "5", "body": "I used to be so sore after working out, but not with this stuff.  I went to max muscle and it was 60 bucks for glutamine.  I'm sure it was suppose to be a better brand, but who cares.  This stuff works the same.", "helpful": 0}, {"title": "One Star", "rating": "1", "body": "Did nothing for me at all.", "helpful": 3}, {"title": "Works with great price", "rating": "5", "body": "This works as good as the fancy brand names that cost four times as much. Have purchased  Body Fortress products for years. Though have tried other brands on occasions, they do not work any better.", "helpful": 0}, {"title": "Aided joint pain", "rating": "4", "body": "The powder is a little gritty.  Not terribly unpleasant, but a little texture thing.  Just add it to liquid and drink quickly.  It has helped relieve some joint pain which makes the process of taking it easier.", "helpful": 0}, {"title": "terrible.", "rating": "2", "body": "Don't waste your money buy a better product. My previous glutamine from sprouts works way better than this.", "helpful": 1}, {"title": "Dissolves Nicely", "rating": "5", "body": "This is a new product for me and I haven't used it long enough to know if it will help or not. But it dissolves quickly and has no taste,other than possibly a very slight sweet taste. The shipping and packaging were first rate.", "helpful": 0}, {"title": "Great for recovery", "rating": "5", "body": "I add this to my Amino Energy drink and have noticed my muscle recovery has greatly improved. I used to be really sore and skip out on the next day work out, and now I keep on going.", "helpful": 0}, {"title": "Seems to be working.", "rating": "4", "body": "I've only been using this a short time along with BCAA's, creatine and citrine malate. I'm getting progressively stronger with solid consistent gains, limited soreness as well. Pretty happy with the results and the price was inexpensive.", "helpful": 0}, {"title": "good price, decent product", "rating": "4", "body": "I have had other glutamine that has worked better but I also payed a little more.. when it comes down to it this Glutamine is worth it for the price", "helpful": 1}, {"title": "It's not terrible tasting. Tastes very similar to regular water", "rating": "4", "body": "Seems to be helping me reduce soreness from workouts.  It's tough to measure how effective, but it seems to be working.  My brother remarked \"It looks terrible\" referring to the murky white water.  It's not terrible tasting.  Tastes very similar to regular water.", "helpful": 0}, {"title": "Works", "rating": "5", "body": "I got this to help with my sugar cravings and found it to really work.  I am able to avoid sweets and I am a sweet lover.  2 great side effects are I am less sore from my long training runs and I have no problem saying 'No' to a beer or wine cooler.", "helpful": 0}, {"title": "Good Glutamine", "rating": "5", "body": "I Use the bod fortress protein so I figured for the price I would try this as well. My tub didn't come with a scooper so I just used a measuring cup from the kitchen with the proper amount of volume.", "helpful": 0}, {"title": "Great stuff for after workout.", "rating": "5", "body": "My husband and sons have used this forever it seems after their workout and in their protein shakes.  This is the brand they keep asking me to order....so I have to think they are happy with the results they are getting.", "helpful": 0}, {"title": "Very mixable", "rating": "4", "body": "Although a lot of folks take it post-workout, I just mix some in with some other flavored amino acids and drink it while working out. Great combo, as it doesn't impact the flavor of the amino acid mix, which I love.", "helpful": 0}, {"title": "Great powder form Glutamine", "rating": "5", "body": "I mix this stuff in with my protein powder to help with muscle recovery. It seems to work great. I can't speak to the taste because I usually mix it with protein powder.", "helpful": 0}, {"title": "4/5", "rating": "4", "body": "I have definitely noticed a difference with my recovery.  I think this is helping.  My boyfriend works out much more intensely and he recently started using this as well--and he thinks it helps too.", "helpful": 0}, {"title": "great buy", "rating": "5", "body": "Most protein powders don't give you enough glutamine or don't give you any at all. Product is very cheap and good quality, taken after workouts will def see a improvement in muscle soreness and muscle fatigue.", "helpful": 0}, {"title": "Good value, average quality", "rating": "5", "body": "for me when it comes to simple amino acid supplement one is just about as good as another, I like the value here.", "helpful": 1}, {"title": "SlimGoody42", "rating": "4", "body": "It workd very well I did'nt have muscle soreness at all, there's not much more I can really say about it I mean it dose what it's supposed to do and at a great price.", "helpful": 0}, {"title": "Used this product for a good while. I am now using it for GI ...", "rating": "5", "body": "Used this product for a good while. I am now using it for GI problems instead of prescription drugs. Is working much better with no side effects.", "helpful": 1}, {"title": "Satisfied", "rating": "5", "body": "body fortress makes good quality products! i am completely satisfied with this one! It got here fast and i started using it once i got it! thanks!!!", "helpful": 0}, {"title": "AMAZING PRODUCT!", "rating": "5", "body": "helps with DOMS, it's a miracle product for sure.  I LOVE this stuff.  Seriously try it, it's so cheap you can't go wrong, and it lasts forever.  great quality, tasteless, add to your protein shakes.  AWESOME buy!!!", "helpful": 0}, {"title": "Recovery", "rating": "4", "body": "Important to use after a heavy workout. Take after a heavy workout to help with recovery process. Good price and works great compared to the more expensive brands.", "helpful": 0}, {"title": "Great product", "rating": "5", "body": "I love the amount that I got for the price! Can't taste it or tell any texture difference when I mix it in with my drinks. I'll be purchasing this again.", "helpful": 0}, {"title": "Worth the price", "rating": "4", "body": "Good price, mixes well but does have a taste thats not very good even though its not flavored, I have bought and used this glutamine multiple times and it is what it is.", "helpful": 0}, {"title": "It's Okay", "rating": "3", "body": "It's fine , its cheap and doesn't have all the much servings . It's body fortress something you can get at walmart.", "helpful": 2}, {"title": "Great price, reduces DOMS.", "rating": "4", "body": "I put a 5ml scoope in my post workout shake. Maybe it is placebo effect but I don't feel as sore.", "helpful": 2}, {"title": "Five Stars", "rating": "5", "body": "Great buy.", "helpful": 0}, {"title": "Good Product", "rating": "5", "body": "works well", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excellent", "helpful": 0}, {"title": "No noticeable effect", "rating": "1", "body": "I don't have any doubts as to the quality or purity of the ingredients of this product. But glutamine as a workout recovery supplement seems to be a trend and not much more. I don't notice any difference whether I take this or not, and a lot of the reviews here seem to be fake.", "helpful": 2}, {"title": "Four Stars", "rating": "4", "body": "Excelent", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "perfect", "helpful": 0}, {"title": "Good Glutamine", "rating": "5", "body": "I Use the bod fortress protein so I figured for the price I would try this as well. My tub didn't come with a scooper so I just used a measuring cup from the kitchen with the proper amount of volume.", "helpful": 0}, {"title": "4/5", "rating": "4", "body": "I have definitely noticed a difference with my recovery.  I think this is helping.  My boyfriend works out much more intensely and he recently started using this as well--and he thinks it helps too.", "helpful": 0}, {"title": "Works with great price", "rating": "5", "body": "This works as good as the fancy brand names that cost four times as much. Have purchased  Body Fortress products for years. Though have tried other brands on occasions, they do not work any better.", "helpful": 0}, {"title": "Great for recovery", "rating": "5", "body": "I add this to my Amino Energy drink and have noticed my muscle recovery has greatly improved. I used to be really sore and skip out on the next day work out, and now I keep on going.", "helpful": 0}, {"title": "GET BIG QUICK!!, this stuff really works ...", "rating": "5", "body": "GET BIG QUICK!!, this stuff really works!  I take on a daily basis, I can feel the difference in my muscle recovery time when I skip a day or two, I will definitely buy again.", "helpful": 0}, {"title": "Worth the price", "rating": "4", "body": "Good price, mixes well but does have a taste thats not very good even though its not flavored, I have bought and used this glutamine multiple times and it is what it is.", "helpful": 0}, {"title": "Great powder form Glutamine", "rating": "5", "body": "I mix this stuff in with my protein powder to help with muscle recovery. It seems to work great. I can't speak to the taste because I usually mix it with protein powder.", "helpful": 0}, {"title": "Should work", "rating": "5", "body": "One of the cheapest glutamine supplements out there but everything seems legitimate. No fillers, low price. If you're going to supplement glutamine, this should work.", "helpful": 0}, {"title": "SlimGoody42", "rating": "4", "body": "It workd very well I did'nt have muscle soreness at all, there's not much more I can really say about it I mean it dose what it's supposed to do and at a great price.", "helpful": 0}, {"title": "Recovery", "rating": "4", "body": "Important to use after a heavy workout. Take after a heavy workout to help with recovery process. Good price and works great compared to the more expensive brands.", "helpful": 0}, {"title": "Decent suppliment", "rating": "5", "body": "This does not come with a scoop or spoon, but the price is right so I cant complain. It is tasteless so you can mix it with anything. I use it for recovery.", "helpful": 0}, {"title": "Great!", "rating": "5", "body": "Can't beat the quality for the price.. it's worked so well for me i've bought another one. For anyone that wants to build muscle, this product is a must.", "helpful": 0}, {"title": "Great product", "rating": "5", "body": "I love the amount that I got for the price! Can't taste it or tell any texture difference when I mix it in with my drinks. I'll be purchasing this again.", "helpful": 0}, {"title": "Glutamine", "rating": "5", "body": "Nice and inexpensive glutamine powder. Does what it's supposed to do. I'm using the brand since last year and so far I have no complaints what so ever.", "helpful": 0}, {"title": "The product description is accurate, good quality and image. Fulfilled with my expectations. You can trust and purchase it witho", "rating": "4", "body": "The product description is accurate, good quality and image. Fulfilled with my expectations. You can trust and purchase it without any inconvenience.", "helpful": 0}, {"title": "Satisfied", "rating": "5", "body": "body fortress makes good quality products! i am completely satisfied with this one! It got here fast and i started using it once i got it! thanks!!!", "helpful": 0}, {"title": "works", "rating": "5", "body": "good value for the price. no bad side effects. muscles do not feel as fatigued after exercise. i would recommend it to anyone who works out.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "fine", "helpful": 0}, {"title": "Great buy", "rating": "4", "body": "My husband is a supplement nut. He was very happy with this purchase, price was great and came in good timing.", "helpful": 0}, {"title": "Good addition to other supplements.", "rating": "5", "body": "I add this to my creatine. I just mix the two into the same bottle and use it before a workout. Works great!", "helpful": 0}, {"title": "Seems Decent", "rating": "3", "body": "I purchased this a couple of times but probably won't purchase again since I take protein about 4-5 times a day and my protein has around 5 grams of glutamine per serving. Good to take if you only take protein a couple times a day but if taking more it is not needed", "helpful": 0}, {"title": "not happy with product", "rating": "1", "body": "Did not meet to my expectations, not happy with product.", "helpful": 0}, {"title": "I haven't seen any benefits from this", "rating": "1", "body": "This is supposed to help the muscles recover faster along with a bunch of other benefits, but I haven't felt any different. The muscles still take their sweet old time recovering, and I find myself on the toilet more than usual. Yes, I read this stuff gives you diarrhea. If that's all it does for you, then I don't see the need for it. Won't be buying again.  I don't need such nonsense when I already have IBS and hemorrhoids. This stuff isn't cheap but if it isn't going to work and only makes your stomach miserable, I see no point in it.", "helpful": 3}, {"title": "Not good for iPad mini", "rating": "4", "body": "Works great for iPhones, but it doesn't work for my iPad mini.", "helpful": 0}, {"title": "GREAT PRODUCT", "rating": "5", "body": "This really works to promote post workout recovery.  I am 68 years old and train 7 days/wk.....It really helps avoid the pain and soreness from high intensity routines (3 sets of 35 to 45 reps).", "helpful": 9}, {"title": "will throw away", "rating": "1", "body": "Too gross to use lol. Super nasty other supplements are available", "helpful": 1}, {"title": "I'm a believer", "rating": "5", "body": "I've been body building for 3 years now and fell victim to supplement craze (protein/bcaa/creatine/glutamine/etc..) and when I realized how much I was spending, I needed to figure out what was working and what wasnt working. After I finished all my supplements, I started to purchase only one supplement at a time, going through my list to see which supplement in my protein shake gave me the best recovery after my workouts.", "helpful": 1}, {"title": "Ewww", "rating": "1", "body": "This product taste disgusting and gave me stomach cramps..didnt take it long enough to see if it even works.", "helpful": 2}, {"title": "This product did nothing for my Glutes", "rating": "2", "body": "I have seen no increase in the the size of my gluteus maximus, I would buy it again because it tastes great! I like to eat it by the spoonful :D", "helpful": 1}, {"title": "Came with no scoop!", "rating": "1", "body": "I was really excited to receive the Glutamine power but once I got it. the container didn't come with a scoop inside. How am I suppose to know how much is 5 g by guessing..... And if I need to buy a scale, I would of never bought this product. I mad at now I have to guess whats five grams. I am so mad...", "helpful": 7}, {"title": "No Scoop, good post workout.", "rating": "3", "body": "Good for post workout drink mixes.  Tastes ok and works.  Only complaint is mine didn't have a scoop in the container so when it says 60 servings I may not get that because I'm guessing at the scoop.", "helpful": 0}, {"title": "I am pleased with how fast it shipped (less than two days) ...", "rating": "3", "body": "I have been using it for to months so far. The powder is flavorless BUT if you add too much it will thicken and turn into a slime that is hard to stomach unless further diluted. I am pleased with how fast it shipped (less than two days) and it was safely packaged and fully sealed.", "helpful": 0}, {"title": "Very good stuff, I recommend for any activies", "rating": "5", "body": "excellent product A+", "helpful": 0}, {"title": "Two Stars", "rating": "2", "body": "Did not work for me.", "helpful": 0}, {"title": "I hate receiving different than whats displayed items", "rating": "1", "body": "This is not the product that was displayed.  The one that i viewed had three types of Glutamine.  the product that i received only had l-Glutamine  I bought this product because trans anyl glutamine is the most absorbable as was displayed.  also the product that was displayed offered a much smaller scoop for accurate dosing.  I'm so upset.  I hate receiving different than what was displayed items.  Nothing is worse than a bodybuilder receiving inferior product.  I know what I am talking about!!!!  I have been lifting for years.  I bought this because it stood out from the rest.  But the product I received was just regular L-Glutamine.  If you look at the the label you will see three types of glutamine.  I bought two and received two different bottles.  This is why when it comes to supplements its better to buy in a store not the internet.  I hope who reads this can save money.", "helpful": 5}, {"title": "Received product is not what advertised!", "rating": "1", "body": "This product is a scam. As several people mentioned this product ingredients are not what listed in description and on product photos: it contains only regular L-Glutamine and not easier to absorb and  higher priced Alanyl-l-glutamine. This product may still work but I can't stand false advertisement and bait-and-switch tactics. Either put correct product photos and description or ship correct product. Shame on seller. Amazon - correct this product description and remove wrong photos!", "helpful": 5}, {"title": "Beware...Bait and Switch", "rating": "1", "body": "The Item I received is not as described.  In the product advertisement it is clearly stated that the ingredients are a “Unique blend of three types of glutamine: l-glutamine, glutamine peptides and alanyl-l-glutamine\".  I received a product that contained only the cheaper l-glutamine.  The packaging looks the same but the ingredients are different.  Classic \"Bait and Switch\"?", "helpful": 0}, {"title": "Wrong product delivered. looks similar but is NOT", "rating": "1", "body": "This was supposed to gave the following ingredients (L-Glutamine, Glutamine Peptides & Alanyl-L-Glutamine), and says so in the picture. But the one I received only says \"L-Glutamine\", which is likely just \"free-form\". Alanyl is the better form because it can be absorbed on an empty stomach. Same thing happened to my brother.", "helpful": 2}, {"title": "Missing ingredient", "rating": "2", "body": "Supossed to content Glutamine Peptides which is shown in the product pictures but it don't. This is false advertising. Very dissapointed.", "helpful": 4}, {"title": "NOW MISLABELED", "rating": "1", "body": "Used to have a glutamine blend, of free form, peptide, and alanyl-l-glutamine. It's still looking that way on the pictures on Amazon. But the latest jar I received (3.4.17) is now 100% free form.", "helpful": 0}, {"title": "Glutamine is crucial for muscle-building and this product is a ...", "rating": "5", "body": "Glutamine is crucial for muscle-building and this product is a worthy addition to any supplement plan. Unflavored, so it mixes well with any shake.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "never lets me down", "helpful": 0}, {"title": "It has no taste and dissolves just fine. But", "rating": "5", "body": "I bought this because my friend, a pro fitness bodybuilder, told me she used L Glutamine as part of her routine. This brand was highly rated on Amazon so I went with it. It has no taste and dissolves just fine. But, I kept reading up on it,and I'm pretty impressed. Aside from the body building stuff, it has other benefits.  One, a lot of people with Celiac use this to repair their gut when they've been 'glutened.\" I'm not certain if it helps, but it doesn't hurt.", "helpful": 1}, {"title": "missing peptides", "rating": "4", "body": "I was expecting this product to contain: L-glutamine,  glutamine peptides and L-alanyl-L-glutamine. The product I recieved only had L-glutamine and L-alanyl-L-glutamine, which does not match the picture in the discription of the product being sold.", "helpful": 1}, {"title": "A must have in your life !", "rating": "5", "body": "Absolutely amazing stuff a lot of us believe that it's just for bodybuilders or people exercising but if anyone has headaches or diabetes or any malady... Google to read up on it this product...actually if you have leg syndrome,  pain anywhere,  it actually gives you a sense of calmness and just makes you feel great...takes away aches and pains in your body...after using it the first time instant results. . as I continue to use daily, twice a day,  I've been on it about a week & 1\\2  I'm feeling better each day ...WONDERFUL. .. and it came ultra quick!!", "helpful": 7}, {"title": "This has completely changed the permeability of my gut within ...", "rating": "5", "body": "This has completely changed the permeability of my gut within a month of using. I could not consume dairy and gluten for the first time in YEARS without getting sick. I attribute it to this product. Also, when taken before bed it helps me sleep considerably well.", "helpful": 6}, {"title": "Works and tastes great!", "rating": "5", "body": "I definitely will purchase again.  This is not gritty like other powders and their is no funny taste.  Great value.", "helpful": 5}, {"title": "Just what you want", "rating": "5", "body": "I'm a pharmacist and this is my choice for glutamine, it's not usp but I don't really want to pay over double for those letters and the quality might not even be that different.  This dissolves nicely in Gatorade after a couple shakes, I mix in creatine too to make a nice preworkout hydration drink with a bcaa drink to round it out.", "helpful": 2}, {"title": "Received product different from description", "rating": "2", "body": "Product I received is not as shown in the photos. The ingredient list in the photos lists 3 things. My product only has 2 ingredients and is missing the Glutamine Peptides.", "helpful": 4}, {"title": "Good stuff!", "rating": "5", "body": "Works as promised, good quality, good price. Got the info about Muscle Pharm from [...] and their products have passed all the test, that means there are not any banned substances added. It is very important to me, because I have had bad experience with some supplements earlier.", "helpful": 2}, {"title": "Wonderful Well Priced Product", "rating": "5", "body": "Ordered this glutamine to help retain muscle during a cut. Shipping was on point but I was originally sent the MP Creatine by accident which looks almost identical to the MP Glutamine canister. Received on a Saturday. I contacted amazon the same day and the shipped the correct item(Glutamine) that day, bumped the shipping to 2 day shipping and let me keep the creatine (the creatine at the time was barely over $10) which I already had, but was thankful for. Received the correct product on Monday, just 2 days later.", "helpful": 1}, {"title": "Does exactly what it's suppose to!", "rating": "5", "body": "Every version seems to be getting better. Mixes well with other items used in Pre & Post Workout Shakes.", "helpful": 0}, {"title": "The best.", "rating": "5", "body": "Are usually take half a scoop with my assault pre-workout from muscle Farm and then I use one scoop mixing it with my BCAA FROM MP and then I take one scoop right after work out for my muscle recovery has No flavor which is good because I usually mix it with other products.", "helpful": 0}, {"title": "False advertising ingredients", "rating": "1", "body": "Lies!!! Don't trust nutrition label photographed on the product listing here because the only ingredients are L glutamine, much easier to find then what I thought I was getting. False advertising. unhappy.", "helpful": 1}, {"title": "in which is good for its price", "rating": "5", "body": "Wow; I used Body Fortress Glutamine; in which is good for its price; but this one is better; it looks very white bright; while Body Fortress is some kind of bone-white color. This has very similar price as BodyFortress and Quality is better.", "helpful": 1}, {"title": "Also the soreness is not as bad. Again I believe this is supposed to help ...", "rating": "5", "body": "My understanding of glutamine is that it helps repair muscle after workouts. I used to get a serious burn from a leg workout but after taking this the fire in my legs is gone. Hmmm. Something is working. Also the soreness is not as bad. Again I believe this is supposed to help recover muscle fibers after a workout and so far I believe in this product. Will buy again.", "helpful": 1}, {"title": "My daughter takes it for cravings", "rating": "5", "body": "A bit under the tongue as needed seems to reduce drug cravings (i.e. nicotine and worse stuff). It also helps heal the bowel, important because she (a young adult) has lots of food sensitivities (gluten, dairy, etc...) She always asks for more of this stuff when gifts are due, been using it for years, so that's a testimony in itself.", "helpful": 4}, {"title": "Great Product", "rating": "5", "body": "I really love this stuff, I worked with a personal trainer 3 times a week and use it while working out.  I feel a huge difference since using it, my muscles aren't as sore and I have more energy.  It's also great for your immune system, with flu season coming I won't go to the gym without it.", "helpful": 1}, {"title": "Recover", "rating": "5", "body": "Mixes great and definitely helps me recover after my workouts.  No clumping, no aftertaste, no fillers just pure glutamine and it does the job for a cheap price.", "helpful": 5}, {"title": "Muscle Pharm is a great company this product is quality like always", "rating": "5", "body": "I am cure entry taking this mixed in my drinks such as powerade. You can't taste it or smell it when it's mixed in. (Note I haven't used this in water). It mixes welll except you might need to give your drink a shake or a stir every now and then. I'm currently taking it because it's supposed to be good for your immune system. Overall I am getting better but I can't say if that's from this or the medicine. If you're thinking about taking this supplement it's very easy to use. You mic the powder in a drink or like a smoothie. It does not come with a measuring spoon. I plan on taking this after I am sick and will add to the review if my immune system has impoved.", "helpful": 0}, {"title": "Good value", "rating": "5", "body": "I decided to try this as opposed to the (expensive) brand I was buying at a local health store. I really like this. It seems to stay suspended in the water longer, which sounds bad but is actually good so you don't end up with a lot at the bottom of your glass. It's very fine, not clumpy or gritty. I put it 1 scoop in a tall glass of water and can't see it. If I do 2 scoops in the same amount of water and doesn't all dissolve, but still isn't bad. It doesn't have a taste, but if you put it in straight water the water will taste different (like how bottled water brands can taste different-- nothing bad).", "helpful": 0}, {"title": "Way better than the pills", "rating": "5", "body": "We purchased this to try out in lieu of glutamine pills. I was super skeptical at first, because I really love the ease of just taking a few pills right before bed. Now I prefer the powder. Totally tasteless, no texture to it. I just add it to my protein and it tastes exactly the same as it always does. It works just as well as the pills, I'd say even better.", "helpful": 0}, {"title": "The quality changed?", "rating": "3", "body": "My last order the quality was great! But this recent order the quality isn't what it says it is and it smells and taste different. It isn't pharmaceutical quality anymore and I can tell by the smell and taste. I might have to find a new glutimine product.", "helpful": 0}, {"title": "Helps my husband's nerve numbness in fingers and toes caused ...", "rating": "5", "body": "Helps my husband's nerve numbness in fingers and toes caused by chenotherapy.  He say he definately has noticed a lessing amount of numbness sunce he has started in this supplement a month or so ago.", "helpful": 2}, {"title": "I am happy with the product", "rating": "5", "body": "I am happy with the product.  I am not sure that Glutamine is what I was in need of to obtain any new gains though.  I take the recommended amount and if it does anything it is very minor.", "helpful": 0}, {"title": "Excellent Products", "rating": "5", "body": "Product was delivered quickly and is up to the standards of all other Glutamine supplements...  Muscle Pharm is a very reliable and versatile company.", "helpful": 0}, {"title": "This supplement really does help with recovery. I lift ...", "rating": "5", "body": "This supplement really does help with recovery. I lift at least 5 days a week and sometimes I do two-a-days with heavy weight. The soreness isn't much of a detriment as it was before.", "helpful": 0}, {"title": "Very good glutamine, little expensive", "rating": "4", "body": "Very good product here, and you can feel the difference the next day of lifting when you don't take it. It certainly works, and has very little to no taste. I started buying MetRx instead of this however because of unit price and they seem equally effective.", "helpful": 0}, {"title": "Consistently come back to Muscle Pharm products...", "rating": "5", "body": "Tried other companies and this brand gives me best results. I use there Creatine along with this Glutamine and have no problems at all. Easy to mix with juices or protein shakes, I stir into my oatmeal and cereals with no change of taste.", "helpful": 0}, {"title": "Does work for me to some degree....", "rating": "4", "body": "Every body is different so the only way to know for you is to try it. I mix half servings of Amino 1 and MP Glutamine support and drink twice daily. As I have gotten older the DOMS from my leg workouts have been at times crippling. I have noticed some relief with these products and they mix well in a shaker and the taste is palatable.", "helpful": 0}, {"title": "Ironman recommended.", "rating": "5", "body": "Take it from an ironman, this is a great product!!", "helpful": 1}, {"title": "No taste and easy to mix", "rating": "5", "body": "Not sure how much this helps but I've made it part of my daily routine adding to water.  Doesn't add any nasty tastes and easy to add.", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "No peptides as advertised", "helpful": 1}, {"title": "Works amazing", "rating": "4", "body": "This product worked for me right away and has got me off powerful pain killer for my stomach.", "helpful": 0}, {"title": "Don't be Sore.. anymore!", "rating": "5", "body": "If reading this I hope you understand what the purpose of this product is, and it is good at what it does. The pricing was good for the amount you get, their packaging looks and functions great, and the product performs its duty. I noticed several hours and days of soreness subside much faster using this when not on anything. Muscle Pharm is coming up to be a major player in quality goods, and this is a testament to that statement.", "helpful": 4}, {"title": "Great Product", "rating": "5", "body": "This mineral supplement is now a staple for post workout recovery. Without it, I would get sore from working out and stay sore for days. Now I barely notice the soreness at all. It allows me to continue my workouts without the pain. Just remember to give your muscles a rest every once in awhile!", "helpful": 2}, {"title": "Ironman recommended.", "rating": "5", "body": "Take it from an ironman, this is a great product!!", "helpful": 1}, {"title": "VERY good L-Glut", "rating": "5", "body": "So full disclosure. I normally only use products from All Pro Science. I love them, but they had sold out of L-Glutamine. Well this Glut is awesome. Like most, there is no \"taste\" so to speak, but unlike most, even better than APS', this glut mixes GREAT. I now use it in my thirst quencher during my workouts it mixes so good. May end up using the MP product permanently. I've been using L-Glut though for a while, so I can't speak on whether or not there is a difference in recovery, It usually takes me 2 days to recover from a particular set, compared to the old 4 days. So this product is on par in that regard. Definitely recommend.", "helpful": 1}, {"title": "Best I've found", "rating": "5", "body": "Noticeably faster recovery and minimal soreness after workouts compared to other Glut's I've tried. Been using for 3 months. No flavor, no clumping. Completely dissolves with minimal shaking. I'm not even thinking of looking around anymore for another quality Glutamine. This is the one!", "helpful": 1}, {"title": "Accidentally bought this instead of creatine", "rating": "4", "body": "I was trying to get the MP creatine but accidentally purchased this. The bottles are designed exactly the same so I made a mistake. Either way, I still used it. I don't know if it did anything, but it had no taste and was easy to mix which is a plus in my book.", "helpful": 1}, {"title": "MP Glutamine", "rating": "5", "body": "have been seeing better results over time. taste was pretty normal for glutamine. would recommend to others. three more words", "helpful": 4}, {"title": "Simple Glutamine Product", "rating": "4", "body": "Muscle Pharm Glutamine Mixes easily and with anything.  Has no taste and found it to be cheaper than other places.  Has 5g of Glutamine and 60 Servings.  Did not upset my stomach and I find it convenient.", "helpful": 1}, {"title": "Love it.", "rating": "5", "body": "MP products are the best.  Love everything about them.  This supplement is a little bit gritty in my post workout shake, but that is the worst thing I can say about it.  Great product.  Great price.", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "No peptides as advertised", "helpful": 1}, {"title": "Four Stars", "rating": "4", "body": "i mix it in with my pre workout drink i think it works lol", "helpful": 0}, {"title": "Great deal on the item and have enjoyed using it", "rating": "5", "body": "Works as expected. Great deal on the item and have enjoyed using it.", "helpful": 0}, {"title": "Great", "rating": "5", "body": "High quality product for a reputable name.  Works great. Dissolves great.  Awesome price.", "helpful": 0}, {"title": "Good product. helps me with recovery", "rating": "4", "body": "Good product . helps me with recovery", "helpful": 0}, {"title": "and the product is great.", "rating": "5", "body": "Arrived on time, and the product is great.", "helpful": 0}, {"title": "Great value. Highly recommended", "rating": "5", "body": "Helps reduce soreness after long workouts. Great value. Highly recommended.", "helpful": 0}, {"title": "always love musclepharms products", "rating": "5", "body": "always love musclepharms products.", "helpful": 0}, {"title": "This suplement is very good", "rating": "5", "body": "This  suplement is very good", "helpful": 0}, {"title": "Has a little flavor", "rating": "5", "body": "If you put it in water you will taste it. In drinks with more flavor, like some protein drinks, you might not be able to taste it which is nice.", "helpful": 0}, {"title": "Great!", "rating": "5", "body": "Very fine powder for fast absorption.", "helpful": 0}, {"title": "Excellent Products", "rating": "5", "body": "Product was delivered quickly and is up to the standards of all other Glutamine supplements...  Muscle Pharm is a very reliable and versatile company.", "helpful": 0}, {"title": "Has a little flavor", "rating": "5", "body": "If you put it in water you will taste it. In drinks with more flavor, like some protein drinks, you might not be able to taste it which is nice.", "helpful": 0}, {"title": "Item is great!", "rating": "5", "body": "Product came as described and quickly!  You can't go wrong with Muscle Pharm products.  One of the more trusted supplement companies in my book.", "helpful": 0}, {"title": "Great Supplement", "rating": "5", "body": "I've been suffering with Ieaky gut for decades. This is fantastic supplement to heal the gut and stop muscle loss. Not just for weightlifters!", "helpful": 0}, {"title": "good stuff", "rating": "5", "body": "very pleased with this purchase, i have used all sorts of supplements over the years and this is a great product, very good experience here.", "helpful": 0}, {"title": "good deal", "rating": "5", "body": "this stuff dissolves good and has no taste. it mixes with anything. very good price as well. i would suggest this if you need glutamine.", "helpful": 0}, {"title": "No taste and easy to mix", "rating": "5", "body": "Not sure how much this helps but I've made it part of my daily routine adding to water.  Doesn't add any nasty tastes and easy to add.", "helpful": 0}, {"title": "Best glutamine on the market.", "rating": "5", "body": "does what it says. Awesome for recovery (keeps you from getting sore) tasteless, mixes great with protein shakes or a glass of milk.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Never tried \"Muscle Pharm\" before, so far, I'm liking it. Mixes well and no bitter taste. Results are promising.", "helpful": 0}, {"title": "Average?", "rating": "3", "body": "I've never used glutamine before, I mixed easily with anything, didn't notice anything from it, half way through it. .", "helpful": 0}, {"title": "Glutamine :)", "rating": "5", "body": "Mixes great with my BCAA's. Good stuff Muscle Pharm, I order this whenever I start running low on my Glutamine.", "helpful": 0}, {"title": "Great price compared to other retail stores", "rating": "5", "body": "Have always used this product, extremely effective post workout. Great price compared to other retail stores.", "helpful": 0}, {"title": "Great product", "rating": "5", "body": "Fantastic product. Easy mix,  always had desired results when using this product. Helps a lot with recovery.", "helpful": 0}, {"title": "Great product", "rating": "5", "body": "Is all that I expected. It's cheap, and does what is supposed to do.", "helpful": 0}, {"title": "Great product!!", "rating": "5", "body": "Love this product. Much better than other ones out there. Easy to mix and drink. Priced well too.", "helpful": 0}, {"title": "Best glutamine for the price", "rating": "5", "body": "Best glutamine for the price.  Add some to your pre and post workout shake and you're good to go.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Like most products it's hard to tell a change but over time it seemed to have the desired effect.", "helpful": 0}, {"title": "Works amazing", "rating": "4", "body": "This product worked for me right away and has got me off powerful pain killer for my stomach.", "helpful": 0}, {"title": "Great", "rating": "5", "body": "High quality product for a reputable name.  Works great. Dissolves great.  Awesome price.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "So far so good this stuff works better than other glutamine tablets I have taken before.", "helpful": 0}, {"title": "its my favourite brand. It arrived on time", "rating": "5", "body": "I always buy the Muscle Pharm Glutamine, its my favourite brand. It arrived on time.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "One of the most abundant amino in the body; get some and take 2 to 5 grams per day.", "helpful": 0}, {"title": "Great value. Highly recommended", "rating": "5", "body": "Helps reduce soreness after long workouts. Great value. Highly recommended.", "helpful": 0}, {"title": "Good product. I order one every month", "rating": "5", "body": "Good product.  I order one every month.  Use it in my post workout shake.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "a great addition to your protein shake to have advanced muscle recovery.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Very good glutamine powder. Very soluble compared to others I've tried.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "This stuff makes me much less sore the next day if I take it at night.", "helpful": 0}, {"title": "Great deal on the item and have enjoyed using it", "rating": "5", "body": "Works as expected. Great deal on the item and have enjoyed using it.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "love it kill it my God recovery is amazing worth it love it try it", "helpful": 0}, {"title": "No noticeable results, horrible taste", "rating": "2", "body": "Added this product to my stack and have been mixing it with my post workout shake. I have grown in strength and size in the past months, but that is expected, and I didn't notice any difference that this product added. Ive even laid off glutamine for 3 weeks and have seen no difference in my performance or size. Compile that with the bad aftertaste this product leaves, I would not recommend it. Stick with your protein and creatine, this isn't needed.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great effective product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "tastes good works great!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Very good product and prompt service.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "a great addition to your protein shake to have advanced muscle recovery.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excelent", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good", "helpful": 0}, {"title": "Best glutamine on the market.", "rating": "5", "body": "does what it says. Awesome for recovery (keeps you from getting sore) tasteless, mixes great with protein shakes or a glass of milk.", "helpful": 0}, {"title": "Wonderful Well Priced Product", "rating": "5", "body": "Ordered this glutamine to help retain muscle during a cut. Shipping was on point but I was originally sent the MP Creatine by accident which looks almost identical to the MP Glutamine canister. Received on a Saturday. I contacted amazon the same day and the shipped the correct item(Glutamine) that day, bumped the shipping to 2 day shipping and let me keep the creatine (the creatine at the time was barely over $10) which I already had, but was thankful for. Received the correct product on Monday, just 2 days later.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Got exactly what I wanted", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Best glutamine. Don't feel fatigued after a hard workout", "helpful": 0}, {"title": "Good experience", "rating": "4", "body": "Good Product, good shipping. Good experience", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "I'm still waiting for my muscles to pop....", "helpful": 0}, {"title": "and the product is great.", "rating": "5", "body": "Arrived on time, and the product is great.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "item arrived on time and met expectations", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Best Glutamine i've ever had hands down", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great for post workout muscle recovery.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great - love all muscle pharm products", "helpful": 0}, {"title": "Good product. helps me with recovery", "rating": "4", "body": "Good product . helps me with recovery", "helpful": 0}, {"title": "Great!", "rating": "5", "body": "Very fine powder for fast absorption.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Very good product and prompt service.", "helpful": 0}, {"title": "its my favourite brand. It arrived on time", "rating": "5", "body": "I always buy the Muscle Pharm Glutamine, its my favourite brand. It arrived on time.", "helpful": 0}, {"title": "Average?", "rating": "3", "body": "I've never used glutamine before, I mixed easily with anything, didn't notice anything from it, half way through it. .", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good supplements", "helpful": 0}, {"title": "good deal", "rating": "5", "body": "this stuff dissolves good and has no taste. it mixes with anything. very good price as well. i would suggest this if you need glutamine.", "helpful": 0}, {"title": "Great product", "rating": "5", "body": "Is all that I expected. It's cheap, and does what is supposed to do.", "helpful": 0}, {"title": "Great product; Great price", "rating": "5", "body": "Muscle Pharm has great products Works as advertised; greatly lowers my soreness after exercising.  HIgh quality product from a reputable company.  Highly recommended!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excelente!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "nice", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "A+", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "this Product is excellent", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Got exactly what I wanted", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "tastes good works great!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great product and price.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great effective product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "GOOD for my training~", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "easy to mix and drink", "helpful": 0}, {"title": "Boost recovery", "rating": "4", "body": "high quality love it", "helpful": 0}, {"title": "Good", "rating": "5", "body": "Seems to be working", "helpful": 0}, {"title": "Works as described.", "rating": "5", "body": "Works as described.", "helpful": 0}, {"title": "OMG", "rating": "4", "body": "Mixes soooo easily. Before bed, I just toss a scoop into a cup of water & swirl it around. Gulp & done. It doesn't taste great, but it's not terrible either. Serving suggestion is easy to follow. Love to packaging.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent recovery", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excellent product.", "helpful": 0}, {"title": "One Star", "rating": "1", "body": "Kills my stomach.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "good supplement.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I really love it", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good supplements", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Will buy again.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Love this stuff", "helpful": 0}, {"title": "Good source of tasteless Glutamine, but TINY SCOOP!", "rating": "4", "body": "Let's face the facts: Glutamine is basically Glutamine, no matter who sells it. It's like protien: You're not shopping for quality whey protien as much as a taste you can live with and maybe some nice balance elements included. While I would highly recommend glutamine to anyone who works out and wants the hurt to dull down in a reasonable timeframe, this review is not about the effects of glutamine, it's about the little things that, to me, set this product above the others.", "helpful": 4}, {"title": "A workout must have...", "rating": "5", "body": "No complaints.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great product", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "does the job", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Really helps", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good quality", "helpful": 0}, {"title": "One Star", "rating": "1", "body": "Taste awful", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excelente!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good deal.", "helpful": 0}, {"title": "Good Buy", "rating": "5", "body": "Works well", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Very good", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "very Good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excelente", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excelent", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Buy it!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "love it", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "perfect", "helpful": 0}, {"title": "on time", "rating": "5", "body": "on time", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Awsome", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Thanks", "helpful": 0}, {"title": "I'll update if things change, but this stuff made ...", "rating": "1", "body": "I'll update if things change, but this stuff made me gag. It wasnt odorless or tasteless. It left a bitter taste in my water and protein shakes. I had to throw out my shake as I couldnt finish it.", "helpful": 0}, {"title": "Recovery drink mix", "rating": "3", "body": "It helps with recovery, but not to the extent that I need it to. My muscles are still sore, but I can tell they are not as sore as they would be if I were not taking this product.", "helpful": 0}, {"title": "good", "rating": "5", "body": "Very good and tastes good and Khvevuahsst with ahead excellent Flaahs the following exercise tired strongly recommend it to those who practiced a municipal Bldnq game", "helpful": 0}, {"title": "Muscle Miracle", "rating": "5", "body": "This product works, it does help in muscle recovery.  The pain after work out is not too much compared to not taking it. Excellent product.  This is my second order.", "helpful": 0}, {"title": "Great supplement", "rating": "5", "body": "This supplement easily mixes with anything and seems to be helping with recovery after workouts. From what I can tell this is a great muscle building supplement.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "nice", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good", "helpful": 0}, {"title": "It Works", "rating": "5", "body": "My husband is very satisfied with this product. After reading all the pros of Glutamine he will continue getting this product.", "helpful": 0}, {"title": "No results yet", "rating": "3", "body": "I have been using glutamine for a month now. I havent noticed any effects. I will probly use the rest and not reorder.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works well and has a great taste!", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Excellent!!!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excelente", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "ok", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "Not the best thing", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excelente", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": ":)", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent", "helpful": 0}, {"title": "I use this everyday...", "rating": "5", "body": "I use this everyday as part of my regimen.  .5 teaspoon of this mixed with .5 teaspoon MP Creatine in a protein shake.", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "ok", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": ":)", "helpful": 0}, {"title": "Gluten-Full", "rating": "1", "body": "I am gluten intolerant and it is not said that gluten intolerant people should be careful.", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "You dont really need glutamine to get big.", "helpful": 0}, {"title": "MET-RX Glutamine ; Beautiful Science !!", "rating": "5", "body": "The best by far for me, right ingredients  , best quantity and quality for the price for me, period !!!!!", "helpful": 4}, {"title": "Get ya some. Heal that gut.", "rating": "5", "body": "My workout recovery time has decreased (improved) a little bit, I'm not nearly as sore after a strenuous workout. But I originally bought GNC's brand to heal a messed up stomach after a couple rounds of Augmentin (Amoxicillin antibiotic). In combination with probiotics (and Kombucha) my stomach feels rock solid again. The probiotics helped quite a bit, but it wasn't until I added Glutamine that my gut completely healed. I'm a believer. I think it has helped my focus a bit at work as well.", "helpful": 0}, {"title": "IT WORKS!!!!", "rating": "5", "body": "I am not an avid supplement user, this is my second supplement in 13 years (I used creatine in my late teens).  I workout about 3 hours a day including cardio after weigh training, my daily routine included being sore every day.  After taking this glutamine for a few days my aches are gone and I can push harder every day! I did some research and this was my final choice, I must say I am happy with it! Based on my experience I would recommend this product to everyone!", "helpful": 5}, {"title": "Met-RX Building the perfect Beast", "rating": "5", "body": "Said it once said it twice- Met-Rx products Rock. Love this L Glutamine you won't find any better for the price. Made in the USA, helps with recovery from heavy workouts, good taste I mix it with whey protein and leave it set for 5 minutes, stir it for another 15 seconds and BAM a truly enjoyable drink. Does it help build bigger pipes (gun show) I can't say that but it has certainly aided in extended exercise periods and more noticeable strength. Building the perfect Beast.", "helpful": 0}, {"title": "but never been more satisfied than MET-Rx", "rating": "5", "body": "I have used L-Glutamine from other manufacturers as well, but never been more satisfied than MET-Rx, Really works as mentioned as a recovery booster. After a heavy workout left with real Soreness, a scoop in the post workout and a scoop next morning on an empty stomach. boom there you go.. good to go lift.", "helpful": 1}, {"title": "Easiest Powder to use", "rating": "5", "body": "I have tried different companies that make L-Glutamine and this is by far the easiest to use.  I add it everyday to my camelbak bottle and drink it during the day.  This product mixes completely and there is no real taste that I can see.  Will definitely buy this again.  Great Product!", "helpful": 3}, {"title": "Helps, but don't expect miracles!", "rating": "3", "body": "I'm 34 and I train 5 days a week, 3 of which are weights days. I take two scoops of this along with Protein and Creatine after my workouts (early morning, fasted). Since taking L-Glutamine I think it has helped my recovery (I feel less sore the next day). But don't expect miracles either- you still know you did a workout! I'm going to see how I go without this when it runs out and see how much of a difference I notice then. Still, worth trying anyway.", "helpful": 0}, {"title": "Sore No More!", "rating": "4", "body": "I <3 glutamine. Truly. It'll get you back in the gym even after a heavy leg day. And if you don't know what I mean, keep walking chicken legs!", "helpful": 4}, {"title": "Graet product", "rating": "5", "body": "I use this before and after my workouts. I take 11grams at a a time. I also take it before bed and have great sleep. I use this with VPX Friction.  Glutamine is a good way to raise your testosterone level as you get older. All natural and important amino acid in your body especially if you are working out heavy.", "helpful": 0}, {"title": "Best ever", "rating": "5", "body": "Get you some!", "helpful": 0}, {"title": "The jury is still out on whether this supplement makes ...", "rating": "4", "body": "The jury is still out on whether this supplement makes any real difference, but the price was right for the amount received.", "helpful": 0}, {"title": "Really helps me recover after intense workout. I take ...", "rating": "5", "body": "Really helps me recover after intense workout. I take it 3 times a day in the morning, after workout and before bed.", "helpful": 0}, {"title": "Love it", "rating": "5", "body": "I mix it with OJ every day.  It helps with muscle recovery/energy.  Most workout shakes have glutamine in it, but I feel like you don't absorb it as well when it is mixed with many other items.  I feel that I require more glutamine than some people for some reason.  It's also useful for people with IBS.", "helpful": 0}, {"title": "Good price", "rating": "4", "body": "Very good for the money, and I got it for myself.  However, my husband saw, a large red container on the counter top.  He joined in and started using it.  It lasts over a month.  Good price!", "helpful": 0}, {"title": "Works great.", "rating": "5", "body": "Bought this to use in addition to the BCAA powders we use and it's a good product.", "helpful": 0}, {"title": "Personally I think its a complete waste of money", "rating": "1", "body": "I didn't notice that this did anything when I took it. Personally I think its a complete waste of money. Go spend it on high quality food instead.", "helpful": 0}, {"title": "Good product", "rating": "5", "body": "This is great powder. Adding it to your post-workout drink is very beneficial, I can tell when I forget to have it post lifting. Has very little taste and mixes easy.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "awesome product with gr8 results.", "helpful": 0}, {"title": "perfect!", "rating": "5", "body": "Was exactly what I was looking for, and arrived very fast.  Great for mixing into my pre and post workout drinks, and a scoop before bed helps me sleep!", "helpful": 2}, {"title": "Great Price-", "rating": "5", "body": "Great Product and price point.", "helpful": 0}, {"title": "Great product at a really fair price.", "rating": "5", "body": "Recommended for weight lifters and also cuts down chemical cravings, but you didn't hear it from me! ;)", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excellent product!!", "helpful": 0}, {"title": "Great Product!", "rating": "5", "body": "Very good product...have been using it for some time and can't beat the price.,", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Everything ok, I usually use this product.", "helpful": 0}, {"title": "fantastic!", "rating": "5", "body": "the best one!!! It works the best for my daughter's fibromyalgia.", "helpful": 0}, {"title": "I would recommend this product", "rating": "5", "body": "Met-RX L-Glutamine definitely makes me recover from my workouts faster and have more muscle gains. It also has many servings. I would recommend this product.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excelente 100%", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "It came in 3 bottles.", "helpful": 0}, {"title": "great purchase", "rating": "5", "body": "exactly what i ordered.  right price", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Great especially during radiation.", "helpful": 0}, {"title": "good stuff", "rating": "5", "body": "I use glutamine every day and this is a good value.  Otherwise they are all pretty much the same. x x x", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Perfect !", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "It has helped me a lot in my days doing workout. tks", "helpful": 0}, {"title": "Awesome stuff, no taste and mixes well with protein", "rating": "5", "body": "I push it hard in the gym 6 days a week so I need help recovering. This stuff, fish oil, and ZMA and your muscle will hardly ever be sore again.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Very good product without flavor and sugar! That's good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "exactly as expected", "helpful": 0}, {"title": "Love this product", "rating": "5", "body": "Love this product, helps feed the muscles after a solid workout. Also helps provide a deep sleep when taken right before bed time", "helpful": 0}, {"title": "Great for recovery", "rating": "5", "body": "Great product and does what it is supposed to do,thanks soo much!", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "good", "helpful": 0}, {"title": "Will order again!", "rating": "5", "body": "Awesome for recovery. Call tell a difference after 1 month that I'm able to bounce back quicker after my workouts.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Very good product without flavor and sugar! That's good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "It has helped me a lot in my days doing workout. tks", "helpful": 0}, {"title": "Warning", "rating": "3", "body": "This seems to be an excellent product and a great value, however I read that you should not overdo this product.  Read about Glutathione precursors.", "helpful": 3}, {"title": "Five Stars", "rating": "5", "body": "Everything ok, I usually use this product.", "helpful": 0}, {"title": "great", "rating": "5", "body": "great powder for tummy and large amount", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "its glutamine use 20- 30  grams daily", "helpful": 0}, {"title": "great purchase", "rating": "5", "body": "exactly what i ordered.  right price", "helpful": 0}, {"title": "It is what it is", "rating": "5", "body": "I took this big, big, big jar to my Dr. and she says that's exactly what she wanted me to use. I use the tiny scoop that comes with it, and dump 1/3 of a scoop of it into my coffee every morning. I'm doing great.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Great especially during radiation.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "awesome product with gr8 results.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great", "helpful": 0}, {"title": "recommended 200%.", "rating": "5", "body": "It helps me a lot with the post-trainning pain, recommended 200%.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great taste, mixes great!", "helpful": 0}, {"title": "Thanks", "rating": "5", "body": "I started using this product a few months back and was excited to see it available via Prime.  I didn't hesitate and purchased it right away.", "helpful": 0}, {"title": "Good Supplement", "rating": "4", "body": "Easy to take and easy to mix.  If you are looking for a good glutamine supplement this is the product to buy.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great product and service", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product for recovery S/P workout - great deal - prompt delivery!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great stuff", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "GOOD", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "EXCENTE", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great service, awesome item.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Excellent", "helpful": 0}, {"title": "I recommend this.", "rating": "5", "body": "Great product at a good price!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excelent!!!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great stuff", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Gooog", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good product and a good service", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excelente", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great..", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good products", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Best deal around.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good price", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "ok", "helpful": 0}, {"title": "great stuff", "rating": "5", "body": "met rx great product, not trying to sell anyone. everyone responds to each supplement differently but this product works for me. I hve bought 4 tubs of this brand already. i however switch it out every other bottle with MHP glutamine 12 hour release just because it doesnt hurt, and I like trying new brands to see if there is a difference, but i found MHP and METRX work best for me, glutamine wise anyways. works greats not as sore after work outs and i use twice a day on workout days and once on none workout days.", "helpful": 0}, {"title": "Bitter and a little hard to dissolve", "rating": "3", "body": "This is pretty much what I expected, plain white powder. When mixed with plain water it is far too bitter to tolerate, mixed with something sweet it is fine. Also it is a bit hard to dissolve. I have found mixing it in a bottle with a lid is better than trying to mix it in a glass. It takes a minute of shaking to fully dissolve.", "helpful": 1}, {"title": "Worth a try, works for me.", "rating": "4", "body": "Research study supports the use of L-Glytamine to restore muscle loss during intense training, also reduces sugar cravings. Give it a try.", "helpful": 1}, {"title": "It is what it is", "rating": "5", "body": "I took this big, big, big jar to my Dr. and she says that's exactly what she wanted me to use. I use the tiny scoop that comes with it, and dump 1/3 of a scoop of it into my coffee every morning. I'm doing great.", "helpful": 0}, {"title": "Amazing", "rating": "5", "body": "Excellent product. My  wife was suffering from muscle pain until she started using this.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "ok", "helpful": 0}, {"title": "One Star", "rating": "4", "body": "Does fine", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "good", "helpful": 0}, {"title": "Does it really matter?", "rating": "3", "body": "I'm not sure glutamine makes much of a difference. I think too often these supplements are used, but people aren't putting in the necessary hard work to really make gains. At the end of the day if you get enough protein and work out hard as possible pushing past your previous workout you will make gains glutamine or not. So I say stick with protein, per-workouts, and creatine. The rest is just wasted money.", "helpful": 1}, {"title": "Lives up to its reviews", "rating": "5", "body": "Very pleased with this product.  I have been suffering with rashes for about two months.  Following online advice from Dr Axe, I altered my diet to exclude all grains and refined sugar.  I have also eliminated most dairy and legumes and started using bone broth.  Still the healing process was slow and discouraging.  Dr Axe recommended Glutamine as a supplement and I chose this one because of its high ratings.  I add a scoop of the powder to a pint jar of cool water and sip it throughout the day.  The powder has a very mild taste that is not unpleasant when mixed in this proportion.  I believe it has accelerated the healing process since each morning there is less redness and the uncomfortable itching is nearly gone.  I have reordered since I don't want to run out.", "helpful": 1}, {"title": "Happy, came sealed and no bad side-effects so far.", "rating": "5", "body": "I had heard about this before in the past and being ill you get to the point where you will just try about anything.  I was worried as I am super sensitive to products.  I had no reaction to this one. It doesn't taste funny and was easy to drink.  I have not taken it long enough I don't think to really see a benefit but I know it is good stuff from what i have heard as well as doctors have mentioned it.  The seller shipped fast and it was sealed so I am a happy customer.", "helpful": 1}, {"title": "I'm also pleased with how the product performs", "rating": "4", "body": "I suffer from IBS and cannot tolerate most supplements due to fillers. Had no problem with any AMRAP product. I'm also pleased with how the product performs. Expensive that's why only 4 stars but I guess that's the price you pay for quality.", "helpful": 4}, {"title": "Great Product!!", "rating": "5", "body": "Great product!  I've been bed ridden for many months. I needed help getting my strength back. I noticed a big change after using it for a couple of weeks. Still taking it every day!", "helpful": 1}, {"title": "Clean and Digests well", "rating": "4", "body": "Clean, and digested easily. Went to two unnamed local shops looking for AAMRAP or something similar...all had artificial crap added.", "helpful": 2}, {"title": "Very happy!", "rating": "5", "body": "I have several digestive problems and my nutritionist recommended this.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Very good product. Works very well. dilutes easy. tastes great.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Great Stuff. Helps with muscle recovery", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Worth every penny", "helpful": 2}, {"title": "Five Stars", "rating": "5", "body": "meets expectation", "helpful": 0}, {"title": "It works, but I wish there was more", "rating": "4", "body": "It works. I have leaky gut and I feel the difference when I take this. It also mixes well in room temperature liquids  and doesn't taste bad. However, it's four stars because I played 34 dollars for a small container that they don't even fill to the top.", "helpful": 1}, {"title": "Very happy!", "rating": "5", "body": "I have several digestive problems and my nutritionist recommended this.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Excellent product! Very clean. Will buy again. Used it to heal leaky gut.", "helpful": 2}, {"title": "Five Stars", "rating": "5", "body": "Very good product. Works very well. dilutes easy. tastes great.", "helpful": 0}, {"title": "Don't waste your time with anyother product", "rating": "5", "body": "Helps me recover from the most brutal workouts! I take one scoop after working out and then another one right before bed. Don't waste your money on anyother lame glutamine and buy AMRAP", "helpful": 1}, {"title": "I never work out without it!!!", "rating": "5", "body": "I bought this on the recommendation of my personal trainer. It really helps me by significantly reducing soreness after working out. I highly recommend this product to anyone who works out.", "helpful": 1}, {"title": "I liked this glutamine powder because it isn't mainly filler type ...", "rating": "5", "body": "I liked this glutamine powder because it isn't mainly filler type product.  Therfore you use a lot less to accomplish the same goal.  No flavor so can easily be taken in plain water.  I will be purchasing again", "helpful": 1}, {"title": "Muscle spasms helped", "rating": "4", "body": "This has helped greatly with muscle spasms that have been extremely painful, worse than \"charlie horses\", and lasting 10-15 minutes at a time. Using 2 scoops a day in water has almost completely eliminated it. I'm considering adding a 3rd smaller does to wipe out the spasms completely.", "helpful": 0}, {"title": "Glutamine", "rating": "3", "body": "I believe the chemistry is good and seems to work to help prevent cramping after a workout.  This product is a bit more expensive than some others which may be because of the container.  There are other Glutamines which seem to be as good and are a bit of a better bang for your buck.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Worth every penny", "helpful": 2}, {"title": "Four Stars", "rating": "4", "body": "Great Stuff. Helps with muscle recovery", "helpful": 0}, {"title": "The first time I tried it was when I drank ...", "rating": "5", "body": "The first time I tried it was when I drank it before I went to sleep days that I workout, and I definitely noticed a difference. I wasn't really sore as I would be without it; in addition, I don't feel mentally exhausted especially when it's gym day. Arguably, the price could be a little less, but that's debatable.", "helpful": 0}, {"title": "Bonus for your muscles", "rating": "5", "body": "Awesome nutritional supplement. Easy to mix into smoothies, blends well and there is no stomach upset. Since using this product, I have quicker muscle recovery post work out. My skin looks better than ever too. I am north of 60 yrs and keeping my body healthy is priority one.", "helpful": 0}, {"title": "I know I am not near as sore as I ...", "rating": "5", "body": "I know I am not near as sore as I used to be and I feel my muscles recover quickly.  I'll need to give this one a thumbs up.", "helpful": 1}, {"title": "Muscle Recovery time seems faster", "rating": "5", "body": "Seems to help recovery time. 2nd buy for me for this product.  Pleased with the results.", "helpful": 1}, {"title": "Highly satisfied", "rating": "5", "body": "Great product. No bad taste or smell. Decided to try a more inexpensive version after this and was disappointed so I will be purchasing this again. Definitely noticed improvement in healing and recovery while taking this.", "helpful": 0}, {"title": "Works great!", "rating": "5", "body": "I don't care for the taste and recommend mixing with juice (tried mixing with kombucha and that did not go well). I've noticed a difference in my sleep and recovery. I can't wait to try more products from AMRAP.", "helpful": 0}, {"title": "Works/ pumps up your workouts", "rating": "5", "body": "I use this before I workout and it helps kick things in high speed. Sometimes I take it at bedtime. No side effects for me.  I'm very sensitive- I take synthroid 50 mg daily.  I have a NonCancerous tumor in my head.", "helpful": 0}, {"title": "Great product", "rating": "5", "body": "The product is actually very good. No after taste and easily dissolves.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "meets expectation", "helpful": 0}, {"title": "Great product!", "rating": "5", "body": "Dissolves quickly and easily and does not affect taste.", "helpful": 1}, {"title": "Excellent Product", "rating": "5", "body": "This L-glutamine was very smooth and effective.  I bought it because my cheaper brand was not in stock at the time. I would buy it again if my other brand is unavailable in the future.", "helpful": 0}, {"title": "Excellent Product", "rating": "5", "body": "Great product. Timely delivery. Happy customer!", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "This product is a good clean glutamine powder.", "helpful": 1}, {"title": "This is a good product. It mixes easily and well and has ...", "rating": "4", "body": "This is a good product.  It mixes easily and well and has no taste.", "helpful": 1}, {"title": "I was very satisfied with this product", "rating": "5", "body": "I was very satisfied with this product.  It arrived in a very timely manner and was intact.  The powder itself is very easy to digest it did not have any flavor and I as able to mix it with water.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "My husband loves this product", "helpful": 1}, {"title": "Glutamine high quality pure.", "rating": "5", "body": "Pure Glutamine is important for post workouts. This product is high quality Non GMO, Gluten Free And pharmaceutical grade, it's the way to go for natural  muscle recovery.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Product seems to be working.", "helpful": 1}, {"title": "Really great product for muscle recovery", "rating": "5", "body": "Really great product for muscle recovery. If I am in a heavy cycle or doing high intensity, this speeds up my recovery aiding in my muscle gains.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great", "helpful": 1}, {"title": "Good quality!", "rating": "5", "body": "Great product with clean sources I will most definitely order this again.  I am a nutritional therapist and seek the purest quality!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Yes", "helpful": 1}, {"title": "Kills my crap-food cravings!", "rating": "5", "body": "Very good product. Light and flavorless, mixes easily in water without a shaker.  I use it to stop my cravings for carbohydrates.", "helpful": 0}, {"title": "Satisfied with product", "rating": "5", "body": "I bought this product to use in conjunction with Dr. Axe's recommended supplement protocol for leaky gut syndrome. I'm very satisfied with the results.", "helpful": 0}, {"title": "... mix with CoQ10 and Aloe and it is working wonderfully for her muscle issues", "rating": "5", "body": "Bought it for my wife on the suggestion of her naturopath to mix with CoQ10 and Aloe and it is working wonderfully for her muscle issues.", "helpful": 0}, {"title": "decent glutamine. I can tell its quality. I've ...", "rating": "5", "body": "decent glutamine.  I can tell its quality.  I've been buying top quality BCAA's and glutamine for years and this brand does not dissapoint.", "helpful": 0}, {"title": "No Bull", "rating": "5", "body": "Good clean product. Helps with leaky gut ,and is the most abundant amino acid in the body .Will purchase again.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I have chronic Lyme disease and this product clears my head and helps me recover from working out.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Ordered it for a family member have no understanding of the quality I will ask them in 60 days", "helpful": 0}, {"title": "Good quality!", "rating": "5", "body": "Great product with clean sources I will most definitely order this again.  I am a nutritional therapist and seek the purest quality!", "helpful": 0}, {"title": "Kills my crap-food cravings!", "rating": "5", "body": "Very good product. Light and flavorless, mixes easily in water without a shaker.  I use it to stop my cravings for carbohydrates.", "helpful": 0}, {"title": "No Bull", "rating": "5", "body": "Good clean product. Helps with leaky gut ,and is the most abundant amino acid in the body .Will purchase again.", "helpful": 0}, {"title": "It's a very good product! One of the best that I have ...", "rating": "5", "body": "It's a very good product! One of the best that I have taken. It helps me survive after a hard workout.", "helpful": 0}, {"title": "Clean and effective", "rating": "5", "body": "Mixes easy, tasteless, and when combined with my bedtime shake helps me sleep better.  Great value.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I have chronic Lyme disease and this product clears my head and helps me recover from working out.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Ordered it for a family member have no understanding of the quality I will ask them in 60 days", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "pure and amazing product!!  mixes well and has helped decrease my recovery time! Thanks AMRAP!", "helpful": 0}, {"title": "pure and good for you", "rating": "5", "body": "Mixes really well in water, hardly no taste. No added anything, pure and good for you.", "helpful": 0}, {"title": "then this product is excellent.", "rating": "5", "body": "If this is what you are looking for, then this product is excellent.", "helpful": 0}, {"title": "Perfect! Just what I needed", "rating": "5", "body": "Perfect!  Just what I needed, and it worked and helped as expected.", "helpful": 0}, {"title": "Very good!", "rating": "4", "body": "Product is as described. High quality. Did what I wanted it to do!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Awesome product consistent with everything else in the AMRAP line!", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "I'm not a fan of the taste but I can feel and that it works good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works great, feel better the next morning. Highly recommended.", "helpful": 0}, {"title": "Top Notch", "rating": "5", "body": "Best glutamine that I've ever tried .. Pricey but worth it", "helpful": 0}, {"title": "... using this for a few weeks now and I love it!", "rating": "5", "body": "I've been using this for a few weeks now and I love it!", "helpful": 0}, {"title": "Will buy again", "rating": "5", "body": "Dissolves well, tasteless. I love it! Just what I need.", "helpful": 0}, {"title": "Great", "rating": "5", "body": "Only been using about a week now.... So far, so good!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great packaging and very good quality.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Love this product.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "love the product!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Love it THANKS!", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "it tastes good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "A  bit pricey", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Awesome product consistent with everything else in the AMRAP line!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good stuff.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product !!!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works great", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works for me!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great supplement!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product for recovery.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great supplement", "helpful": 0}, {"title": "This product caused me to feel dizzy and have heart ...", "rating": "4", "body": "This product caused me to feel dizzy and have heart palpitations. If I had read anywhere that these side effects were possible I would have never purchased this since you do not seem to offer a return policy. I changed my stars due to their excellent customer service and the super greens were great. Reputable company.", "helpful": 0}, {"title": "Fantastic product! I use a scoop along with a ...", "rating": "5", "body": "Fantastic product!  I use a scoop along with a banana, scoop of peanut butter, and frozen berries to make as awesome post workout shake.  Highly recommend this product as part of your nutritional routine.  My muscle recovery time is now twice as fast as it used to be and my performance has gotten much better.", "helpful": 1}, {"title": "So far so good, i've been taking this since it arrived on ...", "rating": "5", "body": "So far so good, i've been taking this since it arrived on April 5th and started about two scoops per day as my condition is chronic and has never been addressed ever since; so i am building up the resistance over time and most likely will take as needed or one scoop per day.  What i like about the fine powder is i mixed it in with my Gatorade and no extra taste what so ever, just gives it the plop plop fizz fizz looks, lol...", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good stuff.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works great", "helpful": 0}, {"title": "Great", "rating": "5", "body": "Extremely fast delivery! Great quality.", "helpful": 1}, {"title": "chemo doctor recommended this. We have not been taking it long ...", "rating": "5", "body": "chemo doctor recommended this.  We have  not  been taking it long enough to know if it will help, but it was delivered really fast. Looking forward to see if it actually will work for us.", "helpful": 0}, {"title": "Good", "rating": "5", "body": "Bought this for my mother- she is having chemo and it is supposed to help with numbness in her hands and feet. Not sure if it will but it is worth a try.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good", "helpful": 0}, {"title": "... is my first time using this and it was great. Just a bit more expensive than other", "rating": "4", "body": "This is my first time using this and it was great. Just a bit more expensive than other brands", "helpful": 0}, {"title": "A great product! Easy to take and has little to ...", "rating": "5", "body": "A great product!  Easy to take and has little to no flavor, even when mixed with just water.", "helpful": 0}, {"title": "Great product! Great to assist in recovery", "rating": "5", "body": "Great product!  Great to assist in recovery.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I really liked your product. Thank you.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Simply good stuff !!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "👍", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Yes I love it ❤️", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "It's great!!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good product.", "helpful": 0}, {"title": "works great- good product.", "rating": "5", "body": "works great.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Very good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "🌞", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "L8ke", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent product... would purchase again...", "helpful": 0}, {"title": "This product did no good to me", "rating": "1", "body": "This product did no good to me.  It did upset my stomach.  I am not going to buy this product again.", "helpful": 3}, {"title": "I ordered this for my husband because glutamine is supposed ...", "rating": "3", "body": "I ordered this for my husband because glutamine is supposed to be helpful for those who have had part of the intestine or colon removed. He has used it as directed for a month and sees no indication of improvement related to his GI system, nor energy level, nor muscle strength. He is in his early 70's. He will continue to use it for a few more weeks to see if he notices any benefits.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Arrived sooner than expected and was priced well", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good product.", "helpful": 0}, {"title": "This product is great! In just a few days I noticed a ...", "rating": "5", "body": "This product is great! In just a few days I noticed a difference in my strength and endurance during lifts. I bought two bottles, I love it!", "helpful": 0}, {"title": "Best glutamine that you can ever get in the market", "rating": "5", "body": "Best glutamine that you can ever get in the market! I tried a few out there and nothing compete to this one.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "It works!", "helpful": 0}, {"title": "L-Glutamine", "rating": "5", "body": "These pills are easy to swallow,  and are gluten free.  Comes with 30 pills and help a wide variety of ailments and the most important ones to me are muscle growth as I need this for my ankle which I broke the depression and anxiety that comes with breaking a bone along with joint and muscle pain that is just a few.  I loved using this product and the benefits of using it.  I feel really good after taking it and I am happy to say that the pain has decreased and I don't feel as anxious as I usually do.  I really like how this worked and  I am recommending it to anyone as it helps with a variety of different ailments!  The price on this is reasonable for the things that it helps with pure ingredients.", "helpful": 0}, {"title": "NOTE: IT'S ONLY 30 per bottle! Not a good value.", "rating": "2", "body": "I just got this and I was appalled by the quantity. I take responsibility for not reading the fine print, but I paid $22 for 30 capsules and it says a serving is 2. So this bottle is only two weeks worth.", "helpful": 1}, {"title": "Made me sick", "rating": "1", "body": "Not sure what type of fillers this has. But it made me very sick.", "helpful": 0}, {"title": "Did nothing for me", "rating": "1", "body": "I purchased this product after my doctor diagnosed me with hypoglycemia (low blood sugar) and a sugar addiction. He said to take one or two of these when I crave sugar and it will help. He said the brain runs on two things, sugar and L-Glutamine. Ok. I tried what he suggested but I have to say I felt nothing after taking these. The sugar craving did not go away at all. I did like that this product is vegetarian. It is over 30 days so I can not return it.", "helpful": 0}, {"title": "Since starting this supplement I notice less aches and discomfort ...", "rating": "5", "body": "Since starting this supplement I notice less aches and discomfort after work outs.  The main reason I take it is for digestive/gut health. I have only been taking it for about a month but I have noticed an improvement in my symptoms.", "helpful": 0}, {"title": "Working great so far", "rating": "5", "body": "So far I am a week in and these have helped a lot with GI symptoms. I've been looking for something to make me feel better that was natural and these are definitely it.", "helpful": 0}, {"title": "Will not buy again", "rating": "2", "body": "Was quite disappointed that you had to take two pills a day so you only got 15 days worth and four of the capsules in the bottle had broken open so very dissatisfied with the product quantity and price for the quantity", "helpful": 0}, {"title": "Completely satisfied!", "rating": "5", "body": "I used to take this in powdered form, but the capsules are so much easier to use and work just as well. Completely satisfied!", "helpful": 0}, {"title": "This product is awesome, I feel so much better since starting to ...", "rating": "4", "body": "This product is awesome, I feel so much better since starting to use it. It is great for those who work out regularly but also for regular use and great for the intestines and colon. I was sent this for free.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Please carry this again!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Sure it works on leaky gut", "helpful": 0}, {"title": "Take Control over sugar.", "rating": "5", "body": "I had my doubts about this controlling my intense sugar craves. I take one in the morning and sometimes one at night.", "helpful": 1}, {"title": "not just for weight lifters!", "rating": "5", "body": "I have GERD and use this to fight off the constant threat of indigestion. I know this isnt the most common usage of this product, but it works amazingly in that way for me. I recommend it to anyone else who battles indigestion issues like I do.", "helpful": 1}, {"title": "Faster Recovery", "rating": "5", "body": "I love it, essential to faster recovery and helps control sugar cravings. A must for anyone that works out. Highly recommended.", "helpful": 5}, {"title": "i love glutamine", "rating": "5", "body": "Glutamine really works at fixing leaky gut and with protein distribution. It really helps out a lot due to the fact that I lift a lot where I work, it makes it so that I'm not so sore the next day!! One the most important amino acids to have this product really works.", "helpful": 1}, {"title": "No more sugar craving.", "rating": "5", "body": "Love it. Works great!! If i get sugar craving i take 2 tablets and is gone within 10mins.", "helpful": 9}, {"title": "This capsule are great, I have ulcer and I was always in ...", "rating": "5", "body": "This capsule are great, I have ulcer and I was always in pain or bloat it. Since I am taking glutamine capsule I don't have heartburn, or feel like burping all the time which is embarrassing. It really make a great difference in just a week so I am planning to keep taking this capsule for many more years.", "helpful": 3}, {"title": "Yes I liked the product", "rating": "4", "body": "Yes I liked the product. I was taking it to help curb my sugar cravings and it was a tremendous help. I kept up take it twice a day and saw a big drop in my cravings HOWEVER what I didn't realize because when I was searching for ways you reduce the cravings I wasn't smart enough to check the side effects but what glutamine can do is raise your glucose or blood sugar so if you are a diabetic please rethink taking this supplement.", "helpful": 1}, {"title": "help for IBS", "rating": "5", "body": "Good for leaky gut!", "helpful": 6}, {"title": "Grateful", "rating": "5", "body": "Bought this to try to prevent yet another diverticulitis attack. Could be coincidence, but I have not had an attack since taking this. It's been about 7 months, and I was having attacks every other month.", "helpful": 2}, {"title": "Good glutamine and affordable", "rating": "5", "body": "I bought this to help repair my leaky gut. This is a very low dose, so I will be switching to the powder type instead, since you need a higher dose to heal your gut. I take the whole capsule, or I open it and mix it up with smoothie. It also helps with cravings for someone trying to lose weight. I recommend this product to people wanting to up their amino intake, lose weight, heal their gut. Hope this helps someone.", "helpful": 2}, {"title": "Good glutamine and affordable", "rating": "5", "body": "I bought this to help repair my leaky gut. This is a very low dose, so I will be switching to the powder type instead, since you need a higher dose to heal your gut. I take the whole capsule, or I open it and mix it up with smoothie. It also helps with cravings for someone trying to lose weight. I recommend this product to people wanting to up their amino intake, lose weight, heal their gut. Hope this helps someone.", "helpful": 2}, {"title": "This is the best thing for cravings", "rating": "5", "body": "This is the best thing for cravings. especially sugar and heavy foods. I have tried lots of things and I can't do without this.", "helpful": 4}, {"title": "Really good product. I believe that it helps with my ...", "rating": "5", "body": "Been taking Optimum nutrition Glutamine for muscle recovery & body fat mass for a year. Really good product. I believe that it helps with my type 2 diabetes glucose levels as well.", "helpful": 3}, {"title": "I struggle with cravings for carbs that and chocolate, ...", "rating": "4", "body": "I struggle with cravings for carbs that and chocolate, and I've been taking these as to see if they work. So far they have ceased the cravings a bit, but then again, yesterday I failed, and completely gave into carbs. I'll continue to use them and will give an update in a few weeks.", "helpful": 0}, {"title": "Very pleased!", "rating": "5", "body": "Excellent product that actually works! I started taking this because of the positive reviews it received and I'm not disappointed. Definitely stops cravings for wine and sweets and gives me more energy throughout the day. I only take it twice a day and have had little to no side effects from it. Very pleased with my purchase.", "helpful": 2}, {"title": "This is easy and convenient for me", "rating": "5", "body": "I'm taking this instead of the powder. Yes, yes, I know, the powder doesn't have any taste....bull! This is easy and convenient for me, and will continue with the pills. I like the quality & the price of this one.", "helpful": 1}, {"title": "Great vitamin!!", "rating": "5", "body": "This had helped me immensely. I used to have muscle pain all of the time. I tried everything from tumeric to muscle relaxers. I finally feel normal again.", "helpful": 0}, {"title": "Excellent muscle grain", "rating": "5", "body": "This is a outstanding product.", "helpful": 1}, {"title": "31/f weight lifter, I got these to help with ...", "rating": "2", "body": "31/f weight lifter, I got these to help with muscle recovery and after several weeks have not experienced any difference. I will stick to BCAA powder.", "helpful": 0}, {"title": "Good stuff.", "rating": "5", "body": "They're large pills, but they're pretty easy to swallow. This is a much cheaper way of taking a glutamine supplement, when comparing with most powders. I can't say that I've felt any difference in my recovery time, but since it is cheap I'll most likely continue to try it.", "helpful": 1}, {"title": "Great product for my esophagitis", "rating": "5", "body": "Great product for my esophagitis. I almost want to claim that it cures esophagitis and stomach pain. But then I am taking other supplements too, so I am not too sure which one is responsible.", "helpful": 2}, {"title": "Four Stars", "rating": "4", "body": "It's good and received it on time", "helpful": 0}, {"title": "Two Stars", "rating": "2", "body": "i didnt feel nothing really", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Very good", "helpful": 0}, {"title": "Good Results", "rating": "5", "body": "Happy to buy from a trusted source, and very happy to know I am buying vegetarian and GMO-free products. Pills are large but not hard to swallow with plenty of water. Goos results so far, I am using this to recover muscle tissue and fight the 'washed-out' feelings. Arrived on time and as-promised.", "helpful": 2}, {"title": "Highly recommended. ON has always been one of the top ...", "rating": "4", "body": "Highly recommended. ON has always been one of the top supplement brands in the business and they are no exception here with their glutamine. I usually like SCI FIT's GlutaLyn, however this is always next in line.", "helpful": 0}, {"title": "Awesome product, especially for joints!!", "rating": "5", "body": "Great product!!! Great price and easy to swallow capsules. I have been using this for months, also helps with joint problems. I have also got my mom taking it for her joints and now she swears by it too!", "helpful": 4}, {"title": "Two Stars", "rating": "2", "body": "It's okay.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good", "helpful": 0}, {"title": "Optimum Nutrition always delivers.", "rating": "5", "body": "I have been using glutamine for many, many years and this is just as good as the more expensive capsules or powder. Glutamine is glutamine, no need for proprietary blends, or special gimmicks. Optimum nutrition gives you exactly what you need, a consistently good product. If you didn't already know glutamine is an essential amino acid that helps greatly with muscle recovery, and helps lubricate joints among other benefits. I have been working out i.e. running, weights, MMA, crossfit, 5 days a week for the last 15 years. I can honestly say I don't know what I would do without a good glutamine supplement, before I started taking it my joints would crack, and hurt occasionally, and my recovery times were slower. Now all of that is gone. I highly recommend everybody takes a glutamine whether they are super active or simply past the age 30!", "helpful": 8}, {"title": "Increase in stamina", "rating": "4", "body": "I can feel an increase in stamina when I drink this supplement before playing badminton. I used to be able to only play 4 competitive badminton games but after taking this, I can sustain at least 5 competitive games until my knees will not allow me to play more games. I only drink this only before I play badminton and going to gym.", "helpful": 1}, {"title": "Great!", "rating": "5", "body": "I use this as part of my daily vitamin/supplement regimen. I take 3 capsules daily to help curb my appetite, and it really has helped. Of course, you should always consult your doctor before beginning any diet or supplement regimen to make sure it is the best option for you personally, but this really did help me a lot!", "helpful": 0}, {"title": "Great price point", "rating": "4", "body": "Staple supplement from a respected brand. Great price point...", "helpful": 2}, {"title": "By far one of the best and most important supplements you can take", "rating": "5", "body": "By far one of the best and most important supplements you can take. I used to not be able to walk properly for about 2 or 3 days, sometimes 4 days, after leg day, which was insane. But after I started taking this supp the pain was gone! and I mean gone from the first time I took it, it's crazy! I feel very little to no pain after lifting when I take this. Would definitely recommend!", "helpful": 0}, {"title": "Beware IBS Sufferers", "rating": "2", "body": "I've been taking another brand of l-glutamine and it really helps calm my stomach and bind my stools. Ever since taking this brand, I've had terrible D. After some researching, the \"other ingredient\" in this product is Magnesium Stearate. This ingredient is a lubricant added to supplements to keep the from sticking to the machinery used during manufacturing. It has been shown to cause diarrhea in customers with irritable bowel or lower gut digestive problems. If you are planning on taking this supplement, be careful of you have any digestive issues.", "helpful": 6}, {"title": "Digestive and muscle breakdown help", "rating": "4", "body": "Good product...helps my digestive system...also see less muscle loss due to all the cardio I do every day.I'm a distance runner so I tend to loose  muscle and fat pretty fast.Run 40 to 50 miles a week increasing 10 % week for the next 10 weeks.", "helpful": 1}, {"title": "Four Stars", "rating": "4", "body": "It's good and received it on time", "helpful": 0}, {"title": "Great stuff", "rating": "5", "body": "Awesome. Comes in the openable capsules, so if you don't like taking pills, just open the pill and dump powder into pre, or post work out. Absolutely no taste. Great stuff for rebuilding broken muscle fibers. Protein has some, but always better to get the most you can. Great product especially for the price!", "helpful": 1}, {"title": "great product definitely helps with a prompt recovery", "rating": "5", "body": "great product definitely helps with a prompt recovery. I recommended it for over 40 and active runners and gym rats.", "helpful": 2}, {"title": "I absolutely love this product", "rating": "5", "body": "I absolutely love this product, is help me with my soreness but the best part is helping me a lot with my cravings for sweets, let me tell you I have a huge one!", "helpful": 1}, {"title": "Buy This Glutamine Brand", "rating": "5", "body": "This product is by far a 5 Star product. The quality, price and packaging make it so. As a cancer survivor and body builder this exceeded my expectations from research and works! I can feel the difference in my workouts and then recovery. Do the research on Glutamine and buy from this company.", "helpful": 4}, {"title": "Five Stars", "rating": "5", "body": "better to buy the powder form then capsule but definitely works.", "helpful": 0}, {"title": "Overall great product and value with healthy benefits", "rating": "5", "body": "Package arrived via prime, quickly as expected and in good condition. This was a good price for Glutamine and is a quality product. Clear gel caps filled with the white Glutamine Powder. There are great reviews here about the science of glutamine. This is a more personal review.", "helpful": 1}, {"title": "Love this stuff", "rating": "5", "body": "Started taking this because I read it was supposed to help with sugar cravings. It worked great! I no longer take it and happily the cravings have not came back. Great stuff. Will buy again if I need help combating sugar cravings.", "helpful": 1}, {"title": "High Potency", "rating": "5", "body": "Glutamine is excellent for heartburn and other gut maladies. Also good for Immunity, stress, depression, moodiness, irritability, anxiety and stamina. Take on am empty stomach for best absorbency. You should notice a difference in a week or two. Cheaper than Nexium & other Rx. This is the highest potency I have been able to find (you may not need this much, I used to take only 500mg/day for heartburn and that was effective).", "helpful": 9}, {"title": "Totally replaced IB Profin use with Glutamine", "rating": "5", "body": "I take Glutamine after my workouts and sometimes pre-workout for muscle recovery.  Over the years I have completely stopped using Aleve or Advil for sore muscles, especially in the morning.  I take 3 or 4 tablets of Glutamine depending on my soreness.  This is great for arthritis aches too.  If I wake up sore with limited range of motion I will take Glutamine instead of Advil, 100%.", "helpful": 3}, {"title": "I take first thing in the morning. It does ...", "rating": "5", "body": "I take first thing in the morning. It does indeed helps with my acid reflux, as stated on doctor Oz, a couple years ago. When I forget to take it, I can't drink coffee; coffee increases my reflux issues. It does work!", "helpful": 8}, {"title": "Beware IBS Sufferers", "rating": "2", "body": "I've been taking another brand of l-glutamine and it really helps calm my stomach and bind my stools. Ever since taking this brand, I've had terrible D. After some researching, the \"other ingredient\" in this product is Magnesium Stearate. This ingredient is a lubricant added to supplements to keep the from sticking to the machinery used during manufacturing. It has been shown to cause diarrhea in customers with irritable bowel or lower gut digestive problems. If you are planning on taking this supplement, be careful of you have any digestive issues.", "helpful": 6}, {"title": "Extensive workouts.", "rating": "5", "body": "I am training for an Ironman and Glutamine helps with protein synthesis by keep the body more in balance during prolong extensive workouts.  This particular amino acid is produced by the body so it is not needed to supplement on daily basis.  Just like any product prior to you using make sure it is safe for you and that your using it correctly", "helpful": 6}, {"title": "Great for Curbing Sweet Tooth", "rating": "5", "body": "I use these during cycling training seasons to curb a developed sweet tooth during this time. Cycling foods tend to taste like candy and after a while make me want candy. I use these to keep that at bay and they do it well, I take one in the morning and one in the afternoon the entire length of training season.I can also take them when controlling food intake to feel a bit more full.  I also understand they have some recovery properties but I cannot attest to the viability of that due to the other supplements taken during training.", "helpful": 5}, {"title": "Great for my gut!", "rating": "5", "body": "Taking L Glutamine has helped tremendously with my intestinal issues.  This product has no negative sideeffects for me.  This amino acid supplement is a great addition to my multivitamin.", "helpful": 1}, {"title": "Good stuff", "rating": "4", "body": "An oncologist recommended this to a friend of mine and said it was good for the peripheral neuropathy associated with chemotherapy.  I was experiencing the same problem with my hands and this seems to help.  Not a cure all but a help.", "helpful": 1}, {"title": "this stuff is awesome.", "rating": "5", "body": "Being that its my first time using Glutamine i can't compare ON's version to its competitors but what i can say is that this Amino Acid compound does just what the researcher has read that it does, the key is consistency of use and timing, take a look at a peer-written review on the subject, this stuff is awesome.", "helpful": 5}, {"title": "Wonderful Product", "rating": "5", "body": "This product definitely reduces your desire for sweets. I would recommend this product to anyone who is watching their diet and has a sweet tooth.", "helpful": 9}, {"title": "Great for recovery", "rating": "5", "body": "I have a class on the third floor. Stairs after a leg workout the day or two before were a cumbersome obstacle. With glutamine, I hardly notice. I have to stand for 8 hours and move quickly for my job. Glutamine has reduced the soreness I feel after working out. I'm happy, just bought another 240 capsules.", "helpful": 2}, {"title": "Affordable and they actually work!", "rating": "5", "body": "I was hesitant to purchase these online. I had started a vigorous workout regimen and these were recommended to cut down on the amount of time it takes for recovery and soreness. I would take 2 pills after working out and before eating my dinner. I feel like these did help cut down on the time it took to eliminate soreness versus when I was not taking them.", "helpful": 4}, {"title": "Works!", "rating": "5", "body": "Love this product!", "helpful": 4}, {"title": "Good stuff.", "rating": "5", "body": "They're large pills, but they're pretty easy to swallow. This is a much cheaper way of taking a glutamine supplement, when comparing with most powders. I can't say that I've felt any difference in my recovery time, but since it is cheap I'll most likely continue to try it.", "helpful": 1}, {"title": "And it was kinda funny to see people taking this to combat sugar cravings", "rating": "5", "body": "Bought this to help with recovery from working out. Seems to work well for me. As a side note before I did this rating I looked at what others said about this product. And it was kinda funny to see people taking this to combat sugar cravings. So I looked up when I bought this and low and behold it was right around the time where I stopped craving really sugary foods. Might be a coincidence, but who knows.", "helpful": 3}, {"title": "Not as bad but I'd love something that improves that as much ...", "rating": "5", "body": "This product is truly deserving of 5-stars.  I'm back to order more.  I ordered this, read the negative reviews, regretted ordering . . . but now I'm a fan.  For years I've worked out only to feel progressively more tired, as-if my body isn't recovering until I finally have to take a break from the routine.  With this glutamine I have minimal muscle soreness - akin to taking ibuprofen - and find that I'm ready to go the next day.  As I result I've seen impressive gains - finally!  This product is now a must in my supplement cabinet.", "helpful": 5}, {"title": "Help your protein work better and your muscles grow!", "rating": "5", "body": "If you're a weightlifter - any kind, powerlifter or bodybuilder - glutamine is a must.  Yes, your after workout protein shakes contain some glutamine, but not enough.  This stuff really works and is priced right.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Capsules are small enough to swallow 2 at a time without chocking to death", "helpful": 2}, {"title": "Great product", "rating": "5", "body": "Use this for post training. Good for recovery and good for muscle preservation. Also has pther benefits for cancer patients and people with adhd. Always go with this trust worthy brand as their products are usually better than the competition.", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "have yet to see any results. I take 3 a day", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Great product for it's value and no filler added! Will probably buy this again!", "helpful": 3}, {"title": "This really gives me a great pep in my step the day after a hard ...", "rating": "5", "body": "This really gives me a great pep in my step the day after a hard workout, unlike before when I would stay sore and have to force myself to workout again. These are great regardless of what your workout goal is.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good", "helpful": 0}, {"title": "Works!", "rating": "5", "body": "Love this product!", "helpful": 4}, {"title": "Two Stars", "rating": "2", "body": "It's okay.", "helpful": 0}, {"title": "I'm very happy with this product", "rating": "5", "body": "I've purchased this product several times and I can tell the difference from other products. I'm very happy with this product!", "helpful": 2}, {"title": "Best value on the market. Wish They made more stuff like this.", "rating": "5", "body": "These are very clean and potent. works awesome after workouts. nothing will help you recover from a workout like this.", "helpful": 4}, {"title": "Two Stars", "rating": "2", "body": "Powder works a lot better and it saves you money. Pills 2/5 Powder 5/5", "helpful": 9}, {"title": "Excellent post-workout supplement", "rating": "5", "body": "I take these with my daily post-workout drink.  This helps to quickly restore lost nutrients to speed muscle recovery, minimize DOMS (Delayed Onset Muscle Soreness) and aide in muscle growth.", "helpful": 6}, {"title": "Heals your gut!", "rating": "5", "body": "Great for healing the gut! I have problems with hemorrhoids and notice if I use this, it helps heal them. After researching what helps to strengthen your gut, I found this is highly recommended for any gut issues from diverticulitis to leaky gut. I would recommend starting with 1- 1000 mg cap and working up to whatever seems to work for you. I take 2 in the morning and 2 before bed.", "helpful": 3}, {"title": "Great Supplement for everything from increasing HGH to leaky gut!", "rating": "4", "body": "Great Supplement for everything from increasing HGH to leaky gut!", "helpful": 4}, {"title": "I don't think it gets better than ON", "rating": "4", "body": "I can't honestly say I know it's working, but I believe it's helping me get a more restful night's sleep and therefore boosting hormone production/muscle regeneration. The directions say to take 3 pills an hour before bed, but since I already take a daily multi with the same ingredients, I only take 2 to get their RDA for men. For the price and quality, I don't think it gets better than ON.", "helpful": 1}, {"title": "I like these - convenient and small enough to swallow:)", "rating": "5", "body": "I like these - convenient and small enough to swallow:)  While others speak of curbing \"sugar cravings\" I didn't have many of these.  However, I do believe these have better helped me control my diet.  I purchased 2 of the 240 capsule bottles and they were delivered very quickly.", "helpful": 1}, {"title": "Great supplement.", "rating": "5", "body": "Yes, it doesn't dissolve but you just swish to glass around before downing it. Hitting the gym 5 days a week I've seen some great gains over the past 2 months while taking this. I will continue using this product.", "helpful": 2}, {"title": "On my second bottle", "rating": "5", "body": "When I started using them I could tell a difference in how long it took to recover from a workout.  I had a week lapse in between bottles and I was sore in the morning after working out.", "helpful": 3}, {"title": "Really good product. I believe that it helps with my ...", "rating": "5", "body": "Been taking Optimum nutrition Glutamine for muscle recovery & body fat mass for a year. Really good product. I believe that it helps with my type 2 diabetes glucose levels as well.", "helpful": 3}, {"title": "I love optimum nutrition however I do not feel any benefit ...", "rating": "4", "body": "I love optimum nutrition however I do not feel any benefit taking this product. I know you have to take allot but I feel its not worth the time or costs for minimal if any results.", "helpful": 0}, {"title": "Hard for me to say it works or not. ...", "rating": "4", "body": "Hard for me to say it works or not.  I am very doubtful of its muscle growth abilities since there hasn't been a study that shows it.  There has been a study that shows it does reduce the chances of endurance athletes getting sick after long workouts.", "helpful": 0}, {"title": "Energetic", "rating": "5", "body": "Just what you need to help recover those worn out muscles, to help do it all over the next day.", "helpful": 0}, {"title": "Good product", "rating": "5", "body": "It's working well so far", "helpful": 1}, {"title": "Great product! Take on a daily basis before and ...", "rating": "5", "body": "Great product! Take on a daily basis before and after I workout. I feel less sore and and recover 2-3 days quicker. Good price for a great supplement.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "These seems to help me I have lupus and I take these everyday.", "helpful": 1}, {"title": "Good product", "rating": "5", "body": "I use right before exercises every day I believe in product and seems to be working for me.", "helpful": 0}, {"title": "So that's always a good thing.", "rating": "4", "body": "Cheap and effective. Definitely helped to shed a couple pounds also. So that's always a good thing.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I love this product, work great!!  It definitely makes a difference before and after a good workout.", "helpful": 0}, {"title": "Working out and using great supplements are my secret weapon", "rating": "5", "body": "No problems with soreness even after leg day (just have to take again before bed).  It keeps me healthier too, I believe.  I work in an elementary school.  Working out and using great supplements are my secret weapon.  Excellent product.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Priced very well and good quality glutamine.", "helpful": 2}, {"title": "Pretty Good", "rating": "5", "body": "Not much to say here, I can't really tell if it works... But ill keep taking it anyways. The pills are easy to swallow by the way!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excelent service and product!", "helpful": 1}, {"title": "Recommended my my LMT to help my muscles recover from ...", "rating": "5", "body": "Recommended my my LMT to help my muscles recover from strenuous work-outs. Haven't been injured since I started taking it. So maybe it's working.", "helpful": 0}, {"title": "All About Recovery", "rating": "5", "body": "Always helps with my recovery. I never notice a difference until I run out and it takes 2 days longer to recover.", "helpful": 0}, {"title": "Only for serious workout guy", "rating": "5", "body": "I have using this product everyday before and after workout. amazingly this product help me lot for my muscles recovery and I can see muscle gaining with in 2 weeks of using this.", "helpful": 0}, {"title": "I will always use Glutamine because I workout so much ...", "rating": "5", "body": "I will always use Glutamine because I workout so much. Glutamine is exactly what i need in order to repair my muscles.", "helpful": 0}, {"title": "Excellent muscle recovery", "rating": "5", "body": "For aerobic athletes it's even better than Whey protein in terms of full recovery and lean mass protection. Its price is even the best in the market.", "helpful": 2}, {"title": "This are great for post gym soreness", "rating": "5", "body": "This are great for post gym soreness. You will thank yourself for taking these before you lift when you can actually move the next day.", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "I was told to get them for workout recovery, but they haven't helped me at all. YMMV", "helpful": 0}, {"title": "Seems to work well", "rating": "5", "body": "Hard to judge a supplement, but I feel like I recover from my workouts much quicker when taking these as directed (before & after lifting). Will continue to buy.", "helpful": 2}, {"title": "Excellent muscle recovery", "rating": "5", "body": "For aerobic athletes it's even better than Whey protein in terms of full recovery and lean mass protection. Its price is even the best in the market.", "helpful": 2}, {"title": "Good Glutamine", "rating": "5", "body": "Like it - quality product and very competitive price - have ordered 3x and will order again - take in combination with ON BCAA", "helpful": 0}, {"title": "Good workout recovery product", "rating": "5", "body": "Amazing product for recovery post workout.", "helpful": 2}, {"title": "Good Product", "rating": "5", "body": "It's great, the pill is easy to take apart so you can add the powder to anything without having to swallow a big pill if you don't want to.", "helpful": 2}, {"title": "Help your protein work better and your muscles grow!", "rating": "5", "body": "If you're a weightlifter - any kind, powerlifter or bodybuilder - glutamine is a must.  Yes, your after workout protein shakes contain some glutamine, but not enough.  This stuff really works and is priced right.", "helpful": 0}, {"title": "I'm very happy with this product", "rating": "5", "body": "I've purchased this product several times and I can tell the difference from other products. I'm very happy with this product!", "helpful": 2}, {"title": "This really gives me a great pep in my step the day after a hard ...", "rating": "5", "body": "This really gives me a great pep in my step the day after a hard workout, unlike before when I would stay sore and have to force myself to workout again. These are great regardless of what your workout goal is.", "helpful": 0}, {"title": "great product definitely helps with a prompt recovery", "rating": "5", "body": "great product definitely helps with a prompt recovery. I recommended it for over 40 and active runners and gym rats.", "helpful": 2}, {"title": "Great product", "rating": "5", "body": "Use this for post training. Good for recovery and good for muscle preservation. Also has pther benefits for cancer patients and people with adhd. Always go with this trust worthy brand as their products are usually better than the competition.", "helpful": 0}, {"title": "Great pills, great product", "rating": "5", "body": "Wanted the supplement without added sugars or whatever else they throw in. Great pills, great product, great company.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great Product. Good Quality.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "please take this before and after heavy training", "helpful": 0}, {"title": "Works Well", "rating": "5", "body": "I love this supplement. I take 2 capsules about 20 minutes before I lift and I've increased my squats by 10% in the past 6 weeks.", "helpful": 0}, {"title": "These tablets work well, though they tend to upset ...", "rating": "4", "body": "These tablets work well, though they tend to upset my stomach a little so I make sure I take them with food.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Loved these, the powder would be better though for larger doses", "helpful": 2}, {"title": "Great Glutamine! Definitely I can see the difference at ...", "rating": "5", "body": "Great Glutamine! Definitely I can see the difference at the gym when I take it and when I don't! Price is also good! 5 stars!", "helpful": 0}, {"title": "very happy with this product and my improved recovery times after ...", "rating": "5", "body": "very happy with this product and my improved recovery times after intense workouts,  (note i also use this with other protein source for recovery)", "helpful": 0}, {"title": "Good stuff", "rating": "5", "body": "Noticing my gains since i started taking these", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Optimum Nutrition is the best product i have used and purchased. Great things from this brand.", "helpful": 0}, {"title": "Very practical and easy to carry anywhere", "rating": "5", "body": "I AM SIMPLY REVIEW THE PRACTICALITY OF GLUTAMINE CAPS VS POWDER....", "helpful": 1}, {"title": "this stuff is awesome.", "rating": "5", "body": "Being that its my first time using Glutamine i can't compare ON's version to its competitors but what i can say is that this Amino Acid compound does just what the researcher has read that it does, the key is consistency of use and timing, take a look at a peer-written review on the subject, this stuff is awesome.", "helpful": 5}, {"title": "Great product.", "rating": "5", "body": "I got these for my husband last Christmas and he loves them, we have reordered multiple times since then. Great product.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Great product. High quality glutamine", "helpful": 0}, {"title": "EVERYTHING I HOPED FOR IN A DIETARY SUPPLEMENT!!!!!", "rating": "5", "body": "Amazing product!!! I am losing weight DAILY and feel better with more energy, reduced hunger and I plan to continue with this product as part of my new life living plan daily! FANTASTIC!!!!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product and super fast shipping! A+++++", "helpful": 0}, {"title": "Great for joints", "rating": "4", "body": "Great for joints.", "helpful": 1}, {"title": "Love them. Just wish they didn't float!", "rating": "5", "body": "Great pills. Only complaint I have is that they float in water. Doesn't seem like that would bother you, but It makes it hard to swallow sometimes without gagging.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "A nice supplement for training and recovery", "helpful": 0}, {"title": "Good Quality", "rating": "5", "body": "Glutamine tablets good qluality", "helpful": 0}, {"title": "OK for what it is supposed to do", "rating": "5", "body": "To me the pill size was totally fine. I was taking glutamin before I switched to a complete protein mix and I think it does the job - I recovered much faster from my training sessions and felt much better overall.", "helpful": 2}, {"title": "Acne!", "rating": "1", "body": "I've taken a different brand of this for quite a while and thought I'd try this one because it's less expensive, but for some reason it made me break out.", "helpful": 3}, {"title": "I absolutely love this product", "rating": "5", "body": "I absolutely love this product, is help me with my soreness but the best part is helping me a lot with my cravings for sweets, let me tell you I have a huge one!", "helpful": 1}, {"title": "I got a few zits on my face and body :(", "rating": "1", "body": "If you are the type who breaks out easily or used to in your teen years, this type of Glutamine isn't one you should go with. Love their vitamins though.", "helpful": 1}, {"title": "good price for a good brand.", "rating": "4", "body": "i tried the powder, and i tried the capsuls. i dont know if this is my cup of tea so to speak, but the overall product seems to be well made, by a high quality brand. if you believe the glutamine research results, give it a try.", "helpful": 1}, {"title": "Good Value", "rating": "5", "body": "Glutamine supplement that has helped me decrease my recovery time. For the price I think it is a good value.", "helpful": 1}, {"title": "Much better cost per serving with the powder", "rating": "3", "body": "I bang weights really heavy and dosage per pill was way to low.  I run through the entire bottle in days.  With the powered version one scoop equals 5 pills.  Much better cost per serving with the powder form", "helpful": 1}, {"title": "Great results", "rating": "5", "body": "I take a lot of supplements and hadn't tried glutamine yet until i bought this. Let me tell you - this is absolutely one of my favorite supplements to take anymore. I've noticed a significant difference in performance on leg days and also I don't cramp half as much as I used to. If you're on the fence, I'd say give it a try. Plus the price can't be beat.", "helpful": 1}, {"title": "Three Stars", "rating": "3", "body": "Heard this works to curb sugar cravings but didn't use it as directed, 4 x day. Too lazy.", "helpful": 1}, {"title": "Read the ingredients labels first", "rating": "2", "body": "I don't want to say this product is bad because the price is good, but they put magnesium stearate in their products. It's an industrial chemical used when mixing in the drums so the batch won't stick inside the equipment. It saves time labor and money instead of manual cleaning. But it's hard on human digestion!", "helpful": 1}, {"title": "Four Stars", "rating": "4", "body": "Great quality product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Optimus performance, I star using for after my workouts and its works perfect", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Amazing product", "helpful": 0}, {"title": "Good Glutamine", "rating": "4", "body": "Works great. Helps alleviate muscle soreness.", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "Heard this works to curb sugar cravings but didn't use it as directed, 4 x day. Too lazy.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "my son loves it", "helpful": 0}, {"title": "I would buy it again", "rating": "5", "body": "Great stuff keeps me going and makes my muscles recpver much quicker.", "helpful": 0}, {"title": "A Must!", "rating": "5", "body": "A must for everyday lifters", "helpful": 0}, {"title": "I recommend", "rating": "5", "body": "I recommend it", "helpful": 0}, {"title": "great", "rating": "5", "body": "Take these daily after my workout. great price", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Just what I wanted.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good buy", "helpful": 0}, {"title": "Great Price!", "rating": "5", "body": "These are an excellent price! I take one in the morning and one after I workout.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "My husband swears by this product !", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good Experience.", "helpful": 0}, {"title": "Good buy.", "rating": "5", "body": "Completely tasteless - I open the capsules and add them to my pre/post workout drinks.  The capsules were a much better bargain than the loose powder.", "helpful": 0}, {"title": "Love this stuff", "rating": "5", "body": "Started taking this because I read it was supposed to help with sugar cravings. It worked great! I no longer take it and happily the cravings have not came back. Great stuff. Will buy again if I need help combating sugar cravings.", "helpful": 1}, {"title": "My go too.", "rating": "5", "body": "No complaints here.", "helpful": 1}, {"title": "Work for me", "rating": "4", "body": "I've been taking these pills before my workouts for about 3 weeks now. They were recommended by a fitness trainer. They give me the extra energy to push myself. I have not had any side effects from them.", "helpful": 1}, {"title": "Didn't notice a difference", "rating": "2", "body": "I didn't really notice any change while taking this product.  My recovery time seemed the same.  Other products on the market seem to be better at decreasing soreness and recovery time.  Check out ON's recovery drink.  Worked wonders for me.", "helpful": 3}, {"title": "Best product", "rating": "5", "body": "Best thing to use to prevent getting sick all the time like used to happen to me when the weather gets cold, and I also use with amino and BCAA to avoid the sourness of my muscles after my workouts!", "helpful": 0}, {"title": "EVERYTHING I HOPED FOR IN A DIETARY SUPPLEMENT!!!!!", "rating": "5", "body": "Amazing product!!! I am losing weight DAILY and feel better with more energy, reduced hunger and I plan to continue with this product as part of my new life living plan daily! FANTASTIC!!!!!", "helpful": 0}, {"title": "Great for running or any kind of cardio", "rating": "5", "body": "Great product. Can be used for pre or post cardio workouts. I only take two since I preffer my body to absorb most of its amino acids from regular foods but its good for long distance runs.", "helpful": 0}, {"title": "Good product", "rating": "5", "body": "It's working well so far", "helpful": 1}, {"title": "nice product to get.", "rating": "5", "body": "I got this cause my GNC went retarded on their glutamine. Used this and I never got sore. Never!! Recovery times were great as well.", "helpful": 2}, {"title": "Pod product", "rating": "5", "body": "Glutamine is what it is. It helps ur body repair after a good workout. You can't really feel a difference until u do a hard workout", "helpful": 2}, {"title": "I love optimum nutrition however I do not feel any benefit ...", "rating": "4", "body": "I love optimum nutrition however I do not feel any benefit taking this product. I know you have to take allot but I feel its not worth the time or costs for minimal if any results.", "helpful": 0}, {"title": "Only for serious workout guy", "rating": "5", "body": "I have using this product everyday before and after workout. amazingly this product help me lot for my muscles recovery and I can see muscle gaining with in 2 weeks of using this.", "helpful": 0}, {"title": "but otherwise I think that ON Glutamine is a good buy.", "rating": "4", "body": "The capsules are a little bit bigger than I expected, and sometimes they get caught on the roof of my mouth if it's dry, but otherwise I think that ON Glutamine is a good buy.", "helpful": 0}, {"title": "Perfect", "rating": "5", "body": "The capsules are medium size and easy to swallow.  Pricing for the quantity was very competitive. Not a single complaint.", "helpful": 2}, {"title": "great!", "rating": "5", "body": "easy to drink you do not feel the pillow, medium size i recomend this product to everyone ho is still thinking to buy it", "helpful": 2}, {"title": "Great Product", "rating": "5", "body": "If you like the caps these are perfect. I prefer the powder seeing as I take doses of 10 grams. So this was not ideal, but the Glutamine inside was great as always.", "helpful": 0}, {"title": "Love them. Just wish they didn't float!", "rating": "5", "body": "Great pills. Only complaint I have is that they float in water. Doesn't seem like that would bother you, but It makes it hard to swallow sometimes without gagging.", "helpful": 0}, {"title": "Helps a little.", "rating": "3", "body": "Not a big difference in relieving joint pain but any little bit is better than nothing. Price is fair on this one.", "helpful": 2}, {"title": "It ain't sexy, but it works", "rating": "4", "body": "I couple my use of glutamine with other, more \"sexy\" supplements. I've read on the benefits of glutamine supplementation and have added it to my mix, though I admit a user's not going to come away going \"Wow, I feel incredible after using this product\". At any rate, I've attained some goals during my workouts that I'm sure have something to do with my recent addition of glutamine. This particular product is a good size that allows you to discover whether glutamine is right for you without breaking the bank. The pills aren't incredibly huge and they're easy to digest with your favorite beverage.", "helpful": 3}, {"title": "My go too.", "rating": "5", "body": "No complaints here.", "helpful": 1}, {"title": "Great product! Take on a daily basis before and ...", "rating": "5", "body": "Great product! Take on a daily basis before and after I workout. I feel less sore and and recover 2-3 days quicker. Good price for a great supplement.", "helpful": 0}, {"title": "Good buy.", "rating": "5", "body": "Completely tasteless - I open the capsules and add them to my pre/post workout drinks.  The capsules were a much better bargain than the loose powder.", "helpful": 0}, {"title": "Great price for these pills", "rating": "5", "body": "Great price for these pills. If you want to really pack on muscle you must be taking a lot of these a day to keep the body from eating its own muscle.", "helpful": 0}, {"title": "very happy with this product and my improved recovery times after ...", "rating": "5", "body": "very happy with this product and my improved recovery times after intense workouts,  (note i also use this with other protein source for recovery)", "helpful": 0}, {"title": "Recommended my my LMT to help my muscles recover from ...", "rating": "5", "body": "Recommended my my LMT to help my muscles recover from strenuous work-outs. Haven't been injured since I started taking it. So maybe it's working.", "helpful": 0}, {"title": "Good supplement for daily use", "rating": "4", "body": "Capsules are easy to break open and put right into a protein shake. Huge pills to swallow. I use em to add in recovery and supplement my protein", "helpful": 0}, {"title": "These definitely help. In addition to wheys or muscle ...", "rating": "5", "body": "These definitely help. In addition to wheys or muscle milk, I'd say it still definitely enhances results. Just get a BCAA supplement to go with.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I will order again", "helpful": 1}, {"title": "very good product.", "rating": "5", "body": "very good product.. good job ON! but i think if you will make glutamine serving size 5g. with caps this will be perfect in global market :)", "helpful": 0}, {"title": "I feel like it's working", "rating": "4", "body": "I feel like it's working...I'm doing a few new supplements right now, so I can't say if this one is specifically causing improved health.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excelente product", "helpful": 1}, {"title": "Great for joints", "rating": "4", "body": "Great for joints.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Very good", "helpful": 0}, {"title": "Great Product", "rating": "5", "body": "Product as packaged, fast shipping.", "helpful": 0}, {"title": "Excellent for the cost!", "rating": "5", "body": "Excellent for the cost!", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Seems to be helping with muscle tissue", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product 👍", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Worked awesome! Will buy again.", "helpful": 0}, {"title": "good results", "rating": "5", "body": "On time, good results", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good product!", "helpful": 0}, {"title": "and could not handle the powder form not disolving and the taste was terrible. I started researching and found a comparason of .", "rating": "5", "body": "I was using BCAA, and could not handle the powder form not disolving and the taste was terrible.  I started researching and found a comparason of this product and BCAA. I was sold after reading the Q&A.  It took about 1 1/2 weeks for me to Noticble feel it working.  I am so impressed, I am not craving sugar or carbs anything like I usually do on my big work out days.  I am a fitness instructor and on the days I teach 3-4 classes, oh boy do I want sugar! Well not now.  I even tried to talk my self into eating some yogurt prezzles because I knew this was a day I eat sugar.... yeah I couldnt do it! those prezzles are still in my pantry.I still have some muscle soreness, however, I am sure it is reduced drastically due to me being faithful and taking these supplements.  I take one every day for sure and work out days, I take 2.  I will continue using this product and I have shared it with my students.", "helpful": 1}, {"title": "Great for running or any kind of cardio", "rating": "5", "body": "Great product. Can be used for pre or post cardio workouts. I only take two since I preffer my body to absorb most of its amino acids from regular foods but its good for long distance runs.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great price, great product, great results, easy to swallow and easy on the pocket", "helpful": 0}, {"title": "good", "rating": "5", "body": "Good product instant effect", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great value", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Quality product. Will buy again.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "ON is the best", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Real creatine..enough said", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "very good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excellent thanks", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great!", "helpful": 0}, {"title": "Just the Help I needed", "rating": "5", "body": "I really like these. They truly help with digestion. Fast shipping. Great Price. I would recommend.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Do as intended.", "helpful": 0}, {"title": "Good product", "rating": "4", "body": "Good price for the product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product. As expected.", "helpful": 0}, {"title": "Great Product", "rating": "5", "body": "If you like the caps these are perfect. I prefer the powder seeing as I take doses of 10 grams. So this was not ideal, but the Glutamine inside was great as always.", "helpful": 0}, {"title": "Excellent post-workout supplement", "rating": "5", "body": "I take these with my daily post-workout drink.  This helps to quickly restore lost nutrients to speed muscle recovery, minimize DOMS (Delayed Onset Muscle Soreness) and aide in muscle growth.", "helpful": 6}, {"title": "Three Stars", "rating": "3", "body": "its ok", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Will continue to order.", "helpful": 0}, {"title": "Great product. Easy capsules", "rating": "5", "body": "Work great. Glutamine is essential in muscle recovery allowing you to push your gym routines.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Very effective", "helpful": 0}, {"title": "All good!", "rating": "5", "body": "Got product on time and what I wished. All good!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Optimum Nutrition is the best product i have used and purchased. Great things from this brand.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product, gives me energy and helps with muscle pain shipping was very fast like promised", "helpful": 0}, {"title": "Great product. Easy capsules", "rating": "5", "body": "Work great. Glutamine is essential in muscle recovery allowing you to push your gym routines.", "helpful": 0}, {"title": "Good product", "rating": "5", "body": "I use right before exercises every day I believe in product and seems to be working for me.", "helpful": 0}, {"title": "Life saving!", "rating": "5", "body": "Amazing product and value.  Could feel the difference in my recovery after day one of use!", "helpful": 0}, {"title": "No complaints", "rating": "5", "body": "Well, this is one of those things that's almost impossible to \"tell\" if it's doing anything for you, but with that said, I've had no negative issues with it, whether product quality related, health related or shipping related.", "helpful": 0}, {"title": "Really helps with next day soreness!", "rating": "5", "body": "Optimum Nutrition always has quality products, won't purchase Glutamine from anyone else.", "helpful": 0}, {"title": "Good for you", "rating": "5", "body": "Understand good to take before exercise. I have been taking it, seems to do as it says.", "helpful": 0}, {"title": "will buy again and again", "rating": "5", "body": "taken as a workout supplement and for my gluten interolance; really makes a difference", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works great to keep you from getting sore after workouts and helps shred off weight!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "This glutamine is great.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good product!", "helpful": 0}, {"title": "will buy again and again", "rating": "5", "body": "taken as a workout supplement and for my gluten interolance; really makes a difference", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great Product!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "very goog", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Top 3 supplements!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works great to keep you from getting sore after workouts and helps shred off weight!!", "helpful": 0}, {"title": "Great product", "rating": "5", "body": "I can't get along without these!  Great product, good price and they do what they are supposed to do.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I've been using for SIBO. So far nothing negative to report!", "helpful": 0}, {"title": "Great product!", "rating": "5", "body": "Great product and fast delivery. Would order again for sure. Recommended A+++", "helpful": 0}, {"title": "Recommend!", "rating": "4", "body": "Nice product! only 1 pill before workout and 1 after! well stronger already!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Noticed a change in my weight!  I have less cravings and feel full quicker!", "helpful": 0}, {"title": "Average", "rating": "2", "body": "Tough to notice a difference using these things (because I use other supplements in combination), however, the rating of them just being okay is that the pills are excessively large, and usually one would like to take 2 or 3 of them in one setting (which is impossible to do without food for anyone who is not use to swallowing large pills).", "helpful": 2}, {"title": "Five Stars", "rating": "5", "body": "In combination with my creatine,  I've been having  nothing but results...", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Extremely helpful in mitigating muscle soreness after intense workouts.", "helpful": 0}, {"title": "I love this product!!!!", "rating": "5", "body": "I love this product!!!! a very good product, I can't complain at all!!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "My son tried this item.He says it is wounderful and complete nutrition", "helpful": 0}, {"title": "I would buy it again", "rating": "5", "body": "Great stuff keeps me going and makes my muscles recpver much quicker.", "helpful": 0}, {"title": "better life", "rating": "5", "body": "my spouses nutritional MD has suggested this product for more protection after getting his \"leaky gut syndrome\" taken care of..", "helpful": 5}, {"title": "Five Stars", "rating": "5", "body": "I love this product, it keeps me from muscle injuries and energetic", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great product, use it everyday post workout , seeing good results", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product and half the \"brick and Mortar\" store price", "helpful": 0}, {"title": "High Quality", "rating": "5", "body": "I bought these a long time ago, and I do not take the recommended dose. I take about half that and only on days I work out, and after.", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "Good supplement, good price. Needs to be paired with creatine", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I've been using for SIBO. So far nothing negative to report!", "helpful": 0}, {"title": "Good product", "rating": "5", "body": "Useful for chemo recovery, will continue for several months!", "helpful": 0}, {"title": "Great product", "rating": "5", "body": "Works great! I feel little to no soreness after working out.", "helpful": 0}, {"title": "Great supplement...", "rating": "4", "body": "I began taking this particular supplement around 2 weeks ago with others I ordered at the same time. Although it's not an essential amino acid I have noticed a change in my energy level while working out. It is a substance naturally produced in the body and I'm not some big supplement freak but when I find a product I like, I stick with it. I only take all natural stuff like protein, BCC's and creatine. In my book this is as essential as anything I've tried. It was delivered well before the guranteeed delivery date and in new condition as promised by the vendor. This no dout comes higly recommedned on my behalf...", "helpful": 2}, {"title": "Great Product!", "rating": "5", "body": "Hard to find and good price. Have reordered multiple times.", "helpful": 0}, {"title": "Good Product with good benefits... just one negative", "rating": "4", "body": "I'm aligned with all the other reviews of this product as it truly has improved my recovery and overall performance in the gym. The only comment I would have is that these caplets have not identifying color or name so if you are stacking this with the Optimum BCAA caplets (where 2 caplets is 1 serving) then you would not be able to tell the difference between them.", "helpful": 0}, {"title": "Good price, Good product", "rating": "5", "body": "Works as stated. Good price, Good product. Will use again.", "helpful": 0}, {"title": "Glutamine baby!  You know you want it!", "rating": "5", "body": "If you lift weights, you need glutamine - lots of it.  This stuff can repair injuries like you wouldn't believe.  I eat it like candy.  And for your dollar, ON is the way to go.", "helpful": 3}, {"title": "Four Stars", "rating": "4", "body": "I'm not sure, but I may buy Glutamine peptides next time", "helpful": 0}, {"title": "Decent value", "rating": "4", "body": "I buy this product in this form not because I prefer the capsules, but because the cost per serving is cheaper than the mix.  I simply open and pour the contents of the caps in with my post work out shake to achieve the same results.  It doesn't dissolve the best, but its really not meant to be consumed this way, so I don't knock it for that.", "helpful": 0}, {"title": "I am very pleased.", "rating": "5", "body": "I'm a regular buyer of this product. I am very pleased.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Love this product. Easy do carry around for workout.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Helped my GABA and Post Workout", "helpful": 2}, {"title": "Five Stars", "rating": "5", "body": "capsules are much easier to swallow than tablets!", "helpful": 0}, {"title": "All good!", "rating": "5", "body": "Got product on time and what I wished. All good!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great price, great product...mobile and love ON!", "helpful": 0}, {"title": "Good product", "rating": "5", "body": "I have been using this product to help with the numbness of fingers and toes after Chemo treatment. It does seem to help, but really do not know how many pills to take a day. Spoke to doctor, who said that it will not hurt to use. It is very difficult to get an Oncologist to commit to any treatment other than their, cooky cutter treatment, which can be found on the web. I have been taking one pill in the morning.", "helpful": 0}, {"title": "Good stuff", "rating": "5", "body": "Noticing my gains since i started taking these", "helpful": 0}, {"title": "great", "rating": "5", "body": "Take these daily after my workout. great price", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "optimum always has quality products with no bs", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product and super fast shipping! A+++++", "helpful": 0}, {"title": "Good Glutamine", "rating": "4", "body": "Works great. Helps alleviate muscle soreness.", "helpful": 0}, {"title": "Great", "rating": "5", "body": "Awesome product already seeing gains from it", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "A nice supplement for training and recovery", "helpful": 0}, {"title": "Optimum product", "rating": "5", "body": "If your looking for a good quality glutamine supplement then this is your guy, inexpensive and high quality. No bad taste, or side effects. I liked the serving size also which enables to to select exactly how much I need. Overall a good product", "helpful": 2}, {"title": "Five Stars", "rating": "5", "body": "Great Product! Will Definitely Buy Again!", "helpful": 0}, {"title": "this is the best", "rating": "5", "body": "Used it for years, this is the best brand", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product great price, fast shipping!", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "It arrived on time and is a good product.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "easy to digest, unlike others I've tried", "helpful": 0}, {"title": "this is what i want", "rating": "5", "body": "i love it and its cheaper than the other", "helpful": 0}, {"title": "Good way to get you glutamine", "rating": "5", "body": "Great product and a good way to get you Glutamine.  Easy to swallow capsules at a great price.  Highly recommend.", "helpful": 3}, {"title": "Good product!", "rating": "5", "body": "ON is a good brand as i use many of their products. I can feel less tired after working out and i normally take 2 a day since most proteins (mine) already include some type of amino acid chain in there. Extra easy to swallow and for the price you have to at least try it!! i normally took my pill after working out. No side effects", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "take one pill before and after workout", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Seems to be helping with muscle tissue", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "optimum always has quality products with no bs", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works as described!", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "They are glutamine pills", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "It arrived on time and is a good product.", "helpful": 0}, {"title": "Good deal.", "rating": "4", "body": "Good Price, good size. Good deal.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Love this vitamin supplement", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "best deal i have found..", "helpful": 0}, {"title": "Good price, Good product", "rating": "5", "body": "Works as stated. Good price, Good product. Will use again.", "helpful": 0}, {"title": "Great stuff", "rating": "5", "body": "Works on my IBS brilliantly!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works great.", "helpful": 0}, {"title": "Great product! Best brand!", "rating": "5", "body": "Great product! Best brand!", "helpful": 0}, {"title": "Great packaging.", "rating": "5", "body": "As expected. Great packaging.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excellent", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Being using it for a while works good.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "love it.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent", "helpful": 0}, {"title": "Does what it should", "rating": "5", "body": "Excellent product.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excellent", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good product", "helpful": 0}, {"title": "Using with omegas and chlorophyll for ulcerative colitis pain and ...", "rating": "5", "body": "Using with omegas and chlorophyll for ulcerative colitis pain and am starting to notice a difference. .haven't had a flare in weeks.", "helpful": 2}, {"title": "Five Stars", "rating": "5", "body": "Great", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excelente", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "works great", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "MUY BUENO", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Love it!!", "helpful": 0}, {"title": "great product and price", "rating": "4", "body": "works great for rest and recovery.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Hell yes", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "thanks", "helpful": 0}, {"title": "Wonderful Product", "rating": "5", "body": "This product definitely reduces your desire for sweets. I would recommend this product to anyone who is watching their diet and has a sweet tooth.", "helpful": 9}, {"title": "Five Stars", "rating": "5", "body": "Nice products", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Real creatine..enough said", "helpful": 0}, {"title": "Good product", "rating": "4", "body": "Good price for the product", "helpful": 0}, {"title": "Great product! Best brand!", "rating": "5", "body": "Great product! Best brand!", "helpful": 0}, {"title": "Great for Intense Workout Recovery!", "rating": "5", "body": "If you read my other reviews, I purchase a lot of Optimum Nutrition brand supplements.  Because these guys make only quality products.  Glutamine helps in aiding recovery after intense workouts, and this stuff does the trick!  I'm 45 and need all the help I can get after an intense workout!", "helpful": 1}, {"title": "just what i needed", "rating": "4", "body": "this was the final product to my body building arsanal of suplements works great and i can definately see good results", "helpful": 1}, {"title": "Best Deal", "rating": "5", "body": "Best deal around if you don't like drinking powders all the time.  Plus this will last you for a good amount of time.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "I will order these again.", "helpful": 0}, {"title": "I can walk after squats!", "rating": "5", "body": "This stuff is a lifesaver", "helpful": 0}, {"title": "Two Stars", "rating": "2", "body": "Not for arthritis well RA", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "This glutamine is great.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "They are glutamine pills", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "best deal i have found..", "helpful": 0}, {"title": "Excellent for the cost!", "rating": "5", "body": "Excellent for the cost!", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Will continue to order.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "love these, great price", "helpful": 0}, {"title": "It worked well for me.", "rating": "4", "body": "It worked well for me.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great deal per tablet!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Exactly what I wanted.", "helpful": 0}, {"title": "Great Product", "rating": "5", "body": "Once again ON has performed great, this capsules are easy to swallow and cheap. However the dosage is wrong for someone looking to build muscle, I switched to the powder because popping pills got tiring.", "helpful": 0}, {"title": "Good product !!", "rating": "5", "body": "Good cheap and does the job it's suppose to. It does exactly what it says on the back of the tub.", "helpful": 1}, {"title": "Four Stars", "rating": "4", "body": "Great quality product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Exactly as described.", "helpful": 0}, {"title": "good results", "rating": "5", "body": "On time, good results", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "it's what I needed...", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I love this product..", "helpful": 0}, {"title": "great deal !", "rating": "5", "body": "I refuse to go to the vitamin Shop anymore to get ripped off,. 240 caps for $22, what a deal !!", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "👍🏽👍🏽👍🏽👍🏽👍🏽", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Perfect for 7u joint", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Just what I wanted.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works as described!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works as described!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "helps with recovery", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Top 3 supplements!", "helpful": 0}, {"title": "Does what it should", "rating": "5", "body": "Excellent product.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excelente producto", "helpful": 0}, {"title": "Very good quality.", "rating": "5", "body": "Very good quality.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excellent Product", "helpful": 0}, {"title": "excellent product", "rating": "5", "body": "excellent product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "So good product!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great supplement!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good Experience.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product 👍", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excellent thanks", "helpful": 0}, {"title": "excellent product", "rating": "5", "body": "excellent product, helps me supplement my daily training, I have noticed a big difference in keeping my body mass and helps eliminate the fat, recommended", "helpful": 4}, {"title": "Five Stars", "rating": "5", "body": "Amazing product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "my son loves it", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Recover faster.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Do as intended.", "helpful": 0}, {"title": "Cleared up my rash in a few days!", "rating": "5", "body": "I had a terrible rash that itched like crazy. I read that this might help, by clearing up my gut, of all things.  I also started a probiotic pill and fish oil. I was willing to try anything, and this combo worked within a few days of starting it. As an added bonus, I have been able to stop taking my GERD medication, which I believe may have been the thing I was allergic to. This is truly a wonder drug, and will continue to buy more. I only take one a day now, so a bottle lasts a long time and is well worth the price.", "helpful": 9}, {"title": "ON supplements are a great value, no side effects", "rating": "4", "body": "Optimum Nutrition products are a great value, so I especially look for them when it's an item I'm going to take regularly. For glutamine, ON is a solid choice.", "helpful": 0}, {"title": "Great price", "rating": "5", "body": "Almost done with my first bottle and I'm deff getting another! Helps so much with soreness and aches from excercise. if you're an athlete and youre not taking some form of Glutamine youre doing your body a disservice. Great price too", "helpful": 1}, {"title": "Hard to swallow", "rating": "4", "body": "These pills are pretty large and are basically powder in a little plastic shell. They are rather hard to swallow even compared to similar sized pills. I use this along with BCAA pills protein powder and creatine powder, so what I started doing is opening the pills (the plastic shells are made of two parts and just pull right apart) and then dump it in with the rest of my powder. it works very well. This is cheaper than similar products and works well so ill be buying again.", "helpful": 1}, {"title": "They work!", "rating": "5", "body": "I really believe it Glutamine.  I usually take them after a strenuous workout, but sometimes take them before a long run.  ...prevents DOMS", "helpful": 0}, {"title": "I like these - convenient and small enough to swallow:)", "rating": "5", "body": "I like these - convenient and small enough to swallow:)  While others speak of curbing \"sugar cravings\" I didn't have many of these.  However, I do believe these have better helped me control my diet.  I purchased 2 of the 240 capsule bottles and they were delivered very quickly.", "helpful": 1}, {"title": "Great results", "rating": "5", "body": "I take a lot of supplements and hadn't tried glutamine yet until i bought this. Let me tell you - this is absolutely one of my favorite supplements to take anymore. I've noticed a significant difference in performance on leg days and also I don't cramp half as much as I used to. If you're on the fence, I'd say give it a try. Plus the price can't be beat.", "helpful": 1}, {"title": "Optimum Nutrition always delivers.", "rating": "5", "body": "I have been using glutamine for many, many years and this is just as good as the more expensive capsules or powder. Glutamine is glutamine, no need for proprietary blends, or special gimmicks. Optimum nutrition gives you exactly what you need, a consistently good product. If you didn't already know glutamine is an essential amino acid that helps greatly with muscle recovery, and helps lubricate joints among other benefits. I have been working out i.e. running, weights, MMA, crossfit, 5 days a week for the last 15 years. I can honestly say I don't know what I would do without a good glutamine supplement, before I started taking it my joints would crack, and hurt occasionally, and my recovery times were slower. Now all of that is gone. I highly recommend everybody takes a glutamine whether they are super active or simply past the age 30!", "helpful": 8}, {"title": "Amazing!!", "rating": "5", "body": "Huge difference in recovery time.  Read a lot of diverse opinions and decided to try myself because of major recovery pains in chest and shoulders.  Pain is seriously at a minimum now.  2 thumbs up!", "helpful": 3}, {"title": "so so", "rating": "3", "body": "it works great, but i much prefer the powder form, so i can just mix it in with my protein shakes, since it's tasteless.  i was told this helps with sugar cravings but i didn't find that to be the case.  but it works great for sore muscles, aids in recovery.  Just personal preference.", "helpful": 2}, {"title": "Five Stars", "rating": "5", "body": "Very effective", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "What I wanted!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product!", "helpful": 0}, {"title": "Great Product", "rating": "5", "body": "Since taking these pills, not even a month, I have noticed a significant increase in the strength and appearance of my nails. They were very weak and brittle. They are harder, stronger, and look way healthier than before. I'm not sure what it has done for my hair, because it's been way too hot to straighten it. Additionally, this product helps my muscles rebuild after intense workouts; there is a noticeable reduction in my muscle discomfort following a workout.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "top notch quality. wish it was in bag and not capsule form", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "as advertised", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good product!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product", "helpful": 0}, {"title": "Works", "rating": "5", "body": "Taking it during chemo and it really helps me recover.  This was recommended by my doctor. I received it very timely.", "helpful": 9}, {"title": "Other reviews are what I would go by since I", "rating": "4", "body": "I am taking it along with other supplements and so I am not sure how good this one helps.", "helpful": 0}, {"title": "Not sure if it has any effect or not.", "rating": "3", "body": "Not sure if this helps with joint pain, used a whole bottle and it is the same if I use it daily or if I don't use it at all. If you are just starting out in the gym, get these and after months you wont probably need them anymore since your legs get used to the weight.", "helpful": 1}, {"title": "Not bad.", "rating": "5", "body": "Aids in recovery and arnt too bad to eat.  I feel the dosage is a bit small here and might not be the best value but was better than nothing for sure!  I would buy them again perhaps if I dont see a better value but I am not regretful of getting these.", "helpful": 1}, {"title": "Gluuuuuuutamine!", "rating": "5", "body": "Its supposed to help with recovery and all those fun things, but I get plenty of it from my ON 100% Gold Standard Whey Protein powders.  I keep this around for those off days that I'm not chugging down protein powder like the antidote is in there.  It'll keep my glutamine levels up and help aid in recovery.", "helpful": 1}, {"title": "Supplements?", "rating": "4", "body": "Don't know a lot about these things, but I pay attention to articles in the bodybuilder.com website. They recommended this product as a daily supplement and I've been taking it along with protein, whey, and creatine. For an older guy I need all the help I can get, and so far I've seen good results.", "helpful": 1}, {"title": "Absolutely love this. Recovery time is super fast", "rating": "5", "body": "Absolutely love this .  Recovery time is super fast.  These are very clean and potent. works awesome after workouts. nothing will help you recover from a workout like this.", "helpful": 2}, {"title": "Good Product with good benefits... just one negative", "rating": "4", "body": "I'm aligned with all the other reviews of this product as it truly has improved my recovery and overall performance in the gym. The only comment I would have is that these caplets have not identifying color or name so if you are stacking this with the Optimum BCAA caplets (where 2 caplets is 1 serving) then you would not be able to tell the difference between them.", "helpful": 0}, {"title": "Much better cost per serving with the powder", "rating": "3", "body": "I bang weights really heavy and dosage per pill was way to low.  I run through the entire bottle in days.  With the powered version one scoop equals 5 pills.  Much better cost per serving with the powder form", "helpful": 1}, {"title": "Decent value", "rating": "4", "body": "I buy this product in this form not because I prefer the capsules, but because the cost per serving is cheaper than the mix.  I simply open and pour the contents of the caps in with my post work out shake to achieve the same results.  It doesn't dissolve the best, but its really not meant to be consumed this way, so I don't knock it for that.", "helpful": 0}, {"title": "Works fine.", "rating": "4", "body": "I don’t have too much to say about this product, not because it doesn’t work, but because I only notice subtle changes in helping me with soreness.  It does help supplement my protein meals where I get most of my nutrition.  I would recommend this to Weight Lifters.", "helpful": 1}, {"title": "I'm happy to report that I have lost a few unwanted ...", "rating": "5", "body": "I started taking this glutamine this a few months ago after a suggestion from a friend. I'm happy to report that I have lost a few unwanted inches and as a bonus I'm noticing quicker recovery times. I take it in the morning on an empty stomach and in the evening with food and have had no ill effects either way.", "helpful": 0}, {"title": "Two Stars", "rating": "2", "body": "Powder works a lot better and it saves you money. Pills 2/5 Powder 5/5", "helpful": 9}, {"title": "Five Stars", "rating": "5", "body": "EXCELLENT PRODUCT", "helpful": 1}, {"title": "Use often", "rating": "4", "body": "I take one of these before all my workouts and don't have a problem with soreness. It even makes me work harder in hot yoga and be able to do more poses and strength.", "helpful": 1}, {"title": "Good product!", "rating": "5", "body": "ON is a good brand as i use many of their products. I can feel less tired after working out and i normally take 2 a day since most proteins (mine) already include some type of amino acid chain in there. Extra easy to swallow and for the price you have to at least try it!! i normally took my pill after working out. No side effects", "helpful": 0}, {"title": "waste of money", "rating": "2", "body": "I feel it never really improve my soreness not even a little. I took 5 a night and i know it wasn't going to complete eliminate my soreness but I felt no different from if i wasn't taking it.", "helpful": 2}, {"title": "Five Stars", "rating": "5", "body": "Love this stuff!  It really does help with the soreness after work outs.  Highly recommend it.", "helpful": 0}, {"title": "outperformed my expectations", "rating": "5", "body": "Excellent product...was recommended by my Dr.,an N.M.D., and highly boosted my immune system. I was taking therapudic dosage though, but subsequent blood tests showed it worked. I should here also note that it was used along with fairly high doses of Now's N.A.C. also. Very powerful result together.", "helpful": 0}, {"title": "It ain't sexy, but it works", "rating": "4", "body": "I couple my use of glutamine with other, more \"sexy\" supplements. I've read on the benefits of glutamine supplementation and have added it to my mix, though I admit a user's not going to come away going \"Wow, I feel incredible after using this product\". At any rate, I've attained some goals during my workouts that I'm sure have something to do with my recent addition of glutamine. This particular product is a good size that allows you to discover whether glutamine is right for you without breaking the bank. The pills aren't incredibly huge and they're easy to digest with your favorite beverage.", "helpful": 3}, {"title": "I never review anything but I want to save others from the terrible pain I felt in the lower right side of ...", "rating": "1", "body": "BEWARE: This product contains Magnesium Sterate, which is in almost every pill I have taken from Optimum Nutrition. I never review anything but I want to save others from the terrible pain I felt in the lower right side of my stomach, which took me years and years to narrow it down to Optimum Nutrition Supplements and their harmful \"Other Ingredients\" . I even had my stomach scanned because I thought I had a tumor or something. I stopped taking ON pills with these additives and I have never had that stomach pain again. I will never buy ON products again. I wish someone told me this over 10 years ago and several doctor visits. Shame on this company and all the others that put this garbage in their supplements. If you don't know what Magnesium Sterate is, I highly suggest looking it up.", "helpful": 2}, {"title": "great!", "rating": "5", "body": "easy to drink you do not feel the pillow, medium size i recomend this product to everyone ho is still thinking to buy it", "helpful": 2}, {"title": "No Changes", "rating": "2", "body": "Didn't notice anything after finishing the whole bottle. I took these before working out, after working out, in the morning, in the night, etc., and I never noticed any changes.", "helpful": 1}, {"title": "Works Real Well", "rating": "4", "body": "I gave this 4 stars because although it works great, it is not as strong as the powder. I take 1-2 capsules daily on work out days before and after workouts. It works rather well and alleviates some soreness when I've been away from the gym for a few days and want to go back in lifting big. I have noticed some unusual side effects taking it, one being the need to make a bowel movement frequently. I researched this on google and glutamine should not do that, in fact it should ease your bowels. Others in my house who had trouble with constipation tried this for other issues and they had the same side effect. I continue to take it knowing that because it does work. I purchased this because it was half the cost of the powder and should last much longer as you take capsules as needed. I figured it would be a pain measuring with the powder and the powder would run out quick on days I overestimated. I recommend this.", "helpful": 1}, {"title": "GO O.N. !!!", "rating": "5", "body": "Received and am very pleased. Have always love optimum nutrition products, have nearly tried them all except for their glutamine. Heres your chance at a fair price i might add. Have used powdered previously now moving onto pills. Have fun not being sore and building muscle!😁", "helpful": 0}, {"title": "nice product to get.", "rating": "5", "body": "I got this cause my GNC went retarded on their glutamine. Used this and I never got sore. Never!! Recovery times were great as well.", "helpful": 2}, {"title": "Work for me", "rating": "4", "body": "I've been taking these pills before my workouts for about 3 weeks now. They were recommended by a fitness trainer. They give me the extra energy to push myself. I have not had any side effects from them.", "helpful": 1}, {"title": "Perfect", "rating": "5", "body": "The capsules are medium size and easy to swallow.  Pricing for the quantity was very competitive. Not a single complaint.", "helpful": 2}, {"title": "Great product", "rating": "5", "body": "The ítem arrived on time and the bottle is made of hard plastic: very convenient if you drop it from your shaking post workout hands. The capsules look big but they're easy to swallow.", "helpful": 1}, {"title": "No complaints", "rating": "5", "body": "Well, this is one of those things that's almost impossible to \"tell\" if it's doing anything for you, but with that said, I've had no negative issues with it, whether product quality related, health related or shipping related.", "helpful": 0}, {"title": "High Quality", "rating": "5", "body": "I bought these a long time ago, and I do not take the recommended dose. I take about half that and only on days I work out, and after.", "helpful": 0}, {"title": "Pod product", "rating": "5", "body": "Glutamine is what it is. It helps ur body repair after a good workout. You can't really feel a difference until u do a hard workout", "helpful": 2}, {"title": "Great supplement...", "rating": "4", "body": "I began taking this particular supplement around 2 weeks ago with others I ordered at the same time. Although it's not an essential amino acid I have noticed a change in my energy level while working out. It is a substance naturally produced in the body and I'm not some big supplement freak but when I find a product I like, I stick with it. I only take all natural stuff like protein, BCC's and creatine. In my book this is as essential as anything I've tried. It was delivered well before the guranteeed delivery date and in new condition as promised by the vendor. This no dout comes higly recommedned on my behalf...", "helpful": 2}, {"title": "Stop being sore after intense workouts. Take this!", "rating": "5", "body": "Taking this product definitely helps to keep my muscles from being so sore after a hard workout. I would recommend this to anyone who does not want to be as sore the next couple of days after a hard workout.", "helpful": 0}, {"title": "Helps a little.", "rating": "3", "body": "Not a big difference in relieving joint pain but any little bit is better than nothing. Price is fair on this one.", "helpful": 2}, {"title": "Great Product", "rating": "5", "body": "Once again ON has performed great, this capsules are easy to swallow and cheap. However the dosage is wrong for someone looking to build muscle, I switched to the powder because popping pills got tiring.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Helped my GABA and Post Workout", "helpful": 2}, {"title": "Five Stars", "rating": "5", "body": "top notch quality. wish it was in bag and not capsule form", "helpful": 1}, {"title": "Good'n'Cheap", "rating": "5", "body": "This is how I like my ON products cheap, in bulk, and shipped faster than expected I highly recommend we all utilize Glutamine in our sups", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "I am pleased with our business transaction.", "helpful": 1}, {"title": "One Star", "rating": "1", "body": "Not nearly as good as the powder. Huge pills.", "helpful": 1}, {"title": "Less sore and shorted recovery period", "rating": "4", "body": "Since started this I have noticed my recovery time is Lil bit shorter especially after heavy leg days. I recommend this product very good. In fast shipping using prime.", "helpful": 0}, {"title": "great delivery time", "rating": "5", "body": "let me start by saying that this product works 100% for sure - it gives you the feeling of not feeling sore after a hard work out. it makes your beard grow faster. i will def buy again", "helpful": 0}, {"title": "Good Glutamine", "rating": "4", "body": "Now I have heard that Optimum Nutrition is not the best supplement company and that very well may be true, but from my experience, the supplements are of good quality.", "helpful": 1}, {"title": "just what i needed", "rating": "4", "body": "this was the final product to my body building arsanal of suplements works great and i can definately see good results", "helpful": 1}, {"title": "Best Deal", "rating": "5", "body": "Best deal around if you don't like drinking powders all the time.  Plus this will last you for a good amount of time.", "helpful": 1}, {"title": "This is a great supplement if you are working out fasted", "rating": "5", "body": "This is a great supplement if you are working out fasted! It helps you retain your muscle mass while burning off the fat! Do not work out fasted without these!", "helpful": 0}, {"title": "I think it is GREAT", "rating": "5", "body": "Have been taking this for some months now.  I have a couple health conditions and it seems to have helped with my digestive track issues.  I highly recommend this product.", "helpful": 0}, {"title": "Hard to take", "rating": "2", "body": "The pills stick in the throat. When I tried to open them and just use the powder in water, the powder would not mix, only floated on top. $ down the drain.", "helpful": 0}, {"title": "good product, good source", "rating": "5", "body": "This was the best price i found (incl shipping) for this product which I've used for several years, my local source was unfunded this year and I had to find another one.", "helpful": 0}, {"title": "Impressed", "rating": "4", "body": "I had a friend recommend using Glutamine and I am so glad I actually listened to her.  This would have had been 5 stars, but the capsules are huge, but u can break them and mix it in with water or post workout recovery drinks (doesn't really alter the taste).  Would recommend to anyone that hates being super sore after a hard workout.", "helpful": 6}, {"title": "Simple, but uncomfortably large capsules", "rating": "3", "body": "The product is straightforward based on the nutrition label. However, the capsules are pretty large and I had a scare or three taking them over the months. I've resorted to dumping the capsules' contents.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Great.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great!", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "its ok", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "thanks", "helpful": 0}, {"title": "great products!!", "rating": "5", "body": "I have been using this brand for most of my workout supplements and i really like it.. They have been around for a while and are made with high quality ingredients.. ON products work well.. cant go wrong with this brand.", "helpful": 1}, {"title": "O.K is my best guess", "rating": "3", "body": "I can't really say it helps. Most of it is in my head. But definitely trying to have good products as I try to get in the best shape of my life. And after some intense research On supposedly spot On! But also trying less known and less expensive products I would recommend they in expensive choice for you really can't tell the difference let alone if it works. I definitely don't feel what is says it will do 45 minutes prior to hitting the gym.", "helpful": 0}, {"title": "Good bang for the buck", "rating": "4", "body": "I have used Optimum Nutrition products for 3 years and have yet to be disapointed.  They really don't skimp on quality and have clearly marked labels with what their supplements do, and do not have.  This, along with their other products are priced very well for the quality level, which is very high.  I plan to continue to use.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Good!", "helpful": 0}, {"title": "I love this product", "rating": "5", "body": "I love this product. This is the third time I have purchased this product and it really works.  Will definitely recommend to friends.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "These worked great, helped me recover extremely fast after a vigorous work out. Will be buying again.", "helpful": 0}, {"title": "L-Glutamine 1000mg", "rating": "5", "body": "This product really does help when I am going to the gym and I don't feel as sore the next day.  Great price and great product.", "helpful": 0}, {"title": "Get your world together with this stuff.", "rating": "5", "body": "A good deal for high quality. Body builders take them, but it is really brain food.", "helpful": 0}, {"title": "Good", "rating": "5", "body": "Helps recovery time quite a bit.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "This stuff is so good for the gut, brain, and muscle tissue. Excellent pricing as well!", "helpful": 0}, {"title": "Great supplement", "rating": "5", "body": "Great supplement for a good price", "helpful": 1}, {"title": "One & Done.", "rating": "3", "body": "Does the job, but leaves no memorable or lasting effects.  Bought once, used it, & won't buy or use it again.", "helpful": 0}, {"title": "Get It", "rating": "5", "body": "This is a pretty good deal for the number of servings. I w\\dong think you will find a better deal under $20", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent product", "helpful": 1}, {"title": "Four Stars", "rating": "4", "body": "Have not been taking this long enough to see any results yet, but I will continue to take them.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great buy!", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Excelente", "helpful": 1}, {"title": "Taste funny", "rating": "5", "body": "I don't know if this stuff works but it is like taking any other vitamin I am sure it doesn't hurt.", "helpful": 0}, {"title": "I am not sure about this.", "rating": "4", "body": "Dr Ozz says we dont need these things but I am finding that I like the way I feel when i take them.", "helpful": 0}, {"title": "No complaints!", "rating": "5", "body": "ON products are a pretty safe bet for any supplements you may need.", "helpful": 0}, {"title": "Recommend it if you're into routine sports like swimming and running....!!", "rating": "5", "body": "Recommend it if you're into routine sports like swimming and running....!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good quality", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "I am a vegetarian and an athlete. I am liking this product so far", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good product. I haven't used as much as I should.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "bien", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Nice", "helpful": 0}, {"title": "Awesome Supplement", "rating": "5", "body": "I bought this to do exactly what the bottle says it does, and let me tell you IT WORKS. Definitely worth every Pennie and I noticed a difference.", "helpful": 0}, {"title": "Product received as expected. Quick response by vendor. ...", "rating": "4", "body": "Product received as expected. Quick response by vendor. This is the first time I consume this type of product, so lets wait till see results.", "helpful": 0}, {"title": "Awesome, felt the result immeaditely", "rating": "5", "body": "Started taking this and i felt the result immediately on the very first day i took them.", "helpful": 3}, {"title": "I love this product", "rating": "5", "body": "I love this product. This is the third time I have purchased this product and it really works.  Will definitely recommend to friends.", "helpful": 0}, {"title": "L-Glutamine 1000mg", "rating": "5", "body": "This product really does help when I am going to the gym and I don't feel as sore the next day.  Great price and great product.", "helpful": 0}, {"title": "... want to carry around the jog this is your best alternative.", "rating": "4", "body": "I prefer the powder for faster absorption but if you don't want to carry around the jog this is your best alternative.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good quality", "helpful": 1}, {"title": "One & Done.", "rating": "3", "body": "Does the job, but leaves no memorable or lasting effects.  Bought once, used it, & won't buy or use it again.", "helpful": 0}, {"title": "Hard to say my results aren't just from hard work at the gym. Think so.", "rating": "4", "body": "I'm new to Glutamine supplements so I'm still gauging whether or not these are effective. So far I think so.", "helpful": 0}, {"title": "Love working on my lean muscle and I take these ...", "rating": "5", "body": "Love working on my lean muscle and I take these just before I workout and I believe they make a difference!", "helpful": 0}, {"title": "Get It", "rating": "5", "body": "This is a pretty good deal for the number of servings. I w\\dong think you will find a better deal under $20", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "These worked great, helped me recover extremely fast after a vigorous work out. Will be buying again.", "helpful": 0}, {"title": "I am not sure about this.", "rating": "4", "body": "Dr Ozz says we dont need these things but I am finding that I like the way I feel when i take them.", "helpful": 0}, {"title": "Taste funny", "rating": "5", "body": "I don't know if this stuff works but it is like taking any other vitamin I am sure it doesn't hurt.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great buy!", "helpful": 1}, {"title": "Four Stars", "rating": "4", "body": "Have not been taking this long enough to see any results yet, but I will continue to take them.", "helpful": 0}, {"title": "Not for everyone I guess", "rating": "1", "body": "This product did not seem to work for me.  I would still be sore after workouts if I took the pills before and after lifting.  These pills were easy to take though, and it seems to work for other people judging on the reviews", "helpful": 2}, {"title": "Five Stars", "rating": "5", "body": "Excelente", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "This stuff is so good for the gut, brain, and muscle tissue. Excellent pricing as well!", "helpful": 0}, {"title": "Get your world together with this stuff.", "rating": "5", "body": "A good deal for high quality. Body builders take them, but it is really brain food.", "helpful": 0}, {"title": "Helps your muscles after exercise!", "rating": "5", "body": "I take 1 capsule after exercising (running for 1 hr + weights) and ii has helped my muscles recover faster", "helpful": 3}, {"title": "Recommend it if you're into routine sports like swimming and running....!!", "rating": "5", "body": "Recommend it if you're into routine sports like swimming and running....!!", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "Ok", "helpful": 0}, {"title": "No complaints!", "rating": "5", "body": "ON products are a pretty safe bet for any supplements you may need.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I am a vegetarian and an athlete. I am liking this product so far", "helpful": 0}, {"title": "It's amazing awesome I recommend everyone started using", "rating": "5", "body": "It's amazing awesome", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good quality, very good price, I will continue buying this brand", "helpful": 0}, {"title": "Good product, works fine!", "rating": "5", "body": "not bad, good for recovery, but you shouldn't use too much of it", "helpful": 0}, {"title": "hard to beat the value", "rating": "5", "body": "I was having serious soreness and joint discomfort while working on a major landscaping renovation", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "I would not buy caps the next time. Just buy the powder.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "i love this because it seems like i almost never run out", "helpful": 0}, {"title": "Great quality Glutamine", "rating": "5", "body": "ON's Glutamine capsules are easy to take and provide large amounts of Glutamine per serving. The capsules aren't oversized and provide a wonderful alternative to not-so-great-tasting powder.", "helpful": 1}, {"title": "Did not notice much of a difference", "rating": "3", "body": "These optimum nutrition glutamine capsules were fine but I personally did not notice much of a difference. They are good quality and reasonably prices. I just did not notice anything.", "helpful": 1}, {"title": "Great Product!!", "rating": "5", "body": "Great Glutamine product. Pre-Workout and Post-Workout.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "love it", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "Can leap tall buildings", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good staff", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I feel good taking these.", "helpful": 0}, {"title": "Great Product", "rating": "5", "body": "Since taking these pills, not even a month, I have noticed a significant increase in the strength and appearance of my nails. They were very weak and brittle. They are harder, stronger, and look way healthier than before. I'm not sure what it has done for my hair, because it's been way too hot to straighten it. Additionally, this product helps my muscles rebuild after intense workouts; there is a noticeable reduction in my muscle discomfort following a workout.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "item as described.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "nice product thanks.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good buy!!", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "Nothing remarkable about it so far......", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Very happy with the product and seller.", "helpful": 0}, {"title": "left a bad after taste", "rating": "2", "body": "To expensive,  left a bad after taste", "helpful": 0}, {"title": "It 's ok", "rating": "3", "body": "was not impressed with that product,  u need to take too many pills, to feel deference .", "helpful": 1}, {"title": "Stomach", "rating": "4", "body": "Made me less sore but upset my stomach and don't know why otherwise product great for recovery makes recovery time less", "helpful": 1}, {"title": "Great", "rating": "5", "body": "Exactly what i was looking for. Cheap and effective. i will probably be purchasing again soon. I'm almost out of them.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "These are great and a great price.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good product from a good brand...", "helpful": 0}, {"title": "Works great.", "rating": "5", "body": "It is what I wanted. Works great.", "helpful": 0}, {"title": "Glutamine ups and downs", "rating": "4", "body": "I received the item at the designated time. Cant say that I feel absolutely \"nothing\" the next day after workout, but cant say it didn't help either.", "helpful": 5}, {"title": "Five Stars", "rating": "5", "body": "Great stuff!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great!", "helpful": 0}, {"title": "Good bang for the buck", "rating": "4", "body": "I have used Optimum Nutrition products for 3 years and have yet to be disapointed.  They really don't skimp on quality and have clearly marked labels with what their supplements do, and do not have.  This, along with their other products are priced very well for the quality level, which is very high.  I plan to continue to use.", "helpful": 1}, {"title": "Average", "rating": "2", "body": "Tough to notice a difference using these things (because I use other supplements in combination), however, the rating of them just being okay is that the pills are excessively large, and usually one would like to take 2 or 3 of them in one setting (which is impossible to do without food for anyone who is not use to swallowing large pills).", "helpful": 2}, {"title": "Didn't notice a difference", "rating": "2", "body": "I didn't really notice any change while taking this product.  My recovery time seemed the same.  Other products on the market seem to be better at decreasing soreness and recovery time.  Check out ON's recovery drink.  Worked wonders for me.", "helpful": 3}, {"title": "Great for my gut!", "rating": "5", "body": "Taking L Glutamine has helped tremendously with my intestinal issues.  This product has no negative sideeffects for me.  This amino acid supplement is a great addition to my multivitamin.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Great product and price.", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "Can leap tall buildings", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "capsule form is amazing", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "nice product thanks.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent!! product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "item as described.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Hope it's working!", "helpful": 0}, {"title": "save your money", "rating": "1", "body": "Don't fall into the same whole I did, this is a useless supplement, there's more glutamine in whey protein than these capsules and your body naturally makes them when it needs it, this is nothing more than these company trying to make more money, many articles and reviews you see are done by the these companies to make you believe you need this supplement to get gains.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Great supplement!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great Product!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "A1++++++++++++", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great quality.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "easy and fast", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Solid product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Is awesome this product for my stomach!!", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "worked great", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great stuff!", "helpful": 0}, {"title": "SPEEDY AMAZING RECOVERY BULK UP", "rating": "5", "body": "I have this big bottle on my gym bag every day, take on 10 on breakfast, 10 pre and post workout, 10 before bed, it helps me recover fast. This in combination with ON BCAA, you can't go wrong. Be well and bulk up, don't go cheap and sacrifice quality. One thing about Glutamine is that you should not expect it to be a magic pill, your routine and discipline should match your performance and workout regimen. BULK ON.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Good product and delivered quickly.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Excelente!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good staff", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good buy!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "thank you!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "EXCELENTE!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "EXCELLENT", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excellent", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Very good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Love it!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Quality!", "helpful": 0}, {"title": "I STRONGLY recommend buying it if the idea of taking glutamine makes ...", "rating": "4", "body": "Hell I dunno.  I am not qualified to review. I can't testify to purity.  I did not tests and I am not a professional athlete.  I STRONGLY recommend buying it if the idea of taking glutamine makes you life harder :)", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "thanks!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "love it", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "Made symptoms worse", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Normal", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "good@@", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product.", "helpful": 1}, {"title": "Another great ON Product", "rating": "5", "body": "Optimum Nutrition is the way to go for all health & fitness products. Taking 1 capsule with my Gold Standard shake post workout to help reduce soreness.", "helpful": 0}, {"title": "good product... good price", "rating": "5", "body": "good product... good price", "helpful": 0}, {"title": "Good Product", "rating": "4", "body": "I like the amount, It's easy to store and I enjoy the supplement. It helps with protein absorption and does not have a funny after taste.", "helpful": 0}, {"title": "Good value", "rating": "4", "body": "Good value, it is what it is. Glutamine is a great supplement for everyone.  I recommend this to anyone who is looking to put on muscle.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good product", "helpful": 1}, {"title": "dont get sucked into buying Glutamine", "rating": "1", "body": "If you're bodybuilding, dont get sucked into buying Glutamine, it is a waste of money and didnt create any extra growth for me.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Fine", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great price", "helpful": 1}, {"title": "I love it", "rating": "5", "body": "Very nice !", "helpful": 1}, {"title": "Not sure what benefit I'm getting from it. I ...", "rating": "3", "body": "Not sure what benefit I'm getting from it.  I work out 5X week and still the same since last year.  Use now for 2 months.", "helpful": 0}, {"title": "True", "rating": "5", "body": "this product is true to what it says...even when I am not doing what I am supposed to, this helps keep what I did do", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Love these", "helpful": 1}, {"title": "The package was delivered secure and in good condition. Upon unboxing I found everything to be ...", "rating": "5", "body": "Description of item was thorough and exact.  Deliver was on-time as requested and managed via UPS.  The package was delivered secure and in good condition.  Upon unboxing I found everything to be accounted for along with enclosed itemized packing list for my records.  Delivered item matched item description thus satisfying all of my immediate needs.", "helpful": 0}, {"title": "Not for your Glutes", "rating": "4", "body": "Not actually for your glutes, but great for recovery. Of course I know it's not actually for your glutes.", "helpful": 0}, {"title": "Great deal", "rating": "5", "body": "Not a whole lot to say the value of cost to the capsule content is a very good deal for Glutamine caps.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Awezome!", "helpful": 1}, {"title": "Bingo!", "rating": "5", "body": "Fast A shipping.  Super happy.", "helpful": 0}, {"title": "100% A+ * * * * *", "rating": "5", "body": "quick delivery!  perfect!!  thx", "helpful": 0}, {"title": "Helps your muscles after exercise!", "rating": "5", "body": "I take 1 capsule after exercising (running for 1 hr + weights) and ii has helped my muscles recover faster", "helpful": 3}, {"title": "Four Stars", "rating": "4", "body": "it's ok", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Any gym goers best friend.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great price, fast delivery", "helpful": 0}, {"title": "Did not work for me", "rating": "2", "body": "Really couldn't tell the difference. Will not buy again!", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good product and price", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "A good product!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Just received, will update after time.", "helpful": 0}, {"title": "Great for recovery", "rating": "5", "body": "I have a class on the third floor. Stairs after a leg workout the day or two before were a cumbersome obstacle. With glutamine, I hardly notice. I have to stand for 8 hours and move quickly for my job. Glutamine has reduced the soreness I feel after working out. I'm happy, just bought another 240 capsules.", "helpful": 2}, {"title": "Exactly what I ordered.", "rating": "5", "body": "Great product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "great product!!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good stuff", "helpful": 0}, {"title": "Great product", "rating": "5", "body": "Love it!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works", "helpful": 0}, {"title": "Not for everyone I guess", "rating": "1", "body": "This product did not seem to work for me.  I would still be sore after workouts if I took the pills before and after lifting.  These pills were easy to take though, and it seems to work for other people judging on the reviews", "helpful": 2}, {"title": "Five Stars", "rating": "5", "body": "nice", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "Time will tell how well these pills work.", "helpful": 0}, {"title": "BE VERY CAREFUL WITH THIS PRODUCT, I HAD A VERY BAD REACTION.", "rating": "1", "body": "This stuff almost killed me.  I got very bad migraines and became very clear after a short time of using it that my body cannot handle this product.  It messed with my brain chemistry and heart rhythm and I was only taking one capsule in the AM.  Be VERY cautious with this product, it can cause a stroke if you continue to take it when you shouldn't.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "good product!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "excellent", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Execellent!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product", "helpful": 0}, {"title": "As described", "rating": "5", "body": "As described", "helpful": 0}, {"title": "NO THANKS", "rating": "3", "body": "DIDN'T WORK", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "A++++", "helpful": 0}, {"title": "Recovery caps", "rating": "5", "body": "Lately I have really been taking as many supplements as possible to recover and these seem to work well as I have not been sore even after intense workouts. Well intense for me.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Execellent!", "helpful": 0}, {"title": "u will sleep sooo good. your welcome", "rating": "4", "body": "if u are fu**ed up from the gym. before to go to sleep take one and smoke a j. u will sleep sooo good. your welcome.", "helpful": 3}, {"title": "Five Stars", "rating": "5", "body": "Good stuff", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "works good i love it", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "excellent", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Very good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "very good", "helpful": 0}, {"title": "Great product", "rating": "5", "body": "Love it!", "helpful": 0}, {"title": "Optimum Nutrition is always a good buy for me.", "rating": "5", "body": "My BF & I take these daily in the AM & before & after workouts along w/ON BCAAs.  They work exactly as I'd like them to & the quality & price at what I expect from ON.  Always a happy customer.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "it's ok", "helpful": 0}, {"title": "I really like Optimum Nutrition", "rating": "5", "body": "Ive been using this for a few months now and its great! Ive switched over fully to Optimum Nutrition for all my supplements and have seen great results!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "A++++", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good!", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great", "helpful": 0}, {"title": "I will ever buy this product again, don't buy it. Amazon please you need to reinvent the review system here.", "rating": "1", "body": "I will ever buy this product again, don't buy it. I don't know what happen with the amazon reviews. Amazon please you need to reinvent the review system here. I think a lot of reviews about this product. are not honest.  Please research this product before you buy it. This glutamine cause me a headaches, insomnia, etc.", "helpful": 2}, {"title": "Good Quality. Reasonable Price", "rating": "5", "body": "Nothing super fancy here. Solid product for a great price. Will be buying more in the future when I run out.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "nice", "helpful": 0}, {"title": "One Star", "rating": "1", "body": "Save your money!!!!  I took it per the directions and I had zero results!", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "These were given to other people.. I am waiting to hear what they say.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Excelente", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Works fine.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "No further comments at this time.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good", "helpful": 0}, {"title": "One Star", "rating": "1", "body": "Good company and I don't doubt the purity, but glutamine is excessively-available in all but the most sparse diets.", "helpful": 1}, {"title": "Works for muscle recovery", "rating": "4", "body": "I have been training for a half marathon and found I was sore after long runs on the weekend. I read that glutamine helps with muscle recovery for athletes, and I must say I have noticed a difference taking this supplement. It is a bit expensive, but I will continue to use it if it helps my legs run harder and longer!", "helpful": 9}, {"title": "It is what it is", "rating": "3", "body": "Its Glutamine.  Hard to screw that up.  The capsules are normal size, and it helps in recovery.  Nothing great about this product, but nothing bad either.  It does what its supposed to.", "helpful": 1}, {"title": "Four Stars", "rating": "4", "body": "Good stuff", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "ANYTHING -ON- IS QUALITY", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "glutamine for days", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "WORKS", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Good", "helpful": 0}, {"title": "Glutamine is for chumps.", "rating": "3", "body": "\"I really felt the pump on my 8th set.\" Is apparently what people want to see in this review, because it is rated as a 1/5 in helpfulness.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "ANYTHING -ON- IS QUALITY", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "glutamine for days", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good stuff", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "satisfied", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "AWESOME", "helpful": 0}, {"title": "thanks", "rating": "5", "body": "thanks", "helpful": 0}, {"title": "a lot of protein powders i found have extra amino ...", "rating": "2", "body": "a lot of protein powders i found have extra amino acids in them so i wont buy more of this product than what i did probably", "helpful": 0}, {"title": "Great", "rating": "5", "body": "A+++", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great product", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "Good", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Cool", "helpful": 0}, {"title": "Glutamin", "rating": "5", "body": "Fast delivery. Good product at a good price  With Amazon Prime I had no shipping to pay.", "helpful": 3}, {"title": "Not the best!", "rating": "1", "body": "I didn't like the gelcaps on this product.  I went to MET-RX powder and love it.  Didn't like the taste", "helpful": 0}, {"title": "Easy to take", "rating": "5", "body": "I got this product to go along with an increase in my exercise program. It seems to shorten recovery time from the light high rep resistance exercises I started. The capsules are a lot easier to manage than the powder the heavy lifters seem to go for and I'm not into pumping iron and bulking up. Works well with my nootropic stack.", "helpful": 0}, {"title": "Spartan L-Glutamine", "rating": "5", "body": "I noticed the L-Glutamine made a difference in my workouts and recovery after going through about half of the bottle, very pleased with the product! Will continue to use.", "helpful": 0}, {"title": "Quality", "rating": "5", "body": "It's too early to tell how this is working. I'm quite certain it will do what it's supposed to. It's a better quality L Glutamine than I'd been taking previously.", "helpful": 0}, {"title": "It Works!", "rating": "5", "body": "These work great. There is a noticeable difference when taking these. I am less sore the next day when I take these right after my work out!", "helpful": 0}, {"title": "Two Stars", "rating": "2", "body": "I get occasional muscle cramps, after taking these for a while I still get muscle cramps.", "helpful": 0}, {"title": "Three Stars", "rating": "3", "body": "didn't get the results i was expecting  .. i wanted it  for energy...", "helpful": 0}, {"title": "As advertised", "rating": "5", "body": "Product was as described, and arrived on time.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "I am very pleased with my supplements.", "helpful": 0}, {"title": "Great price.", "rating": "5", "body": "Solid product. Great price.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Effective and good price", "helpful": 0}, {"title": "Easy to take", "rating": "5", "body": "I got this product to go along with an increase in my exercise program. It seems to shorten recovery time from the light high rep resistance exercises I started. The capsules are a lot easier to manage than the powder the heavy lifters seem to go for and I'm not into pumping iron and bulking up. Works well with my nootropic stack.", "helpful": 0}, {"title": "Appreciate the benefits of this supplement and trust Souce Naturals ...", "rating": "5", "body": "Appreciate the benefits of this supplement and trust Souce Naturals, even if I had rather have my supplements in capsule or gel form rather than tablet.", "helpful": 1}, {"title": "Great for muscle soreness", "rating": "5", "body": "A trainer friend of mine told me to begin taking glutamine after every workout, especially tough weight training sessions. It helps, a lot! I am truly impressed with this and will continue using it as I am sure there are other benefits other than muscle recovery.", "helpful": 7}, {"title": "A Daily Supplement", "rating": "5", "body": "Part of my autoimmune protocol.", "helpful": 3}, {"title": "Five Stars", "rating": "5", "body": "Recommend by dr to take. I trust this brand.", "helpful": 1}, {"title": "Four Stars", "rating": "4", "body": "Good price and value.", "helpful": 1}, {"title": "As advertised.", "rating": "5", "body": "Great item.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "As advertised, no problems, quality supplement.", "helpful": 0}, {"title": "ACID REFLUX CHOKING  SYNDROME.", "rating": "5", "body": "IF I TAKE THIS 3X DAILY IT HELS STOP THE CHOKING THAT HAPPENS WHEN YOU HAVE ACID REFLUX. BAKING SODA IN ICE WATER STOPS THE ACID BURN.  YOU ARE WELCOME, GLAD TO SHARE THE KNOWLEDGE.", "helpful": 1}, {"title": "Five Stars", "rating": "5", "body": "Awesome product and awesome service!", "helpful": 0}, {"title": "Great product stops nausea in about 2 hours!", "rating": "5", "body": "Really helps with nausea after surgery! I couldn't barely eat for 3 weeks from drugs during surgery and this worked in 2 hours!", "helpful": 1}, {"title": "Great product stops nausea in about 2 hours!", "rating": "5", "body": "Really helps with nausea after surgery! I couldn't barely eat for 3 weeks from drugs during surgery and this worked in 2 hours!", "helpful": 1}, {"title": "Contains Toxic Matter", "rating": "2", "body": "By toxic matter I'm referring to a listed ingredient: Magnesium Stearate. Other than that it's a good supliment and the price functions.", "helpful": 0}, {"title": "Four Stars", "rating": "4", "body": "not sure I will continue taking...too many vitamins ughhhhh", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "easy to swallow - good product.", "helpful": 0}, {"title": "Five Stars", "rating": "5", "body": "Great for recovery", "helpful": 0}]