[{"helpful": 1, "title": "Appears to fade Melasma", "body": "I had read an article that Grape Seed Extract may help fade melasma.  I've had melasma on my face, brown patches on my forehead and cheeks, for over 15 years. I never leave the house without make-up/foundation.  I've tried various hydroquinone fade creams, Retin A and other products attempting to get rid of the brown patches on my face (I have fair to medium skin).  I use high SPF sunscreen religiously every day, winter and summer, but the brown patches still appear, and are always darker in the summer.  I purchased this Grape Seed Extract at the beginning of the summer in hopes that it might help.  I've been taking two capsules per day, for the past 5 months or so.  At first I noticed that the brown patches didn't darken as they normally would during the summer. Eventually the melasma patches became paler, now the patches are the palest they have ever been in 15 years, much closer to my skin color.  I can use much less make-up/foundation to even out the look of my skin.  The only difference in my usual skin care routine has been taking two of these Grape Seed Extract capules every day for the past 5 months, I've gone through several bottles.  I am quite convinced that my significantly improved skin tone is likely a result of taking the Grape Seen Extract.  I've never written an Amazon review before, but I felt compelled to share my experience with fellow melasma sufferers.", "rating": "5"}, {"helpful": 7, "title": "Potent product", "body": "I am usually a skeptic when it comes to supplements. Many (most?) are advertised as having great benefits, based on little more than opinion. Anti-oxidants are somewhat different as they have more of a basis in evidence-based medicine. In my case, I find that grape seed extract provides a couple of concrete benefits.", "rating": "5"}, {"helpful": 9, "title": "I also use it daily to reduce anxiety and help my brain work better. I notice a difference", "body": "We use this grape seed extract for my son who has ADHD.", "rating": "5"}, {"helpful": 8, "title": "Does it lower eye pressure?", "body": "I don't normally like to take pills but my interocular pressure has been steadily moving up.  A year ago it was up to 22 to 24 mmHg  in both eyes.  A friend with glaucoma told me he thinks grape seed extract has helped  him.  I started  taking it about 100 days ago  and when I saw my doctor a few weeks ago  my pressure was down to 16 in both eyes. This is right in the middle of the normal range.  Did the grape seed extract cause this change?  Who knows?  But I plan to continue taking it.  I haven't noticed any ill effects.", "rating": "5"}, {"helpful": 3, "title": "Improves skin condition", "body": "I'm taking this product for circulatory health, hard to notice what effect it's having there but I have noticed my skin condition improving and brown spots on my face have disappeared.  I have been taking for about 3 months and will continue to do so.", "rating": "5"}, {"helpful": 9, "title": "stabilizes blood pressure", "body": "I have hypertension and am on many meds to control it but I'd still get lots of fluctuation throughout the day.Since taking grape seed extract my blood pressure does not fluctuate much at all - a big problem for me in the past. I feel better since taking these!", "rating": "5"}, {"helpful": 4, "title": "Grape Seed Extract", "body": "For me This is the best way to boost my immune system.Since taking grape seed extract I have not caught a cold in four years.They have grape seed extract for cats and My 18 year old tabby takes it and acts like a 9 year old...deshane", "rating": "5"}, {"helpful": 2, "title": "It really works.", "body": "I love this supplement. I've been taking OL Grape Seed Extract for over a year now I can tell you I have been able to avoid colds and viruses other family members caught, even when I had to care for them while they were contagious.  This was never the case before using OL grape seed extract. I've got my 76 yr old mom add this to her vitamin regiment and she's also gone through this winter without catching  a cold or the flu. I'm sold.", "rating": "5"}, {"helpful": 5, "title": "Excellent product, very high recommendation", "body": "I stumbled on grape seed extract when I went searching for an answer to my itchy weepy ears.  After wading through hundreds of web pages and comments someone suggested grape seed extract as a potential solution.  I hit the pharmacy and bought a bottle, and much to my delight achieved relief for the first time in years.  In addition to the wet itchy ear relief, I have found that some psoriasis issues that I was experiencing were significantly diminished as well.  The only problem that I experienced was that my regular pharmacies and stores did not often stock GSE and even the local health/nutrition stores like GNC were spotty at best(and obscenely over priced I might add)so I turned to Amazon hoping for a good option.", "rating": "5"}, {"helpful": 7, "title": "With the product, I feel no cold with my feet", "body": "I am 72 year -old , and normally have cold feet in the winter . However After I took the product about one week later, I have only a few times in feeling cold with my feet. It is my best recommendation for the product.", "rating": "5"}, {"helpful": 9, "title": "righted wrong", "body": "I received a lower dosage than what I had purchased and contacted the seller to tell them. They then offered me a 25% refund on my purchase, which I didnt think was a fair amount of compensation. I voiced my displeasure with them very directly and not only did they fully refund my purchase but the owner called me personally to make sure I was satisfied. I was impressed with that level of care.", "rating": "5"}, {"helpful": 5, "title": "Great supp.", "body": "I love these. Finally normal blood pressure, without nasty drugs. It's also helping, fade, the dark spots on my forehead. (that was a bonus) I highly recommend them. Great strength, amount and price. Will keep buying these.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Added to morning drink. .", "rating": "5"}, {"helpful": 3, "title": "It is a very good product for circulation and inflammation", "body": "I get these for my husband. However I take them too. He uses them to help with his varicose veins.  They have shrunk the swelling of the veins. It is the ONLY product he/ I will use due to the fact it is a naturopathic formulation. It is a very good product for circulation and inflammation.", "rating": "5"}, {"helpful": 1, "title": "Best Deal for GSE Caps---small, and no taste.", "body": "This has become a daily staple for me. I found taking it at early signs of infection helped to clear things up----namely a tooth ache I could not afford to go to the dentist for.  I also had a couple other infection risks that taking the grape seed extract seemed to help clear and prevent from needing full anti-biotics.  I now have been taking it daily during cold and flu season, and I think it has helped.", "rating": "5"}, {"helpful": 0, "title": "I was really happy with this item", "body": "I was really happy with this item. It arrived really quickly and was packaged well. Their customer service is superb and I truly love this brand. They are always available to their customers. The product itself is amazing and I have absolutely no complaints. I have recommended it to my friends and family members. I enjoyed being able to use a high quality product and the price is affordable. What more can you ask for!", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Happy", "rating": "5"}, {"helpful": 1, "title": "Seems to be an effective, quality product.", "body": "I purchased this because I had read somewhere that grape seed extract will help both our circulatory and lymphatic systems.", "rating": "5"}, {"helpful": 2, "title": "Olympian makes great grape seed extract.", "body": "We always keep this on hand for when we get colds, and it helps my daughter's cold to not turn into bronchitis or pneumonia.  This is the brand I've been buying locally for years and I was glad to find it on amazon.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product,fast shipping", "rating": "5"}, {"helpful": 1, "title": "Great product!", "body": "We have used grape seed extract for a long time.  We feel that there are many health benefits from using it, esp. for arthritic symptoms.", "rating": "5"}, {"helpful": 0, "title": "Outstanding supplement", "body": "Very high quality supplement for an awesome price! I take it everyday before the gym for a better workout with increased circulation. I also notice some benefits with eye puffiness and allergies. I have bought this product countless times and will continue to do so.", "rating": "5"}, {"helpful": 1, "title": "Great Product", "body": "Great Product, can tell a difference when I use it", "rating": "5"}, {"helpful": 0, "title": "Great Price for Grape Seed Extract", "body": "Great price for gse and it has 400mg.  The company appears to be genuinely interested in producing quality supplements.", "rating": "5"}, {"helpful": 5, "title": "Great supp.", "body": "I love these. Finally normal blood pressure, without nasty drugs. It's also helping, fade, the dark spots on my forehead. (that was a bonus) I highly recommend them. Great strength, amount and price. Will keep buying these.", "rating": "5"}, {"helpful": 0, "title": "Works good", "body": "No arguments on these.  They seem to be working but not all out potent that you will feel might from day changes but I like them.", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "Good product,fast shipping", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "It helps and I was told to take this with L-Arginine Amino supplement to get maximum benefit.", "rating": "5"}, {"helpful": 0, "title": "Grape seeds to help me pee.", "body": "Good stuff Im feeling better now that I'm taking it and I'm going to  order more .", "rating": "5"}, {"helpful": 0, "title": "Love it.", "body": "Grape Seed has more vit.C plus it doesn't give you the \"Runs\" with higher dosage with the grape seed.", "rating": "5"}, {"helpful": 0, "title": "Like", "body": "Seems to be fine.", "rating": "4"}, {"helpful": 1, "title": "Five Stars", "body": "The best one I have tried yet. Really helps with my tinnitus", "rating": "5"}, {"helpful": 4, "title": "After researching natural cures for fungal infections, I chose ...", "body": "After researching  natural cures for fungal infections, I chose grape seed extract as well as olive leaf extract.  The combination of these two supplements had a remarkable effect on my daughter's fungal infection on her toe. I am thankful for others who have reviewed the products so that I could make an educated decision.", "rating": "5"}, {"helpful": 0, "title": "Great antioxidant", "body": "A wonderful antioxidant for mopping up excessive toxins specifically ammonia, sulfates, and too much glutamate. Love this addition to my regimen as I am implementing the Amy Yasko Protocol.", "rating": "5"}, {"helpful": 0, "title": "Its great for people who have arthritis", "body": "Helps out a lot especially with reducing inflammation.  Its great for people who have arthritis.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "The product is quality and delivered on time", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Capsules are well make and dust free. Container well constructed even has a metal closure.", "rating": "5"}, {"helpful": 3, "title": "It is a very good product for circulation and inflammation", "body": "I get these for my husband. However I take them too. He uses them to help with his varicose veins.  They have shrunk the swelling of the veins. It is the ONLY product he/ I will use due to the fact it is a naturopathic formulation. It is a very good product for circulation and inflammation.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "I've used this brand a few times and I like it.", "rating": "4"}, {"helpful": 0, "title": "A great deal! Received it quickly and in good condition", "body": "A great deal! Received it quickly and in good condition. I use this product to stop tremors I get from certain medications. Works great!", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "fine product, all of expected", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "verygood!", "rating": "5"}, {"helpful": 9, "title": "righted wrong", "body": "I received a lower dosage than what I had purchased and contacted the seller to tell them. They then offered me a 25% refund on my purchase, which I didnt think was a fair amount of compensation. I voiced my displeasure with them very directly and not only did they fully refund my purchase but the owner called me personally to make sure I was satisfied. I was impressed with that level of care.", "rating": "5"}, {"helpful": 1, "title": "The strongest available for a great price", "body": "Olypian labs hit a home run on this product. It provides you with 400 mg of 95% OP's , strong dosage in one capsule. . 1 a day and your body will love you for it, Do a search on its benefits, amazing", "rating": "5"}, {"helpful": 2, "title": "Olympian makes great grape seed extract.", "body": "We always keep this on hand for when we get colds, and it helps my daughter's cold to not turn into bronchitis or pneumonia.  This is the brand I've been buying locally for years and I was glad to find it on amazon.", "rating": "5"}, {"helpful": 0, "title": "A good supplement to my diet", "body": "I take one before bed.  It seems to help me sleep better at night.  I have noticed minimal benefit for my BP.", "rating": "5"}, {"helpful": 9, "title": "works for bloating", "body": "i bought this, grape seed, oil, oregano oil, and something called garlicidin - seriously this has cured my stomach ills.  I can eat anything and dont get bloated.  of all the supplements i have bought and used, this combo actually works for a change to fix something.. amazing", "rating": "5"}, {"helpful": 0, "title": "I can't say anything about this yet. It's too ...", "body": "I can't say anything about this yet. It's too early. I've only had it for about a month, and I haven't seen anything magical.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "helps with all allergy", "rating": "5"}, {"helpful": 0, "title": "five stars", "body": "Very good Antioxidant. would buy again, would recommend.", "rating": "5"}, {"helpful": 6, "title": "GSE", "body": "This product comes at a great value, but I'm a little suspicious the dosage is too high for long term.  GSE can become prooxidant.  This comes with a lot of benefits allergies, inflammation, antioxidant.", "rating": "5"}, {"helpful": 3, "title": "Grape Revival", "body": "These pills work immediately. 1 in the morning and 1 at night. Awesome to help your liver, pancreas and blood.", "rating": "5"}, {"helpful": 1, "title": "i take 1 capsules 2 times a day with an ...", "body": "i take 1 capsules 2 times a day with an ounce of noni juice for pea size lipomas", "rating": "5"}, {"helpful": 7, "title": "Grape Seed Extract", "body": "The Grape Seed Extract seems to be working for lowering my husbands blood pressure from the 130's to the 120's.", "rating": "5"}, {"helpful": 3, "title": "Created an intense itching in my back and scalp", "body": "Following from another reviewer, I stopped taking it and the intense itching almost stopped. I was taking it as a supplement to try and help keep some of my hair (doubt it worked), but it did create this intense itching.", "rating": "1"}, {"helpful": 0, "title": "Outstanding supplement", "body": "Very high quality supplement for an awesome price! I take it everyday before the gym for a better workout with increased circulation. I also notice some benefits with eye puffiness and allergies. I have bought this product countless times and will continue to do so.", "rating": "5"}, {"helpful": 2, "title": "Good supplement", "body": "Have used this for years.  At 71, eyes are almost perfect except for reading glasses", "rating": "5"}, {"helpful": 4, "title": "One Star", "body": "its Proanthocyanidins，not oligomeric proanthocyanidins. the company has changed the tab", "rating": "1"}, {"helpful": 4, "title": "a new believer", "body": "I was skeptical but this supplement actually will lower your estrogen levels.", "rating": "5"}, {"helpful": 2, "title": "Five Stars", "body": "This is truly amazing, it will help your heart, and blood pressure.", "rating": "5"}, {"helpful": 4, "title": "Best Deal on GSE Anywhere!!", "body": "I have been taking GSE pretty regularly for about 3 years now.  I swear by it for keeping myself well and will tell anyone who will listen what a great supplement it is.  I have bought it from many places in strengths from 50mg (Target) - 50 caps for about $8 to 200mg (GNC) - 100 caps for about $20.  This 400mg/100 cap bottle for less than $20 is a steal and I would buy it again and again. I have sent the link to friends and you should not hesitate if considering the purchase.  I get sick in the winter about 50%+ less since I started taking GSE regularly.  It really works and if I had to choose one supplement to take, it would be this one over the 10 or so others I take including the COQ10 which I also swear by.  Love, love, love it, and can't say enough about being able to get such a high dose/qty at such a bargain.", "rating": "5"}, {"helpful": 2, "title": "Good price, good product", "body": "I have been buying this brand for some time. They have a good amount of grape seed extract per capsule, and the price is good. I tried another one that had gel capsules, but I found out they contain much less grape seed extract, and they have soy bean oil. This brand does not have oil, so it is good for me.", "rating": "5"}, {"helpful": 1, "title": "The strongest available for a great price", "body": "Olypian labs hit a home run on this product. It provides you with 400 mg of 95% OP's , strong dosage in one capsule. . 1 a day and your body will love you for it, Do a search on its benefits, amazing", "rating": "5"}, {"helpful": 5, "title": "Capsules come apart", "body": "The capsules come apart and extract is all over the place.", "rating": "1"}, {"helpful": 1, "title": "Works great when taken on a daily basis", "body": "Largest dosage available at this price point.. Works great when taken on a daily basis, 1-2 pills a day helps my circulation and lower my blood pressure.. I take in conjunction with Vitamin C.", "rating": "5"}, {"helpful": 0, "title": "Eh....", "body": "The product came undamaged. I began taking one pill everyday and so far I have not seen or feel any differences. It may work on others or it may just be a placebo effect. I have had no positive effects nor any negative effects using this product. So I give it a 3 star rating.", "rating": "3"}, {"helpful": 1, "title": "This is the best value that I've found", "body": "I've been using this product for about ten years. This is the best value that I've found. The  caps are smaller than most 400mg caps. Great product and value.", "rating": "5"}, {"helpful": 1, "title": "Wrong product", "body": "Well, I've ordered the Grape Seed Extract twice and both times I received another product.  Is this problem fixed yet?", "rating": "1"}, {"helpful": 1, "title": "Great product!", "body": "We have used grape seed extract for a long time.  We feel that there are many health benefits from using it, esp. for arthritic symptoms.", "rating": "5"}, {"helpful": 1, "title": "Best Deal!", "body": "I am very happy with this product. The amber glass jar really protects its integrity.This product comes at a great value.", "rating": "5"}, {"helpful": 1, "title": "GREAT PRODUCT!", "body": "One of the few vitamins that can cross the blood brain barrier to feed your brain.  Well worth the money!", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "It helps and I was told to take this with L-Arginine Amino supplement to get maximum benefit.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "The best one I have tried yet. Really helps with my tinnitus", "rating": "5"}, {"helpful": 1, "title": "Great Product", "body": "Great Product, can tell a difference when I use it", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Perfect. Helps reduce the water retention.", "rating": "5"}, {"helpful": 1, "title": "Its ok.", "body": "Bought this to help manage my High blood pressure but I really haven't seen a significant change in my numbers taking this.  I think it has a good antioxidant quality so I will likely take it for that reason and finish out the bottle but not repurchase due to the price.", "rating": "4"}, {"helpful": 4, "title": "Bad choice of providers", "body": "Pretty much a rip-off.  10% of the product had broken open and the bottle was a mess.  Thankfully, there are other providers than Olympian Labs!", "rating": "1"}, {"helpful": 3, "title": "Five Stars", "body": "Help me w Hair Loss.", "rating": "5"}, {"helpful": 0, "title": "Great antioxidant", "body": "A wonderful antioxidant for mopping up excessive toxins specifically ammonia, sulfates, and too much glutamate. Love this addition to my regimen as I am implementing the Amy Yasko Protocol.", "rating": "5"}, {"helpful": 2, "title": "Great supplement for balding", "body": "I love this product. I was suffering from a bald spot in the top of my head and I started taking these along with a vitamin.", "rating": "5"}, {"helpful": 2, "title": "Made my scalp itch", "body": "Since then I've looked up grape seed extract, and that may be true of any of such products if you don't tolerate it well.", "rating": "2"}, {"helpful": 0, "title": "Read the labels-use the magnifying glass and decide if you want the potential benefits of grape seed extract!", "body": "I tried this grape seed extract and I can not claim there is any noticeable difference between my regular grape seed extract supplement and this one. The most important point is after you read the label on either supplement-does it sound right for you? Check w/your doctor if you are taking prescription drugs. This one comes in a glass bottle. My regular one comes in the typical plastic bottle.", "rating": "5"}, {"helpful": 0, "title": "Love it.", "body": "Grape Seed has more vit.C plus it doesn't give you the \"Runs\" with higher dosage with the grape seed.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Very good for ADHD.", "rating": "5"}, {"helpful": 0, "title": "Love this products", "body": "Olympian I have use this brand for long time and the 400 milligram capsules of grape seed is an excellent antioxidant.", "rating": "5"}, {"helpful": 0, "title": "A great deal! Received it quickly and in good condition", "body": "A great deal! Received it quickly and in good condition. I use this product to stop tremors I get from certain medications. Works great!", "rating": "5"}, {"helpful": 0, "title": "Works good", "body": "No arguments on these.  They seem to be working but not all out potent that you will feel might from day changes but I like them.", "rating": "3"}, {"helpful": 0, "title": "Gives me a head ache", "body": "I read that this can give you a head ache, and it does. I'm not sure what to do but return it. Great idea, maybe smaller dose...", "rating": "2"}, {"helpful": 0, "title": "I can't say anything about this yet. It's too ...", "body": "I can't say anything about this yet. It's too early. I've only had it for about a month, and I haven't seen anything magical.", "rating": "4"}, {"helpful": 0, "title": "good product", "body": "helps control hunger and cravings. i would definetly recommned it as a daily supplement for anyone trying to control eating.", "rating": "5"}, {"helpful": 0, "title": "grape seed", "body": "I strong recommend this grade seed. Thanks for the excellent service, it is really a nice shopping experience. happy day!", "rating": "5"}, {"helpful": 0, "title": "Fight off crazy free radicals with OL's Grape seed extract.", "body": "So far it's been keeping me in top form and shape. Powerful antioxidants for your overall health. Good stuff. Thanks OL.", "rating": "5"}, {"helpful": 0, "title": "Great Price for Grape Seed Extract", "body": "Great price for gse and it has 400mg.  The company appears to be genuinely interested in producing quality supplements.", "rating": "5"}, {"helpful": 0, "title": "grape seed extract", "body": "very good product and I love the higher 400 mg.  The product compliments my system and doesn't cause me any discomfort.", "rating": "5"}, {"helpful": 2, "title": "One Star", "body": "This grape seed did not work very well. I've used cheaper brands that were better", "rating": "1"}, {"helpful": 0, "title": "Excellent!", "body": "I used to take coq10 but since I started to take this I don't need to take coq10 it works great I feel better.", "rating": "5"}, {"helpful": 0, "title": "A good supplement to my diet", "body": "I take one before bed.  It seems to help me sleep better at night.  I have noticed minimal benefit for my BP.", "rating": "5"}, {"helpful": 0, "title": "Its great for people who have arthritis", "body": "Helps out a lot especially with reducing inflammation.  Its great for people who have arthritis.", "rating": "5"}, {"helpful": 0, "title": "This product is excellent but last time I ordered for botles from Olympian ...", "body": "This product is excellent but last time I ordered  for botles from Olympian Labs  they sent me two botles of DIM, another product that I never ordered insted of the grape seed  extra so am not longer buying from olimpian labs", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "Capsules are well make and dust free. Container well constructed even has a metal closure.", "rating": "5"}, {"helpful": 0, "title": "I love this product and believe in it firmly but after ...", "body": "Every time I buy this, the price goes up- or there is something extra that I have to do to get it lowered that is ridiculous!  I love this product and believe in it firmly but after three years and more than a dozen price increases, I am thinking about going to another company.  Grape seed oil is grape seed oil.  And this is a ridiculous price.", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "good price", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Good deal", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "great service and great product", "rating": "5"}, {"helpful": 0, "title": "Excellent", "body": "Excellent product", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "nice", "rating": "4"}, {"helpful": 0, "title": "Three Stars", "body": "GOOD PRODUCT", "rating": "3"}, {"helpful": 3, "title": "Five Stars", "body": "Help me w Hair Loss.", "rating": "5"}, {"helpful": 1, "title": "Works great", "body": "This Grape Seed Extract is great for sinus problems-I find it  good preventative for colds and flu.  II have been using this natural remedy for at least 8 years.", "rating": "5"}, {"helpful": 0, "title": "Eh....", "body": "The product came undamaged. I began taking one pill everyday and so far I have not seen or feel any differences. It may work on others or it may just be a placebo effect. I have had no positive effects nor any negative effects using this product. So I give it a 3 star rating.", "rating": "3"}, {"helpful": 0, "title": "Four Stars", "body": "I've used this brand a few times and I like it.", "rating": "4"}, {"helpful": 0, "title": "will buy again", "body": "Good product,great service and on time delivery", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "They work great for boosting my metabolism.", "rating": "5"}, {"helpful": 0, "title": "Like it", "body": "Good product, will purchase again........", "rating": "4"}, {"helpful": 0, "title": "good price.", "body": "as advertised, fast delivery, good price.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Should be part of every vitamin regime", "rating": "5"}, {"helpful": 1, "title": "Raises your HDL", "body": "Grape seed raises Your HDL and this is a good brand.  I have found another Canadian brand with higher concentration of grapeseed at a better price.  But this is a good brand to start.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Very Good. My wife testifies ......", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "Very pleased with this supplement.", "rating": "3"}, {"helpful": 2, "title": "Happy shopping in Amazon", "body": "I'm so glad to find the high value 400mg of my special grape seed.  My families can't live  without it everyday.  This product has really good price.  I'm looking forward to having the same good feeling compare with GNC.  Then I will come back.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "This product works great for me.", "rating": "5"}, {"helpful": 0, "title": "Its a good grape.", "body": "Excelente. Its a good grape.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product and shipment", "rating": "5"}, {"helpful": 1, "title": "Extract was Needed", "body": "This health product was exactly what I had thought.  It seems to work well and the price was very good.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "helps with all allergy", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Cost-effective。$21.99", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Used it for years. Take many medications this keeps me healthy", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product !", "rating": "5"}, {"helpful": 0, "title": "dried up had to throw away", "body": "We're dried up", "rating": "1"}, {"helpful": 2, "title": "DAB order", "body": "This product is great.  I use it for sinus allergies every day.  Do not order it from DAB/direct super center either.  They have held my money captive for almost a month now.  I gave them lots of time to send the product and it never came.  I finally got ahold of them and the guy said he would send it in the morning and I should have it real soon because I dont live that far from the distributor.  A week later still no vitamins.  I called to day and the lady says they are out of stock.  It still doesnt say they are out of stock on Amazons website and I still have to wait for a shipping label to send them back a product I did not order at all.  If they were out of stock, why didnt anybody just have the decency to tell me that and at least send the mailing label to me so I could have my money back?  I am never ordering thru amazon again.  These companies are all getting to be a bunch of crooks.  They show these low prices just to draw you in and send you anything that is worth much less than what you ordered just so they make a bunch of extra money.  If they dont send that shipping label soon I'm just goingt to contact my credit card company and dispute this.", "rating": "1"}, {"helpful": 0, "title": "Three Stars", "body": "I wish I could tell if any supplements work, but I didn't notice anything.", "rating": "3"}, {"helpful": 0, "title": "Quality product", "body": "Looks like a quality product.  Appears to be a great price.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product", "rating": "5"}, {"helpful": 0, "title": "Pleased with all", "body": "Arrived quickly as described. Pleased with all. Thank you", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Received the order the next day as promised.", "rating": "5"}, {"helpful": 0, "title": "Grape Seed Extract Olympian Labs", "body": "Great product, great price, fast shipping", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "very useful, gifts for my mum", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Antioxidant support.", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "Pills are very large..", "rating": "4"}, {"helpful": 0, "title": "Three Stars", "body": "my wife just start to try,", "rating": "3"}, {"helpful": 0, "title": "As Expected", "body": "As Expected", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "All good as usual.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Pleased", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "will reorder", "rating": "5"}, {"helpful": 0, "title": "Will buy again", "body": "Great product!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I like it.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Frequent flyer", "rating": "5"}, {"helpful": 0, "title": "Good", "body": "Good", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Good value.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "GOOD!", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Seems good!", "rating": "4"}, {"helpful": 4, "title": "Bad choice of providers", "body": "Pretty much a rip-off.  10% of the product had broken open and the bottle was a mess.  Thankfully, there are other providers than Olympian Labs!", "rating": "1"}, {"helpful": 2, "title": "Happy shopping in Amazon", "body": "I'm so glad to find the high value 400mg of my special grape seed.  My families can't live  without it everyday.  This product has really good price.  I'm looking forward to having the same good feeling compare with GNC.  Then I will come back.", "rating": "5"}, {"helpful": 2, "title": "Looking for Grape Seed Extract", "body": "My wife uses grape seed extract as part of her fibromyalgia diet regimen.  This is the first product that provided the same benefit given by another manufacturer's product for less than a quarter of the price.  Very, very pleased with product.", "rating": "5"}, {"helpful": 2, "title": "Grapeseed Extract", "body": "This is some good stuff. I love it and will purchase it again. The product also came  on time, just like they said.", "rating": "5"}, {"helpful": 0, "title": "Good stuff", "body": "How does one rate Grape Seed Extract? The produce was what it was described to be. The price was also good, so feel free to buy it.", "rating": "5"}, {"helpful": 4, "title": "One Star", "body": "saw no differance", "rating": "1"}, {"helpful": 0, "title": "Hard to rate supplements as you never know if they ...", "body": "Hard to rate supplements as you never know if they work or not. But seems ok so far, Im still alive.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Very good product, Exellent.price", "rating": "5"}, {"helpful": 0, "title": "No Issue", "body": "Item delivered on time, was as described", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Great product, great price.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product and take it every day", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "O.K.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Thank you!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Love it!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 3, "title": "Seems to be making a difference", "body": "It's always hard to tell with dietary supplements, but here's the details:", "rating": "4"}, {"helpful": 1, "title": "Review for Grapeseed Extract", "body": "The product came really quick and is more than what was expected. It is great!I would recommend this product to anyone.", "rating": "5"}, {"helpful": 2, "title": "Arrived Promply, Haven't Started to Use it as Yet", "body": "I would recommend this product after testing it on myself and finding it effective to persons suffering from immune deficiencies.", "rating": "4"}, {"helpful": 0, "title": "Good", "body": "I just start to use it coz my aunt said that grape seeds is good for beauty,so far haven't feel any difference. Maybe it need more time.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "super", "rating": "5"}, {"helpful": 1, "title": "Wrong product", "body": "Well, I've ordered the Grape Seed Extract twice and both times I received another product.  Is this problem fixed yet?", "rating": "1"}, {"helpful": 0, "title": "love it", "body": "i am eating . i am not sure what will happen to me when i finish it . hope to be more beautiful:)", "rating": "5"}, {"helpful": 0, "title": "should be helpful~", "body": "I send it to my wife for her seems not quite good recently,hope it is helpful", "rating": "5"}, {"helpful": 3, "title": "Product Reads 400mg in Ad but Sent me 200mg.", "body": "Received the Grape Seed Extract but was supposed to be 400MG but bottle says 200MG. I called company and told them about the product error not being the right MG.  The bottle on there ad said 400MG in big letters so there is no mistake and the one I have says 200MG. The bottle still says 400 on there ad so I don't know how I received 200MG. I received 1 bottle of Olympian Labs Grape Seed Extract 200mg, 100 capsules bottle.", "rating": "3"}, {"helpful": 0, "title": "One Star", "body": "In the end, not for me.", "rating": "1"}, {"helpful": 1, "title": "First time to buy and get Wrong Item!", "body": "Get a DIM extra strength. Very disappointed.", "rating": "1"}, {"helpful": 2, "title": "DAB order", "body": "This product is great.  I use it for sinus allergies every day.  Do not order it from DAB/direct super center either.  They have held my money captive for almost a month now.  I gave them lots of time to send the product and it never came.  I finally got ahold of them and the guy said he would send it in the morning and I should have it real soon because I dont live that far from the distributor.  A week later still no vitamins.  I called to day and the lady says they are out of stock.  It still doesnt say they are out of stock on Amazons website and I still have to wait for a shipping label to send them back a product I did not order at all.  If they were out of stock, why didnt anybody just have the decency to tell me that and at least send the mailing label to me so I could have my money back?  I am never ordering thru amazon again.  These companies are all getting to be a bunch of crooks.  They show these low prices just to draw you in and send you anything that is worth much less than what you ordered just so they make a bunch of extra money.  If they dont send that shipping label soon I'm just goingt to contact my credit card company and dispute this.", "rating": "1"}, {"helpful": 3, "title": "Good stuff", "body": "I am very happy with this product. The amber glass jar really protects its integrity. Says I need 5 more words....", "rating": "5"}, {"helpful": 0, "title": "Not for me!", "body": "Maybe OK for some people but not for me. Be sure to check with your doctor Before you buy. Doctor told me not to take.", "rating": "3"}, {"helpful": 0, "title": "NOT AS GOOD AS GNC", "body": "I think gnc is better than that", "rating": "4"}, {"helpful": 0, "title": "dont know yet if it really works", "body": ".. but I keep taking it. I try to get my blood pressure down and have yet to see any results.", "rating": "4"}, {"helpful": 0, "title": "Good  price", "body": "If  you  don't  mind  waiting weeks  for  shiiping  i  guess  it's  a good  deal  blah  blah blah  blah  blah  blah", "rating": "4"}, {"helpful": 1, "title": "A Miracle!", "body": "Over the summer I experienced a bout of acute pancreatitis.  I was in the hospital for far to long, and when I was released I was told eat low fat, and here's some morphine.  Well, I was well for a day or two, then the pain started again.  The doctors said to fast and start over, and here's some more morphine.  Well that kept up for about 6 weeks.  So I started searching the internet.  I found several sites that recommended grape seed extract, and a longer fast.  So I fasted for 4 days, started taking the grape seed extract, and then started eating slowly again.  Since then (over a month now) I have experienced no pain, do not take morphine, and am ecstatic!  I take one of the pills in the morning.  If I have a meal that might be questionable, I take another, but usually one a day.", "rating": "5"}, {"helpful": 9, "title": "A supplement with a great track record", "body": "I am usually a skeptic when it comes to supplements. Many (most?) are advertised as having great benefits, based on little more than opinion. Anti-oxidants are somewhat different as they have more of a basis in evidence-based medicine. In my case, I find that grape seed extract provides a couple of concrete benefits.", "rating": "5"}, {"helpful": 5, "title": "I recently started opening one capsule and mixing with my favorite lotion and applying to face and other areas before ...", "body": "Taking this, seems to improve my sleep and reduce headaches. I think it's helping with weight loss too. I recently started opening one capsule and mixing with my favorite lotion and applying to face and other areas before bed, about twice a week.  I quickly noticed improvement to wrinkles and cellulite. No complaints here.", "rating": "5"}, {"helpful": 2, "title": "Another Excellent Supplement - I love it.", "body": "Grape Seed Extract crosses the blood brain barrier.  Not all supplements do that.  I LOVE it. What's important to me, may not be your thing, but I'm a health food person.  Before taking anything, I always did lots of research..... and you should too.  Get smart, be in the know.", "rating": "5"}, {"helpful": 1, "title": "This stuff is amazin ! Drastic reduction in allergies and arthritis in my knees", "body": "I started taking this product just because I had heard about the science behind it and some phenomenal benefits to general health – balancing out blood sugar, protecting the cardiovascular system, possible cancer prevention etc. I was not really expecting to notice anything, nevertheless the almost immediate benefits that I got. After I started taking this product within a week or so I noticed my knees were feeling better then they literally had in 5 years and I had a drastic reduction in my allergies. My allergies as a whole aren't that bad, especially because I take another supplement by Standard Process \"Attronex\" that prevents me from experiencing mild seasonal allergies… Which in Florida is most of the year. I highly recommend that product and a bottle will last you six months to a year depending on how you take it. After moving into another house last year I started having substantial allergies every morning. Anyways, at first I wasn't sure if The results were just a coincidence but after a few weeks when not only did that issues I was used to experiencing not come back but they continue to get better and better I was pretty sure it was this product. Months later I went on vacation and did not have this with me and within less than a week my knees felt absolutely horrible and I was experiencing substantial allergy symptoms too, thanks to my girlfriends cat. I was able to find a less potent version of the same supplement, also from the same Now brand while on vacation and paid way to much for it… But it was totally worth it! I also picked up some ginger, and this dried powdered form from the spice rack at the local grocery store, since this was another supplement I took for my knees but didn't have with me. Within less than two days of taking triple doses of the weak seed extract a couple times a day along with a tablespoon of ginger powder mixed in with some water (no it doesn't taste good thought I have done this every day for a couple years with either this or Tumerick) and I spent all day sightseeing the cliffs on the California ocean jumping from rock to rock and sightseeing in the mountains. Just two days earlier even going to the grocery store was killing my knees! were literally talking about around a 95% reduction in pain within a few days, while at the same time increasing a lot of activities that would definitely have  increased pain if I hadn't used these two supplements. Most hard-core narcotic medications can't even compete with that, plus the supplements arguing a bunch of good things for the mind and body, instead of having side effects and negatively affecting a persons health. Ginger is A really good supplement for joint pain, and a ton of other things, but I only get a 50 to 70% reduction in joint pain and it normally takes 5 to 7 days for the maximum effect.  I highly recommend this product just for general health benefits, but if you have any issues with joint pain, arthritis or respiratory allergies then you definitely want to try this. I'm sure works for a lot of other things as well. It definitely reduces inflammation in the body, which is why it works so well for me and those two issues, so supplement should reduce or possibly a lemonade hundreds of different Health issues.  Give it a try and if you notice it helping any other problems get better, please note it on here so other people can benefit from your experience.", "rating": "5"}, {"helpful": 2, "title": "A powerful nutraceutical", "body": "I purchased this brand of grape seed extract because NOW has a good reputation, but there are other companies I have used for this supplement who also have a good reputation, including Life Extension and Solgar.", "rating": "5"}, {"helpful": 4, "title": "helping my seizures", "body": "This is one of the ingredients I am using to replace nuskin vitality.  Since using this (along with the other main ingredients in nuskin vitality, my seizure disorder is almost controlled.  And at a fraction of the cost.", "rating": "5"}, {"helpful": 4, "title": "Good product but raised the price almost 25%, am now not satisfied", "body": "I bought this product about two months ago and liked it for its seemingly high quality and good formulation ingredients (grape seed ext, plus rutin & amla) but then I go to re-order it and found that Now the price by NOW has been raised almost 25% and it just does not seem right to order a product, use it and then the manufacturer, IMO, appears to raise the price very unreasonably. Note I regularly use other NOW products but now I  am looking for alternatives.", "rating": "2"}, {"helpful": 5, "title": "Some Surprising Benefits!", "body": "I purchased this product back in the fall of 2014 because I read in a book on natural medicine, that Grape Seed Extract was actually good for treating ADD.  Having been diagnosed as an adult in my 40's and on prescription medication for this -that was having some unpleasant side-effects- I weaned off the prescription and decided to try this product.  Because natural medicine takes longer, I knew to NOT expect overnight results.  In regards to the ADD, I noticed fairly quickly, that it worked about 70% as well as the prescription medicine -at a fraction of the cost- and that was good enough for me to continue.  However, after several months of taking it, I noticed that I was not catching any of the usual, winter, upper-respiratory infections.  What's significant about that, is that every winter, at least three times, I'll come down with something and need antibiotics, and even asthma medication and this is the first winter I have not had to deal with any of it.  I've come down with a couple of very mild colds that lasted only 3 days.  No bronchitis, no sinus infections, nothing else.  Because I've made no other changes, it can only be the Grape Seed Extract so it's a definite keeper for me.  No side effects that I'm aware of except not getting sick when everyone else is, and that's pretty great. Highly recommend!", "rating": "5"}, {"helpful": 1, "title": "NOW Foods Grape Seed Extract 250mg, 90 Vcaps", "body": "I ordered these for my mother per her request as they are part of her regular supplement regime. She loves them. I actually started taking them to improve my skin texture.", "rating": "5"}, {"helpful": 0, "title": "LOVE NOW Foods vitamin line", "body": "LOVE NOW Foods vitamin line!  Been taking these 1x/day for years and I believe that it helps keep me from getting sick.. Will continue to purchase.", "rating": "5"}, {"helpful": 3, "title": "One Star", "body": "Gave me heart palpitations....stopped after 2 doses", "rating": "1"}, {"helpful": 5, "title": "My friend is four years out from chemo therapy for ...", "body": "My friend is four years out from chemo therapy for stage four colon cancer. He did some research and found that grape seed extract does as well as some chemo treatments to keep the cancer from returning. I take a capsule a day as a preventative.", "rating": "5"}, {"helpful": 1, "title": "Four Stars", "body": "Definitely helps with blood flow.", "rating": "4"}, {"helpful": 1, "title": "Five Stars", "body": "Like this a lot!", "rating": "5"}, {"helpful": 7, "title": "Seems like some of the better gse on amazon", "body": "Seems like some of the better gse on amazon. I might purchase again but it's kind of expensive. I recently purchased some powder in bulk and I'm going to see if I like that better. I like NOW brand as a lower cost/decent quality option for my supplements. They're not always the best but they're rarely the worst.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Works!", "rating": "5"}, {"helpful": 1, "title": "Great for sinus trouble", "body": "Excellent for chronic sinus infection suffers. Take 2 to 4 per day to ward off infections.", "rating": "5"}, {"helpful": 2, "title": "Arrived fast, appear healthy so far . . .", "body": "Arrived promptly. Not sure if they are helping with ADHD, hard to tell. Taking them has not made me want to stop taking adderall, but I have cut down on dosage somewhat. Sex drive has always been high, so not sure if these are boosting it further, as some people say they do.", "rating": "5"}, {"helpful": 3, "title": "... bought these for my dog as they are a great holistic vitamin", "body": "I originally bought these for my dog as they are a great holistic vitamin, but they also lower cholesterol, so if you can't take statins I'd recommend this for yourself or a pet. My husband is now taking them.", "rating": "5"}, {"helpful": 2, "title": "USE WITH GRAPE HAWTHORN AND WATCH YOUR BP GO DOWN", "body": "I DID NOT GET THIS PRODUCT FREE OR AT A DISCOUNT IN RETURN FOR A REVIEW", "rating": "5"}, {"helpful": 7, "title": "Grape Seed Extract helps my detox cycle", "body": "I am in progress of a detox cycle, feeling some resistance in the body, and I bought this Grape Seed Extract to see whether it helps or not.  And the answer is YES !", "rating": "5"}, {"helpful": 1, "title": "Works great! Feel much healthier", "body": "Works great! Feel much healthier, vibrant, and ready to take on the world. It's packed with antioxidants. Sometimes I forget to eat healthy but supplements like these really help fill in the holes. 5 Stars.", "rating": "5"}, {"helpful": 1, "title": "Great Grape Seed Extract!", "body": "This is a great grape seed extract with the 2 added ingredients that aid in suger control.  The only minor complaint I would have is, it's just a little overpriced for what it is, but other than that it works great!", "rating": "5"}, {"helpful": 0, "title": "Not good for me", "body": "Grape seed extract does not work for me.  After several weeks of trying it, I had to give it up because it gave me an itchy scalp and significantly raised my blood pressure.  This is no reflection on the Now Foods product; I suspect any other brand would be just as bad for me.", "rating": "1"}, {"helpful": 3, "title": "Seems to do the trick.", "body": "I purchased this for my Mom who has had much trouble with arthritis in her thumbs and wrist. She said that after the first day she began to notice that her joints were moving more freely. It did not take away the pain completely but it did help.", "rating": "5"}, {"helpful": 2, "title": "Highly recommend", "body": "I like when I can take 200 mg without swallowing so many pills. Love it...", "rating": "5"}, {"helpful": 1, "title": "Three Stars", "body": "I don't know if it does anything.  It does have a tendency to raise blood sugar levels.", "rating": "3"}, {"helpful": 1, "title": "Good Stuff", "body": "I like it. It serves its purpose and NOW Foods always has good quality products.", "rating": "4"}, {"helpful": 6, "title": "Great supplement", "body": "I like taking these vitamin E and evening primrose oil. I see a difference in my skin and my friends and family do too. My skin is noticeably smoother and looks great without make up.", "rating": "5"}, {"helpful": 3, "title": "Five Stars", "body": "Works great and makes me sleep better!", "rating": "5"}, {"helpful": 2, "title": "Good stuff", "body": "This stuff has worked great on my stomach issues.", "rating": "5"}, {"helpful": 1, "title": "Really working for me.", "body": "This stuff works!  Definitely notice a difference in my seasonal allergies!  Better to take this than my Zyrtec daily.", "rating": "5"}, {"helpful": 6, "title": "My knees were so happy that I ordered this", "body": "My knees were so happy that I ordered this. I'd run out and they were really starting to hurt. Don't ask me why this works but it does.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "seems to have helped my skin/hair.", "rating": "5"}, {"helpful": 6, "title": "No More Bruises!", "body": "All my life, even a light bump would result in an unsightly bruise. Currently a medication I am taking has made matters even worse. I was literally ashamed to go out in public without my legs and arms covered. A friend who share my problem recommended this product and it has worked wonders.", "rating": "5"}, {"helpful": 2, "title": "after 1 month he now can breathe much better. I can't be any happier with the results", "body": "I put my 81 year old father on this and he has COPD...after 1 month he now can breathe much better. I can't be any happier with the results.", "rating": "5"}, {"helpful": 2, "title": "... natural along with several other vitamins and I am pleased with the results", "body": "I take theses to help regulate my blood pressure natural along with several other vitamins and I am pleased with the results.", "rating": "5"}, {"helpful": 1, "title": "I don't mind trying something but I hate to waste money", "body": "Don't think it was worth the money, doesn't seem to make any difference at all. I don't mind trying something but I hate to waste money.", "rating": "2"}, {"helpful": 2, "title": "Very good product, OK price", "body": "Very good product, like some other top brands. Just wish the price was bit less.", "rating": "4"}, {"helpful": 1, "title": "LOVE LOVE!", "body": "I was told to take these, by an herbalist for several things(health wise) and I feel really good. Price is also unbeatable.", "rating": "5"}, {"helpful": 1, "title": "NOW Foods Grape Seed Extract 250mg", "body": "Seems to be working good so far.  I hope this will lower my cholesterol.  This was recommended by a friend \"who swears by it.\"  Just in the little time I've used it, I can already see a difference!", "rating": "5"}, {"helpful": 0, "title": "Okay", "body": "No comment.", "rating": "3"}, {"helpful": 2, "title": "DIDN'T HELP MY BLOOD PRESSURE", "body": "IT IS  SUPPOSED TO  LOWER BLOOD PRESSURE . I  SAW NO DIFFERENCE IN BLOOD PRESSURE  AND I AM ON MY 3RD BOTTLE . I AM NOT GETTING ANYMORE.", "rating": "1"}, {"helpful": 4, "title": "Good product, BUT order full-filler (Amazon", "body": "Good product, BUT order full-filler (Amazon?) sticks a PERMANANT STICK label for their handling purposes RIGHT OVER the top of critical product info... ingredients, warnings, etc. Unsafe and could be dangerous to buyer that is not savy to this information! They should not be allowed to do this. It's standard practice (on products I've bought for over a year, EVERY supplement product they fulfill.", "rating": "3"}, {"helpful": 1, "title": "was a rust colored residue in the bottle that had ...", "body": "was a rust colored residue in the bottle that had not been there before. Had to throw the bottle away after 3 capsules because it bothered me that I didn't know what the residue was. Won't purchase again.", "rating": "2"}, {"helpful": 3, "title": "Amazing for hormones", "body": "I am male yet have slight gynecomastia with sever problems with painful breasts. My hormone profile does not point to an obvious cause but my sense is my breast tissue is either sensitive to prolactin or estrogen and my nipples get puffy when my breasts ache.  I used one of Now's products that hd grape seed extract and my breast pain stopped.  I was amazed because the supplement I was taking had nothing to do with hormones.  I researched the add on products and found gse can have anti estrogen effects.  I now take this with aspirin every morning as I found taking something acidic helps with absorption and my breast pain and engorgement has literally decreased by 90 percent to nonexistent while before it was either very painful or a dull ache.  Definitely one of the only supplements you truly feel the difference.", "rating": "5"}, {"helpful": 2, "title": "Grape Seed Extract", "body": "Excellent product, easy to take and digest.  Hard to see results in one month but I like the product and will buy again.", "rating": "5"}, {"helpful": 2, "title": "Possibly counterfeit", "body": "Concerned this is counterfeit.  The label looks like it was made on an ink jet printer.", "rating": "1"}, {"helpful": 5, "title": "One Star", "body": "I had an allergic reaction upon taking my first one of these. Ended up in the hospital.", "rating": "1"}, {"helpful": 0, "title": "Five Stars", "body": "Great Item will buy again if need to!", "rating": "5"}, {"helpful": 0, "title": "Great deal. Wife takes them for allergies", "body": "Great deal.  Wife takes them for allergies.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Very good quality.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great.", "rating": "5"}, {"helpful": 1, "title": "Works great! Feel much healthier", "body": "Works great! Feel much healthier, vibrant, and ready to take on the world. It's packed with antioxidants. Sometimes I forget to eat healthy but supplements like these really help fill in the holes. 5 Stars.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "GOOD PRODUCT.....", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 3, "title": "I didn't like that it had additional active ingredients", "body": "Grape seed extract really does help with my seasonal allergies, specifically the eye irritation during allergy season.", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "Very good", "rating": "5"}, {"helpful": 1, "title": "Can't live without my grape seed !", "body": "Grape seed has many benefits - inner and outer.  Besides lowering blood pressure - it is great for your skin too.  I love it.", "rating": "5"}, {"helpful": 1, "title": "True inflammation fighter", "body": "If you are looking for something to keep inflammation under control I found this to do the trick.  I used to take glucosamine and  condroitin supplements for my joint stiffness.  I used to use grape seed as a way to reduce free radicals in the body.  I was talking to a good friend in canada who knows much more about this than i so and was explaining that the two items i was using did not seem to  reduce the stiffness and aching in the evenings anymore.", "rating": "5"}, {"helpful": 1, "title": "Keep Feeling Better", "body": "Keeps me feeling better. I have been taking grape seed for several years and believe this is one reason my allergies stay in check. Good product.", "rating": "4"}, {"helpful": 1, "title": "I haven't seen any benefits at all.", "body": "I bought these because I read somewhere that grape seed can help with healing spider veins. I've used almost 2 bottles now, its been nearly 6 months with no changes in my veins, so that does not seem to be the case. I haven't noticed any other benefits, I've read other comments saying it improved their skin or helped their immune system but I didn't have those benefits either. I will finish out the bottle I have just because I already paid for it but wont buy again.", "rating": "1"}, {"helpful": 1, "title": "Good product at a great price.", "body": "I add this to my subscribe and save and get quite a discount from Amazon. This is a good value product, I take it for it's antioxidant and metabolic properties. I initially found it was helping me with season allergies, sinus and upper airway congestion. I would recommend Grape Seed extract for people suffering with allergies, but also as a daily supplement for cardiovascular health.", "rating": "5"}, {"helpful": 6, "title": "Good Grape seed supp", "body": "Seems to be a descent brand of GSE. The only brand of GSE iv'e tried to be honest. I take it for circulation and general health. Great combined with a good Arginine or Nitric oxide supplement. Recommended", "rating": "4"}, {"helpful": 3, "title": "useless, just cheat", "body": "useless,just cheat money", "rating": "1"}, {"helpful": 3, "title": "I didn't like that it had additional active ingredients", "body": "Grape seed extract really does help with my seasonal allergies, specifically the eye irritation during allergy season.", "rating": "3"}, {"helpful": 3, "title": "Vasodilation in a capsule!", "body": "Very effective! I often take these in combination with other vasodilators and blood thinners for the sake of exercise and recovery, and the effect is very noticeable. My veins seem to dilate more, and my voice seems to deepen as well. The increased blood volume is very handy for getting that little bit of extra exertion into a workout, and also means more blood flowing and flushing out ammonia and lactic acid. Great for recovery and aesthetics!", "rating": "5"}, {"helpful": 7, "title": "Works Great!", "body": "I have an illness that requires my blood vessels to be more flexible.  This product is a life saver.  I would recommend this product.", "rating": "4"}, {"helpful": 5, "title": "This product has many proven benefits. To name a ...", "body": "This product has many proven benefits. To name a few: antantioxidants, cardiovascular, cholesterol, eye disease related to diabetes. Also reduces swelling caused by injury. Here is a example of another benifit: If taking capsules of glucosamine chondroitin msm by also taking 1 capsule of grape seed extract, you greatly enhance the capsule of glucose mine chondroitin msm.", "rating": "5"}, {"helpful": 3, "title": "Works!", "body": "My son is easily bruised. Since soccer started he's been coming home with horrible bruises! I read that grape seed extract is supposed to help with bruising. Within a couple days his bruises went away... He takes it every other day or so to help.", "rating": "5"}, {"helpful": 6, "title": "Makes you feel great", "body": "Nothing wrong with them great for weight loss and overall better health I'd recommend this to anyone trying out new pills", "rating": "5"}, {"helpful": 1, "title": "Excellent product!", "body": "The product arrived on time and in good condition. I already started to feel the benefits. It works wonders for my eyes. I already feel so much better.", "rating": "5"}, {"helpful": 3, "title": "Effective Immune Booster .. I Open The Capsules", "body": "I really like the effect these have ... and can feel when I don't take them. I use them a bit differently than most would ... I open the capsules and add them to my Budwig Protocol mix of yogurt and oil (I use Barlean's Lemon flavored Cod Liver Oil instead of Flax), and then mix in a Greens Pak made by Trace Minerals (http://www.amazon.com/gp/product/B002DW93YC) so that the supplements are treated more like food and more bio available. The greens mask the astringent taste of the grape seeds nicely and I get a nice immune booster.", "rating": "5"}, {"helpful": 3, "title": "but I like pycnogenol better for allergies and joints", "body": "Works decently, but I like pycnogenol better for allergies and joints. This is al ot cheaper then pycnogenol though.", "rating": "3"}, {"helpful": 1, "title": "Five Stars", "body": "Great brand, I'm sensitive to vitamins and this one didn't make me sick", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Helps with my tennis elbow. Using it for several years now.", "rating": "5"}, {"helpful": 1, "title": "Seems to work", "body": "Hard to give an honest review when you take multiple supplements.  This seems to help with my allergies though and is a powerful antioxidant.  May or may not work as an aromatase inhibitor.  The jury is still out.", "rating": "5"}, {"helpful": 3, "title": "Grape seed extract capsules", "body": "The capsule form of grape seed is always a challenge finding. I have been satisfied with the NOW brand in all of the products that I have purchased from them. Rating these supplements are not easy as the effects are often subtle.", "rating": "5"}, {"helpful": 6, "title": "I truly love this vitamins !!", "body": "I had an urinary issue for long time and now I am cured, that must tell you something about this great vitamins.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Love NOW foods vitamins. :)", "rating": "5"}, {"helpful": 4, "title": "grape seed", "body": "I'm not sure of how any of these supplements are helping - I do know I feel a lot better than before I took them,", "rating": "4"}, {"helpful": 2, "title": "Happy with effects", "body": "I feel more energized and clear-headed when taking this product. I plan to keep this in my supplement regimen.", "rating": "5"}, {"helpful": 0, "title": "Did something change?", "body": "Item shipped and received as promised, can't say that I'm seeing the results I've seen in the past with this brand.", "rating": "4"}, {"helpful": 0, "title": "It works reduces inflammation on us- not sore after workouts or sitting a long time at our PC's", "body": "It works reduces inflammation on us- not sore after workouts or sitting a long time at our PC's", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "I have stomach issues - Dr. advised Grape Seed es-tract - unfortunately has not yet helped.", "rating": "3"}, {"helpful": 2, "title": "Five Stars", "body": "Really works great my Doctor has me take it for blood flow", "rating": "5"}, {"helpful": 7, "title": "Hard erections taking these. Not bothersome just harder ones ...", "body": "Hard erections taking these. Not bothersome just harder ones when I did get erections. Bought it for the anti oxidant properties.", "rating": "4"}, {"helpful": 0, "title": "Good.", "body": "Tastes exactly like extracted grape seeds! In all seriousness, Good quality product.", "rating": "5"}, {"helpful": 0, "title": "Very good anti-oxidant - has also similar benefits like resveratrol.", "body": "I will purchase the product again because the grape seed extract is a very good source for anti-oxidants.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product! Recommend if it is what u r looking for!", "rating": "5"}, {"helpful": 2, "title": "... natural along with several other vitamins and I am pleased with the results", "body": "I take theses to help regulate my blood pressure natural along with several other vitamins and I am pleased with the results.", "rating": "5"}, {"helpful": 6, "title": "No More Bruises!", "body": "All my life, even a light bump would result in an unsightly bruise. Currently a medication I am taking has made matters even worse. I was literally ashamed to go out in public without my legs and arms covered. A friend who share my problem recommended this product and it has worked wonders.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good daily supplement.", "rating": "5"}, {"helpful": 0, "title": "amazing", "body": "works perfectly fine", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "one of the trio I use for better vision.", "rating": "5"}, {"helpful": 0, "title": "Very good benefits", "body": "Great product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "worked great.", "rating": "5"}, {"helpful": 0, "title": "Super!", "body": "Great quality at a low price!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Super potent! Seems high quality.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Delivered as advertised.", "rating": "4"}, {"helpful": 1, "title": "This is a very good supplement. My friend and I are both taking ...", "body": "This is a very good supplement.  My friend and I are both taking it. NOW is a very good company.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Exactly as expected", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Very good quality.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "GOOD PRODUCT.....", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Awesome product!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great product", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Good product", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "good product", "rating": "5"}, {"helpful": 0, "title": "Great!", "body": "Works well!", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "It works!", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Very good", "rating": "5"}, {"helpful": 4, "title": "Three Stars", "body": "honestly what are we suppose to feel from this item", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "good@@", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Helps for my allergies.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Great", "rating": "4"}, {"helpful": 2, "title": "Four Stars", "body": "using this for assist in b sugar control,......seems to be helpful so far", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Could NOT feel the benefits! Went with the oil!!", "body": "Did absolutely nothing for me.", "rating": "2"}, {"helpful": 2, "title": "Five Stars", "body": "This promotes cardiovascular and immune health.", "rating": "5"}, {"helpful": 2, "title": "Hard to find item", "body": "I was looking for Grape Seed extract and all I could find was GrapeFRUIT seed. It was hard to find. Glad to have found it here. I think NOW has pretty good quality vitamins. All vitamins are not created equal and I believe you mostly get what you pay for.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Good for me", "rating": "5"}, {"helpful": 0, "title": "Very good anti-oxidant - has also similar benefits like resveratrol.", "body": "I will purchase the product again because the grape seed extract is a very good source for anti-oxidants.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "GREAT !!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product! Recommend if it is what u r looking for!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "one of the trio I use for better vision.", "rating": "5"}, {"helpful": 1, "title": "Great product!", "body": "Great product and great service! Grape seed is so beneficial for you and this is a great brand. Help yourself.", "rating": "5"}, {"helpful": 1, "title": "Been taking it for about 2 months need to have ...", "body": "Been taking it for about 2 months need to have blood work taken to see if it works.That will be done in Dec.", "rating": "4"}, {"helpful": 0, "title": "Super!", "body": "Great quality at a low price!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good daily supplement.", "rating": "5"}, {"helpful": 0, "title": "amazing", "body": "works perfectly fine", "rating": "5"}, {"helpful": 0, "title": "Very good benefits", "body": "Great product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "worked great.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good value", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "excellent", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "all good!", "rating": "5"}, {"helpful": 1, "title": "One Star", "body": "Did not do a thing for me", "rating": "1"}, {"helpful": 1, "title": "Four Stars", "body": "they do what I expected.", "rating": "4"}, {"helpful": 3, "title": "Has amla in it as well. Amla is a ...", "body": "Has amla in it as well.  Amla is a fruit with high vitamin c but it upsets my digestive system .  I wanted JUST grape seed extract as the label describes.  It's a bit misleading", "rating": "2"}, {"helpful": 0, "title": "Five Stars", "body": "Good!!", "rating": "5"}, {"helpful": 0, "title": "Great speed for Grape Seed (extract)!", "body": "It was quick and easy to order this item on Amazon. I found a similar item at Costco and will be doing some comparing before I order again because I think it's a bit less there.", "rating": "5"}, {"helpful": 1, "title": "Four Stars", "body": "As promised.", "rating": "4"}, {"helpful": 1, "title": "Five Stars", "body": "All good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product, great price, great shipping from a great dealer.  Thank you.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good, i knew it in China. But it's hard and expensive to buy it in China.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "liked this too much bought 3 so far!!!!", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "The product is great. I haven't had a problem with it.", "rating": "4"}, {"helpful": 1, "title": "Five Stars", "body": "Great Product!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "A MUST HAVE!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "As described love the fast shipping", "rating": "5"}, {"helpful": 2, "title": "DIDN'T HELP MY BLOOD PRESSURE", "body": "IT IS  SUPPOSED TO  LOWER BLOOD PRESSURE . I  SAW NO DIFFERENCE IN BLOOD PRESSURE  AND I AM ON MY 3RD BOTTLE . I AM NOT GETTING ANYMORE.", "rating": "1"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "OK.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "I like it", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Good one.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "me likey", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Great Product!", "rating": "5"}, {"helpful": 0, "title": "good", "body": "This stuff is pretty good， I like，I will continue to focus on the future，", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "The product is great. I haven't had a problem with it.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "liked this too much bought 3 so far!!!!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "As described love the fast shipping", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "good product, easy to swallow", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "good product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "A MUST HAVE!", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Bought for friends", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "OK.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Ok", "rating": "4"}, {"helpful": 0, "title": "use of grapeseed extract", "body": "not sure what, if anything it does.", "rating": "3"}, {"helpful": 0, "title": "Three Stars", "body": "Wish it was USP approfed", "rating": "3"}, {"helpful": 2, "title": "Three Stars", "body": "No big deal - I'd return but I'm too lazy.", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "Good for me", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Thanks!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "like it", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good！", "rating": "5"}, {"helpful": 0, "title": "good", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Don't feel a thing", "body": "Don't know what it does to my body. Don't feel a thing.", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "I do not know with GNC products better than what some", "rating": "5"}, {"helpful": 0, "title": "I have been taking this supplement for 10 days.", "body": "A friend recommended this supplement highly after I had a horrific bout with a virus twice in a 6 month period. I have been taking this supplement only 2 weeks, too soon to know whether it  is working for me.", "rating": "4"}, {"helpful": 0, "title": "Maybe it's for you", "body": "Eh, I don't know...", "rating": "3"}, {"helpful": 1, "title": "No Difference", "body": "Purchased this product because I read it was supposed to be good for me.  Have not noticed any difference since taking these.", "rating": "2"}, {"helpful": 0, "title": "Three Stars", "body": "It's ok", "rating": "3"}, {"helpful": 0, "title": "Good Value, But I Cut It Out", "body": "My trainer recommended this to me and I don't have any complaints with the product I received being of low quality.  But the fact is the benefits can't really be measured.  I cut my routine down to a calcium supplement, Iron Cap and multi-vitamin.  I don't see the need for more than that.", "rating": "4"}, {"helpful": 1, "title": "I have no idea because I didn't taste in real, just a gift", "body": "I bought for my mum, but still think the price is not the cheapest one with such little capacity, a little bottle, smaller than I expected", "rating": "4"}, {"helpful": 4, "title": "GOOD GOOD GOOD GOOD GOOD", "body": "DSGOOD GOOD GOOD GOOD GOOD DS GOOD GOOD GOOD GOOD GOOD CSGOOD GOOD GOOD GOOD GOOD CDSGOOD GOOD GOOD GOOD GO OD", "rating": "5"}, {"helpful": 1, "title": "Unexpected results", "body": "I have just started my second bottle of this product and I Love It! I read that it was supposed to be good for hair regrowth so, I decided to try it. I am taking it along with a hyaluronic acid pill each day. I have not noticed any real change in my hair but here is the biggest change that I did not expect at all. I have suffered from severe swelling in my ankles and feet for several months. Everything I tried could not get the fluid off. I got a clean bill of health from my dr and he could not figure it out either. I started taking both of these pills together and within a week I was noticing a change in my feet and ankles. Another two weeks and they were completely normal! I have been taking this product for over two months now and my ankles and feet have not swollen since. I cannot tell you if it is the grape seed or the hyaluronic acid or the combination of the two. All I know, is that it is working for me! I recommend that you ask your dr about it. I also checked with my pharmacist and he told me that neither one of these pills would interfere with any medication I was taking. So, in my opinion, it's definitely worth a try.", "rating": "5"}, {"helpful": 1, "title": "Cholesterol result lower than its ever been.", "body": "I have taken grape seed extract before. I take it because it helps with my high cholesterol. I ran out and bought this brand at 500mg.  I had my physical after my first full bottle and for the first time my cholesterol was UNDER 200 and my good cholesterol was off the charts and the bad was lower than ever before. I immediately bought three more. My husband cannot take statins so now I have him started and we will both continue with this brand and dosage", "rating": "5"}, {"helpful": 6, "title": "Good Supplement", "body": "I'm taking this as a supplement with DHEA and I have seen good results.  I like how that this product has the highest concentration of active ingredients compared to other grapeseed extracts and is the reason I chose this.  I'm not taking this to lower my BP or treat any condition but I think its pretty well known that grapeseed extract is good for you and has many benefits.  I think this going to be my go to source for this supplement, and they shipped quickly.", "rating": "5"}, {"helpful": 5, "title": "This product does what grapeseed extract is supposed to do, and does it better than others.", "body": "Excellent product.  I don't want to post medical affects in case someone else would try it and have different results, but it did what the various experts say grapeseed extract does and did it better than the major brand I purchased previously.  I will be on this for life now.", "rating": "5"}, {"helpful": 6, "title": "Great for Pancreatitis", "body": "I take this daily and I really do feel that it helps my chronic pancreatitis. A highly powerful antioxidant is one of the most important parts of my diet and this one shows a huge chance of helping...I discovered it during my own research on how best to help keep my condition under control.", "rating": "5"}, {"helpful": 8, "title": "Great product and a great company", "body": "Great product and a great company.  I started using this a few months back after reading about the good effects folks had experienced by using it.  I can't say for sure, but I do think that this is the reason for my much improved eye sight.  I had what are called \"floaters\" and they were getting worse and worse with time.  So bad in fact that I was concerned about my upcoming driver's license renewal.  Additionally, I have a good friend who's eyes were messed up badly by the treatment to fix this problem, and after reading up on it I decided I did not want to take that chance.  Anyway, they are gone now!  And the only thing I have done different in my life is take this supplement.  One last point, the company has been very cordial and friendly sending a note with each new bottle I buy.  It is probably a form letter, but still it is nice that they take that much time to say thanks.", "rating": "5"}, {"helpful": 2, "title": "So Far So Good", "body": "So far so good.  I haven't really been using this long enough to make a truly informed review however, since I've been asked multiple times to do so I am.  The product seems to be high quality and I've had no adverse reactions.  I'm not much of a wine drinker and, while I love Welch's grape juice, it has lots of calories.  This seemed like a good alternative to get the benefits of grapes.", "rating": "5"}, {"helpful": 4, "title": "Happy", "body": "Good quality.  I bought to improve my skin and hair.  Good results so far.", "rating": "5"}, {"helpful": 2, "title": "Allergy symptoms drastically reduced", "body": "I have been using this for a few months now and notice a big difference in allergy symptoms. Usually this time of year is my worst for itching, sneezing, congestion, etc., but I have hardly any of that this fall season. Thanks, BRI!", "rating": "5"}, {"helpful": 3, "title": "Great Product", "body": "Great stuff. Great price. Replacing my pycnogenol effectively for much less money.", "rating": "5"}, {"helpful": 2, "title": "Three Stars", "body": "Didn't produce the results I expected based on recommendations that were posted", "rating": "3"}, {"helpful": 2, "title": "Four Stars", "body": "A big improvement in blood flow!", "rating": "4"}, {"helpful": 0, "title": "Happy as can be with this stuff", "body": "I have a chronic skin problem - photosensitivity - this helps my skin to be less sensitive to the sun if I take it everyday. Can't swear by it, but, my allergic reaction to sunlight seems to be slowly but surely diminishing since I've been using it. Product was delivered on time and the price was right.", "rating": "5"}, {"helpful": 1, "title": "BRI Nutrition Grapeseed Extract", "body": "4 times Higher strength than found in pharmacy, making less needed daily", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "In my case, has been effective at helping to reduce blood pressure", "rating": "5"}, {"helpful": 0, "title": "Excellent product at a fair price!", "body": "I struggle with high blood pressure.  I have combined a regimen of healthy dieting, cardio exercise and supplements. BRI always has high quality products at a fair price. The grape seed is just what I needed!", "rating": "5"}, {"helpful": 0, "title": "Excellent product.", "body": "Excellent product...it is an estrogen blocker which is very good today because we get so much estrogen from water and plastic especially bottled water.  Estrogen is a factor in breast cancer...", "rating": "5"}, {"helpful": 1, "title": "It seemed like the best Grape Seed Extract product for me to ...", "body": "It seemed like the best Grape Seed Extract product for me to begin taking;  I've never taken it before, but read that grape seed extract could possibly help me fight a certain cancer that I was diagnosed with.  I received the BRI Grape Seed Extract and showed it to my naturopathic doctor, he approved, so I now have added two pills per day to my protocol, one in the morning and another in the evening.", "rating": "5"}, {"helpful": 2, "title": "Great product!", "body": "After taking a couple days..energy level  is improved, blood pressure lowered, as well as glucose level improving. Great product!", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "So far so good. I have not been taking them long enough to really judge efficacy.", "rating": "4"}, {"helpful": 0, "title": "Good support", "body": "Received product within 2 days of ordering , seems to be great customer support from the company BRI Nutrition , will definitely order from other products from BRI Nutrition", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Somewhat surprised at the size of the capsule as other brands have smaller capsules.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "So far so good. I have not been taking them long enough to really judge efficacy.", "rating": "4"}, {"helpful": 0, "title": "Good Product", "body": "I am now on my 2nd bottle of Grape Seed Extract. Results from annual check up were better than expected. It is possible this supplement helped. I will continue taking it.", "rating": "5"}, {"helpful": 0, "title": "Love the BRI Nutrition Grape Sed Extract but needed help with delivery", "body": "I Love the Grape Seed  Extract but I  have built up", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Excellent product .. I feel like ut is helping with my brain fog and focus.", "rating": "5"}, {"helpful": 0, "title": "Great quality.", "body": "Great quality product, best ive tried so will def be buying again!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good Product, would recommend", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Growing Grapes Has Never Been Easier! Helps With Eye Twitch...", "rating": "5"}, {"helpful": 0, "title": "Good product", "body": "Satisfied repeat customer.", "rating": "5"}, {"helpful": 0, "title": "Excellent Great to have high mg ----> just hve to ...", "body": "Excellent  Great to have  high mg  ----> just  hve to take one  daily  Thanks /  Mjb", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Quality product for a quality price.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I like it", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I love it", "rating": "5"}, {"helpful": 2, "title": "great product", "body": "Capsules are easy to swallow.  Helps promote a healthy immune system and I haven't been sick since I began taking it.  Must work.", "rating": "5"}, {"helpful": 3, "title": "Good Supplement", "body": "More energy! Skin is smoother. Everyone says I am glowing! Losing weight too!!", "rating": "5"}, {"helpful": 3, "title": "Good product!  Wish label was better organized!", "body": "Simply stated, this product had what I was looking for in a grape seed extract.  At first glance compared to some of the others, it appears lacking, but read the label! The capsule is easy to take!  Note...capsules and liquigels are my preferred format over tablets where possible!", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "like it", "rating": "5"}, {"helpful": 1, "title": "Awesome product!", "body": "Fantastic product, great service!", "rating": "5"}, {"helpful": 0, "title": "Two Stars", "body": "Didn't do anything.", "rating": "2"}, {"helpful": 0, "title": "Three Stars", "body": "I haven't been taking these long enough to give a fair rating. Too soon", "rating": "3"}, {"helpful": 1, "title": "Amazing Immunity", "body": "I catch cold & cough easily and wanted to develop immunity, so I normally take Honey. Taking honey and to see results normally takes long time to develop immunity. And so started taking these immunity tablets one a day which also has antioxidants and good for heart. This company proudly says that these tablets contains highest percentage of Proanthocyanidins than other competitors which is one of the good reason to start with. I do not see any immediate difference but at the same i do not have any adverse effects after taking these tablets.", "rating": "5"}, {"helpful": 0, "title": "Two Stars", "body": "Okay with purchase but I will not buy this product again", "rating": "2"}, {"helpful": 1, "title": "Two thumbs up!", "body": "I bought this product for my mother who has a condition that conventional medicine didn't help. She is actually tolerating the product, and I've noticed she has more energy, and I take this as a very good sign. I'm giving this product two thumbs up! Thank you!", "rating": "5"}, {"helpful": 4, "title": "This dosage is super high, which was recommended to me by a ...", "body": "I'm new to taking Grapeseed Extract. This dosage is super high, which was recommended to me by a Dr for the conditions that I have. This dosage would be too high for most people, so make sure you know what you are getting. That being said, I'm happy with it. You never really know what good it's doing, but it doesn't upset my stomach so that's good!", "rating": "5"}, {"helpful": 7, "title": "Have been in horrible pain, bloating", "body": "Do you have diverticulitis? Don't take this. I did and soon discovered I have this condition. Have been in horrible pain, bloating, had to see dr, put on antibiotics, had to have xrays to look for blockage.... need I say more? Haven't touched it since the first week and am still in delicate health and pain.", "rating": "2"}, {"helpful": 1, "title": "Waste of Money.", "body": "Waste of Money.", "rating": "1"}, {"helpful": 2, "title": "So far so good. I haven't notice anything major", "body": "So far so good. I haven't notice anything major, but I'm sure I won't. Its good knowing I have the best antioxidant out there though.", "rating": "4"}, {"helpful": 2, "title": "Grape Seed", "body": "I received this the grape seed extract promptly and am using it as a natural product for my blood pressure.", "rating": "5"}, {"helpful": 2, "title": "Fantastic Supplement", "body": "Great quality & value! Great made in the USA company!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good product", "rating": "5"}, {"helpful": 0, "title": "great", "body": "just what i was looking for...great price", "rating": "5"}, {"helpful": 0, "title": "Good antioxidant", "body": "Good antioxidant and east to swallow", "rating": "5"}, {"helpful": 0, "title": "Great", "body": "The best!", "rating": "5"}, {"helpful": 3, "title": "Good Supplement", "body": "More energy! Skin is smoother. Everyone says I am glowing! Losing weight too!!", "rating": "5"}, {"helpful": 2, "title": "great product", "body": "Capsules are easy to swallow.  Helps promote a healthy immune system and I haven't been sick since I began taking it.  Must work.", "rating": "5"}, {"helpful": 2, "title": "One Star", "body": "about 2 hours after I took this I started feeling dizziness, nausea and then finally vomiting (at work).", "rating": "1"}, {"helpful": 1, "title": "Five Stars", "body": "like it", "rating": "5"}, {"helpful": 1, "title": "Awesome product!", "body": "Fantastic product, great service!", "rating": "5"}, {"helpful": 0, "title": "Two Stars", "body": "Didn't do anything.", "rating": "2"}, {"helpful": 3, "title": "Good product!  Wish label was better organized!", "body": "Simply stated, this product had what I was looking for in a grape seed extract.  At first glance compared to some of the others, it appears lacking, but read the label! The capsule is easy to take!  Note...capsules and liquigels are my preferred format over tablets where possible!", "rating": "5"}, {"helpful": 1, "title": "So Far So Good!!!", "body": "I'm loving the product!!! Makes me feel and look like a new person. Take supplement regularly and properly,you will see and feel thr results. I'm back to running again.", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "I haven't been taking these long enough to give a fair rating. Too soon", "rating": "3"}, {"helpful": 1, "title": "Five Stars", "body": "This has been an amazing help to my husband who has UC.", "rating": "5"}, {"helpful": 0, "title": "Two Stars", "body": "Okay with purchase but I will not buy this product again", "rating": "2"}, {"helpful": 0, "title": "Haven't seen a big difference but believe you have to ...", "body": "Haven't seen a big difference but believe you have to take any new supplement for a few months before you see a huge difference so I will continue to take these.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "This is a most effective supplement ever.  Have much more energy and my have feels healthy.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product and in general anything from BRI Nutrition is good", "rating": "5"}, {"helpful": 0, "title": "Good stuff!", "body": "Great stuff and part of my daily supplement routine.", "rating": "5"}, {"helpful": 0, "title": "Easy to take- great addition to my daily", "body": "Easy to take-  great addition to my daily routine", "rating": "5"}, {"helpful": 0, "title": "Great", "body": "The best!", "rating": "5"}, {"helpful": 0, "title": "Haven't seen a big difference but believe you have to ...", "body": "Haven't seen a big difference but believe you have to take any new supplement for a few months before you see a huge difference so I will continue to take these.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "This is a most effective supplement ever.  Have much more energy and my have feels healthy.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product and in general anything from BRI Nutrition is good", "rating": "5"}, {"helpful": 0, "title": "Good stuff!", "body": "Great stuff and part of my daily supplement routine.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great price and product.  Will continue to Re order.", "rating": "5"}, {"helpful": 0, "title": "SATISFIED WITH SHIPMENT, SEEMS TO BE AS ADVERTISED.", "body": "SATISFIED WITH SHIPMENT, SEEMS TO BE AS ADVERTISED.", "rating": "4"}, {"helpful": 0, "title": "Easy to take- great addition to my daily", "body": "Easy to take-  great addition to my daily routine", "rating": "5"}, {"helpful": 0, "title": "BRI rocks!!!", "body": "Good product however it is cheaper to medicate.", "rating": "4"}, {"helpful": 0, "title": "So far I have no complaints", "body": "So far I have no complaints", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "GOOD", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Thanx again", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Happy", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Thanks!", "rating": "5"}, {"helpful": 3, "title": "didn't do anything for me", "body": "unfortunately this product did nothing to help lower my blood pressure.", "rating": "1"}, {"helpful": 1, "title": "Two thumbs up!", "body": "I bought this product for my mother who has a condition that conventional medicine didn't help. She is actually tolerating the product, and I've noticed she has more energy, and I take this as a very good sign. I'm giving this product two thumbs up! Thank you!", "rating": "5"}, {"helpful": 4, "title": "This dosage is super high, which was recommended to me by a ...", "body": "I'm new to taking Grapeseed Extract. This dosage is super high, which was recommended to me by a Dr for the conditions that I have. This dosage would be too high for most people, so make sure you know what you are getting. That being said, I'm happy with it. You never really know what good it's doing, but it doesn't upset my stomach so that's good!", "rating": "5"}, {"helpful": 1, "title": "Waste of Money.", "body": "Waste of Money.", "rating": "1"}, {"helpful": 1, "title": "Amazing Immunity", "body": "I catch cold & cough easily and wanted to develop immunity, so I normally take Honey. Taking honey and to see results normally takes long time to develop immunity. And so started taking these immunity tablets one a day which also has antioxidants and good for heart. This company proudly says that these tablets contains highest percentage of Proanthocyanidins than other competitors which is one of the good reason to start with. I do not see any immediate difference but at the same i do not have any adverse effects after taking these tablets.", "rating": "5"}, {"helpful": 7, "title": "Have been in horrible pain, bloating", "body": "Do you have diverticulitis? Don't take this. I did and soon discovered I have this condition. Have been in horrible pain, bloating, had to see dr, put on antibiotics, had to have xrays to look for blockage.... need I say more? Haven't touched it since the first week and am still in delicate health and pain.", "rating": "2"}, {"helpful": 1, "title": "Five Stars", "body": "Good product for lowering blood pressure!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good quality - I would say \"purchase again.\"  In fact, I've reordered it several times.", "rating": "5"}, {"helpful": 0, "title": "Great product", "body": "Thrilled with my product, high quality, fast delivery, will continue to order from this company!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product.", "rating": "5"}, {"helpful": 1, "title": "CURE FOR HEMORROIDS", "body": "my boyfriend has had problems with hemorrhoids for a couple of years and without going into detail the situation became very dire in the last 9 months, to the point where he would have to go to the bathroom just to get the blood out. It controlled his life and affected his employment and taking care of our kids.  I bought this for myself, then saw something about how it helped hemorrhoids so I made him start taking it 2 weeks ago. I couldn't believe my ears when he told me that this completely CURED his hemorrhoids, not just eased the symptoms, but CURED them - and his roids were worst case scenario. He takes two a day and for the first time in years is back to knowing what 'normal' is like. Holy cow I was FLOORED when he told me this and I'm still in shock-  I never thought they would go away and that he'd be pain free, I still can't get the smile off of my face. What a lifesaver.", "rating": "5"}, {"helpful": 1, "title": "Works great for dry eyes", "body": "I bought this to support the health of the vessels of my eyes, but to my surprise it also eliminated my dry eyes!  I stopped taking it for about a week and realized the dryness returned.  Won't be without.", "rating": "5"}, {"helpful": 1, "title": "Had my doubts...", "body": "My left leg has varicose veins. They cause my leg to ache!!! I have had surgery on them before twice! They keep coming back in different places. It's time to have it done again I think.", "rating": "5"}, {"helpful": 7, "title": "Grapeseed", "body": "A good source of antioxidant drug. Works well for rheumatoid arthritis taken daily in the morning with food. Works all day", "rating": "5"}, {"helpful": 8, "title": "Grape seed extract may offer hope in preventing breast cancer, Alzheimer's, heart disease, other illnesses.", "body": "So promising is grape seed extract as a aromatase inhibitor that the Mayo Clinic is testing it for proper dosage.", "rating": "5"}, {"helpful": 8, "title": "Not a bad product", "body": "All in all its a good product however, being only 100 mg & 60 ct.", "rating": "4"}, {"helpful": 1, "title": "Grape Seed Extract's a Powerful Supplement:  Cardiovascular, Eye Health, Concentration Enhancer", "body": "Grape Seed Extract (NOT to be confused with GRAPEFRUIT Seed Extract) is a potent natural antioxidant that studies show has powerful positive effects on cardiovascular health, eye health, and may have some positive effects on cognition.  I've had a very mild case of attention deficit disorder all my life (which briefly means, I'm a GREAT daydreamer), but I find grape seed extract helps me concentrate during \"tough\" projects; I really like its \"focusing\" effect.", "rating": "5"}, {"helpful": 5, "title": "Excellent product for Vitamin-C abosorption and potential help with managing blood sugar for Type-2 diabetes", "body": "Excellent product! Been using it for many months. Started using it initially to manage my epistaxis (posterior nosebleeds of the kiesselbach plexus) to help absorb my daily intake of 1000mg Vitamin C. Doing some research, I found out that this product has Oligomeric Proanthacyanadins (OPC's) which in addition to helping with Vitamin-C absorption, is also helping to lower blood sugar which is helping with managing my Type-2 diabetes. Highly recommend it!", "rating": "5"}, {"helpful": 1, "title": "We love all the Nature's Way products that we've tried.", "body": "My husband had been taking the New Chapter Blood Pressure Take Care with great success (systolic BP down 15-20 points, and diastolic BP down 20-30 points), but then the New Chapter supplement was suddenly out of stock everywhere so we switched him to the Grapeseed Extract since that was the main ingredient in the Blood Pressure Take Care in the meantime.  So far so good.  His BP has stayed down since the switch so maybe we don't really need the more expensive supplement.", "rating": "5"}, {"helpful": 0, "title": "Did not work for me!", "body": "Unable to take due to side effects.", "rating": "3"}, {"helpful": 1, "title": "LARGE PILLS", "body": "Have been taking them almost daily.  Didn't see any improvement in my health yet.  Large tablets similar to other pills from China.  Look like chopped up leaves inside the tablet.", "rating": "3"}, {"helpful": 2, "title": "Great for toning the skin along with Dandelion Root", "body": "I've been using this product for years and attribute it to wrinkle-free skin (along with good genes).  I'm almost 70 years old have been using grapeseed extract for about 10 years.  People tell me that grape seed has nothing to do with it but I'm convinced it certainly helps.  No crows feet or wrinkles.", "rating": "5"}, {"helpful": 2, "title": "It's okay", "body": "I didn't see the results that I expected.  I did not see any change in my varicose veins and it seems to affect me in a negative way.", "rating": "3"}, {"helpful": 0, "title": "Four Stars", "body": "keep eating", "rating": "4"}, {"helpful": 1, "title": "we bought 6 bottles of this product on Jan. ...", "body": "we bought 6 bottles of this product on Jan. 5, 2015 and sent them to my friend. After receiving them, my friend told me that the color of these are sort of different with what she have bought at the last times. Could you please make sure that the products are completely under control and have no problems to have for health? Thank you so much. You can see the color difference from the attached photo.", "rating": "3"}, {"helpful": 2, "title": "good product to help skin health", "body": "excellent product in that due to corticosteroids (ASTHMA) I inhale, this works on the capillary walls and the bruising and thin skin has improved by at least 76%.  before this was suggested, I had quite a bit of trouble", "rating": "5"}, {"helpful": 1, "title": "Nature's Way Grapeseed Extract", "body": "I love this product. I have read about many health benefits of grapeseed extract and I feel it delivers just what you read about. I have found out that it is best to buy products listed as 'standardized' when considering your purchase and this product is just that.", "rating": "5"}, {"helpful": 6, "title": "A quality product", "body": "I like that Nature's way manufactures their vitamins in the USA with quality ingredients.  I this as a complement to Co-Q-10.", "rating": "5"}, {"helpful": 3, "title": "Better than Puritan's Pride at least", "body": "I used to buy this from Puritan's Pride and I don't like their formulation (comes with a strange smell and got stuck on my esophagus a lot...no matter how much water i drink with it). this one is much better. The capsule is better formulated, not bad taste or smell. And I think it works. My period cycle is usually prolonged while I take it.", "rating": "4"}, {"helpful": 3, "title": "Grape Seed Extract", "body": "amazon.com has the best price on all items that I have purchased. The Natures Way Grape Seed is great for your eyes and to strenghten all veins. I have found that when I have had", "rating": "5"}, {"helpful": 1, "title": "LARGE PILLS", "body": "Have been taking them almost daily.  Didn't see any improvement in my health yet.  Large tablets similar to other pills from China.  Look like chopped up leaves inside the tablet.", "rating": "3"}, {"helpful": 3, "title": "Grape Seed Extract", "body": "amazon.com has the best price on all items that I have purchased. The Natures Way Grape Seed is great for your eyes and to strenghten all veins. I have found that when I have had", "rating": "5"}, {"helpful": 3, "title": "Better than Puritan's Pride at least", "body": "I used to buy this from Puritan's Pride and I don't like their formulation (comes with a strange smell and got stuck on my esophagus a lot...no matter how much water i drink with it). this one is much better. The capsule is better formulated, not bad taste or smell. And I think it works. My period cycle is usually prolonged while I take it.", "rating": "4"}, {"helpful": 1, "title": "We love all the Nature's Way products that we've tried.", "body": "My husband had been taking the New Chapter Blood Pressure Take Care with great success (systolic BP down 15-20 points, and diastolic BP down 20-30 points), but then the New Chapter supplement was suddenly out of stock everywhere so we switched him to the Grapeseed Extract since that was the main ingredient in the Blood Pressure Take Care in the meantime.  So far so good.  His BP has stayed down since the switch so maybe we don't really need the more expensive supplement.", "rating": "5"}, {"helpful": 1, "title": "Nature's Way Grapeseed Extract", "body": "I love this product. I have read about many health benefits of grapeseed extract and I feel it delivers just what you read about. I have found out that it is best to buy products listed as 'standardized' when considering your purchase and this product is just that.", "rating": "5"}, {"helpful": 0, "title": "It is described just like it is shown in the website and the shipping ...", "body": "It is described just like it is shown in the website and the shipping is so fast! I love them!", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "great", "rating": "5"}, {"helpful": 2, "title": "It's okay", "body": "I didn't see the results that I expected.  I did not see any change in my varicose veins and it seems to affect me in a negative way.", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "Best of the nature itself. This product is awesome. Thanks.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Fantastic product, Highly Recommend!!", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "great", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "GREAT PRODUCT AND PRICE, THIS IS MY BRAND CHOICE", "rating": "5"}, {"helpful": 0, "title": "Nature's Way Grape Seed", "body": "great price on amazon! will be re-ordering", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Fantastic product, Highly Recommend!!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "excellent item. highly recommend.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great supplement at a good price", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Love all Nature's way products!", "rating": "5"}, {"helpful": 1, "title": "What would become of the Emperor after the war?", "body": "Good story line with some romance, the devastation in Japan was massive, and General MacAthur needed to make a decision on what to do with the Emperor about his involvement in the war and whether he needed to be charged with war crimes. Those close to the Emperor would hold the key to his fate.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "arrived in tact and on time", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Exactly as advertised.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Exactly as advertised.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Love this!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "GREAT!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "very good", "rating": "5"}, {"helpful": 0, "title": "Effective", "body": "Effective.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "ANTIOXUDANT HELP", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Very good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "mom loved it", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Thanks", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "grape seed extract.", "body": "Seems to be quality. fill is consistent from capsule to capsule.  Don't know yet about efficacy. Will update as necessary.", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "keep eating", "rating": "4"}, {"helpful": 1, "title": "What would become of the Emperor after the war?", "body": "Good story line with some romance, the devastation in Japan was massive, and General MacAthur needed to make a decision on what to do with the Emperor about his involvement in the war and whether he needed to be charged with war crimes. Those close to the Emperor would hold the key to his fate.", "rating": "4"}, {"helpful": 8, "title": "Works for me", "body": "Since I began taking Resveratrol I do not feel the need to take an afternoon nap. I am alert throughout the day and I attribute that to Resveratrol. I was taking the recommended 2 capsules per day but that was a bit much for my system. I found that taking two capsules kept me from falling asleep in a timely manner. At one capsule perday, I feel the boost that best fits my system. I am surprised and impressed with the results. I will continue to use Resveratrol and I hope that it works as well as it has so far.", "rating": "5"}, {"helpful": 9, "title": "Great price", "body": "I purchased this product for the benefits that resveratrol provides that are not listed on the label. According to a popular bodybuilding and supplement company resveratrol can act as a potent anti-estrogen and natural testosterone booster. The price and dose of this product is outstanding. I will keep buying this product.", "rating": "5"}, {"helpful": 9, "title": "Given that I strive for health and stamina with good food, exercise and various supplements from time to ...", "body": "Hope it works. Given that I strive for health and stamina with good food, exercise and various supplements from time to time, I have no real proof that this product works. I have not experienced any side affects while taking it.", "rating": "5"}, {"helpful": 7, "title": "Resveratrol 1250mg Extra Strength", "body": "Resveratrol 1250mg Extra Strength. When you can't drink wine daily this is a great alternative to help keep your heart vessels clear to provide blood flow to the heart for nutrients and oxygen that is so essential for good heart health.", "rating": "5"}, {"helpful": 4, "title": "Good for flu season", "body": "I've been trying a few different products from Zenwise lately and they have definitely impressed me.  They even have products for my dogs!  After all, if I take supplements why wouldn't they?", "rating": "5"}, {"helpful": 3, "title": "She says she feels great, no side effects from taking this supplement whatsoever", "body": "I was researching all about this supplement online.  I came across this information.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "second order. I am not a wine drinker so I use this supplement to get the benefits.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product.", "rating": "5"}, {"helpful": 0, "title": "I actually bought this for my family, and they ...", "body": "I actually bought this for my family, and they told me this product have helped decrease episodes of cold.", "rating": "5"}, {"helpful": 6, "title": "Radiant skin waiting!", "body": "We love this supplement it does amazing things for your skin!! Highly recommend it.  Nice high quality and milligram pills leaves more value for your money. Easy to take daily. Try it u will love it.", "rating": "5"}, {"helpful": 0, "title": "I actually bought this for my family, and they ...", "body": "I actually bought this for my family, and they told me this product have helped decrease episodes of cold.", "rating": "5"}, {"helpful": 0, "title": "Best time to take it before bed because its an ...", "body": "Really helps to give you more energy throughthe day. Best time to take it before bed because its an antioxidant.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I have read several articles on the benefits of this product and have added it to my daily supplements.", "rating": "5"}, {"helpful": 0, "title": "Works great for me", "body": "This product is as good as the site description and I will be buying it often.  Great customer service", "rating": "5"}, {"helpful": 0, "title": "Great quality", "body": "Excellent quality product.  Used for a month and will continue to use.", "rating": "5"}, {"helpful": 0, "title": "Grest Resveratrol Bargain", "body": "Necessary for my supplement regimen, good price, tons of resveratrol.", "rating": "5"}, {"helpful": 0, "title": "Very satisfied.", "body": "Reasonably priced, high quality product.  Very satisfied.", "rating": "4"}, {"helpful": 1, "title": "Resveratrol", "body": "Reading through reviews one said that you can get the same benefits from eating grapes.", "rating": "4"}, {"helpful": 0, "title": "Great product and value", "body": "I am very pleased with this product.", "rating": "5"}, {"helpful": 0, "title": "Amazing immune system booster", "body": "Amazing immune system booster. It is basically an antioxidant. Takes the skin of red grapes and that is where the benefits are,", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Believe this product is helping me.  Time will Tell", "rating": "4"}, {"helpful": 0, "title": "Good", "body": "HaVING IT to avoid future health issues", "rating": "4"}, {"helpful": 0, "title": "Resveratrol review", "body": "Love this product!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product!!!", "rating": "5"}, {"helpful": 0, "title": "One Star", "body": "Did nothing.", "rating": "1"}, {"helpful": 0, "title": "Five Stars", "body": "Love this", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I will recommend this supplement it gives me à lot energy and more .......", "rating": "5"}, {"helpful": 0, "title": "Resveratrol", "body": "Great product for the money, good value.  Recommend!", "rating": "5"}, {"helpful": 0, "title": "took and I love it. I would recommend to anyone", "body": "I received my order, took and I love it.  I would recommend to anyone.  Thank you.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great Product and Great Service!!!", "rating": "5"}, {"helpful": 0, "title": "Proven To Work!", "body": "This is my second order! It works! I am very pleased with it!", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "I like this reservatral good product for the price", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Came as promised and in good condition.", "rating": "5"}, {"helpful": 1, "title": "Powerful Antioxidant and Heart Health Optimization", "body": "The benefits of using Resveratrol include optimizing heart function, enhancing the immune system, providing cardiovascular support, and excellent antioxidant protection.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good stuff.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "This works really well", "rating": "5"}, {"helpful": 0, "title": "I Will Buy It Again!", "body": "Good product.", "rating": "4"}, {"helpful": 0, "title": "Helps Lower Hormones", "body": "In October I had really high DHEA-Sulfate, Total Testosterone and free Testosterone numbers---so I decided to take this product after hearing the positive effects it had on women with PCOS. (To Clarify: I do not have PCOS, just a bit of androgen excess)  Anyway, I took two pills every night before I went to sleep for a whole month---then had the same blood test in November, everything came out perfect! All the numbers stabilized to 'normal' levels.", "rating": "5"}, {"helpful": 0, "title": "Great product,really works", "body": "I have just started taking this product.in this short time I've ashtray noticed that I have more energy and just feel better overall. I will continue to take this and can't wait to see the long term results.I do recommend this product.", "rating": "5"}, {"helpful": 1, "title": "Nothing yet", "body": "I guess I expect to much from a product or maybe my 20 pounds isn't enough. I don't know. I'll keep on it see what I get at the end of the 2 weeks. I'll keep you posted. :)", "rating": "1"}, {"helpful": 0, "title": "Happy to find antioxidants supplements!", "body": "I waited to give my review to be able to see the difference after taking this supplements. Good blend, doesn't make your stomach uncomfortable like other supplements does. There's not that many supplements out these for antioxidants so I am very happy that I ran into these. I will continue using them, you can't think about spending money on supplements because your help matters most!", "rating": "4"}, {"helpful": 1, "title": "Three Stars", "body": "Not bad haven't noticed any good feeling.", "rating": "3"}, {"helpful": 1, "title": "Check the Proprietary Blend", "body": "I received a free sample of this product for testing and review.", "rating": "4"}, {"helpful": 4, "title": "Good Grape Seed Extract", "body": "I have been living with pancreatitis for over 30 years. I have used NOW Foods Grape Seed Extract for about 2 years now because I found out I had Celiac Disease which meant I had to use gluten free products. This is a good product and works for what I use it for which is to eliminate the inflammation, pain and nausea due to pancreatitis. The readers of my blog tell me I should write a book because I have figured out how to heal, stay well and live a fairly normal life - pain free. If you want to learn to do the same visit [...]  because my info is free and won't cost $30 like others charge.", "rating": "4"}, {"helpful": 4, "title": "Doctor Recommended", "body": "I take NOW Grape Seed Extract twice a day as part of a prescribed protocol my autoimmune specialist has me on.  The protocol is working, and after years of failing health, I feel like I am living again. I have been on this product for over eight months now (Apr 2011) and have not even had a cold or flu since, and my Lupus flares are much shorter in duration. I don't know how much this product contributes to my overall health, but I am so thankful to feel healthier, that its part, no matter how small, is worth the five stars.", "rating": "5"}, {"helpful": 2, "title": "Reduced my supplement intake greatly, better skin, minimal hangovers: amazing.", "body": "I am admittedly, a supplement freak. Super antioxidants? Amino acids? Pshh, that's entry level stuff. If it's a well researched compound that helps fight cell damage, give energy, destroy cancer..I've tried it. Also admittedly..plenty of these amazing supplements don't have any real noticeable effect in how I feel or look, so they work their way out of my rotation.", "rating": "4"}, {"helpful": 0, "title": "Would recommend to anyone", "body": "More energy after taking this product. Would recommend to anyone!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great so far", "rating": "5"}, {"helpful": 5, "title": "Five Stars", "body": "I take it once a day to eliminate my severe rheumatoid arthritis pain and symptoms.", "rating": "5"}, {"helpful": 1, "title": "Works on edema.", "body": "I bought this for my husbands edema. He has Hodgkins and this is a problem. It took about two weeks to work. After that the swelling went down. When he forgot to take it for about three days the swelling returned. Needless to say that won't happen again. Great product. He takes 2 pills a day with a meal.", "rating": "5"}, {"helpful": 1, "title": "help for pancreatitus", "body": "Great product husband has acute pancreatitus and hasn't had attack since started taking grape seed extract.I would recommend this product to everyone with who has trouble with their pancreas", "rating": "5"}, {"helpful": 2, "title": "So far so good!!!", "body": "Using Dr. Oz's recommendation for appetite suppressants;  Glucomannan, Apple Pectin, Grape Seed, and Forskolin.  And just added CLA (Conjugated Linoleic Acid).  My appetite has decreased and I've lost 10 pounds in a little less than 30 days, with minimal exercise--that will change in the next month.  Feel a little better too.", "rating": "5"}, {"helpful": 2, "title": "Good supplement", "body": "I like these but prefer the ones from Vitamin Shoppe as they are smaller caps (I take two at a time as they're less mg.).  But these are fine and do the job if you need supplements for digestion as I do.", "rating": "4"}, {"helpful": 2, "title": "Good supplement", "body": "I like these but prefer the ones from Vitamin Shoppe as they are smaller caps (I take two at a time as they're less mg.).  But these are fine and do the job if you need supplements for digestion as I do.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "great so far", "rating": "5"}, {"helpful": 1, "title": "Helps Reduce Lymphedema or Lipodema", "body": "This is one of the supplements I take to reduce lymphedema/lipodema. There's research to back it up - it works. I also take selenium.", "rating": "5"}, {"helpful": 3, "title": "Best Value", "body": "As a supplement in my MS management.  This is value priced and easy delivery is a fantastic extra value to someone who really is not a shopper.", "rating": "4"}, {"helpful": 1, "title": "They are great and easy to take.", "body": "They seem to be helping my stomach issues. I feel stronger and its easier for me to eat. I like the capsules because I can empty the powder onto my food.", "rating": "5"}, {"helpful": 2, "title": "Five Stars", "body": "Great deal and recently very hard to find in the retail stores.", "rating": "5"}, {"helpful": 4, "title": "Keeps bruises away", "body": "I can't take vitamin C which is the normal suggestion to prevent bruising. My doctor recommended this instead. It seems to work.", "rating": "4"}, {"helpful": 1, "title": "help for pancreatitus", "body": "Great product husband has acute pancreatitus and hasn't had attack since started taking grape seed extract.I would recommend this product to everyone with who has trouble with their pancreas", "rating": "5"}, {"helpful": 1, "title": "A good tiral", "body": "This product is as good as described online. I  always take grape seed extracts,but it is the first tme to try NOW. and I hope it can do well to me after taking it.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "good, i knew it in China. But it's hard and expensive to buy it in China.", "rating": "5"}, {"helpful": 3, "title": "Key Suppliment in my opinion.", "body": "Simply put, I've included this in my diet because it's a KEY antioxidant. I can't/won't go into \"supplement-ology\" with you, but it's as important to me as my Omega3, or Nature's Way \"daily\" vitamin's.", "rating": "5"}, {"helpful": 2, "title": "Great!!!", "body": "Works very well on serious skin infection, bladder infection. I'm allergic to most antibiotics, so I save a dr trip and take this, I would NOT recommend that to anyone, just saying...", "rating": "5"}, {"helpful": 7, "title": "grape seed", "body": "This is exactly what my doctor said I needed.  It arrived on time in excellent packaging.  I especially like that there enough tablets for over 6 months.  I really like that I don't need to unscrew the lid to get the tablets out.  I just flip the lid open.  Very easy to use. I plan  to reorder this when I finish this bottle.", "rating": "5"}, {"helpful": 6, "title": "Might not work for you...", "body": "I am posting this review to help others in choosing the right grape seed product. I recently started taking grape seed extract to help clean and strengthen my arteries etc. There is a potential issue with this particular product however. In addition to GSE, it contains ascorbic acid, which is vitamin c. Apparently, studies have been done which show that taking GSE and ascorbic acid together will cause elevated blood pressure.", "rating": "2"}, {"helpful": 2, "title": "Allergies and hangovers", "body": "Helps with alergies, and helps prevent hangovers especially when used with milk thistle", "rating": "4"}, {"helpful": 2, "title": "Five Stars", "body": "Great deal and recently very hard to find in the retail stores.", "rating": "5"}, {"helpful": 0, "title": "I like this deal", "body": "The price for this product is very good and is very competitive with other vendors. I have used this Brand Name before and I do like the results as a supplemental formula. The shipping was just fine too.", "rating": "5"}, {"helpful": 1, "title": "A good tiral", "body": "This product is as good as described online. I  always take grape seed extracts,but it is the first tme to try NOW. and I hope it can do well to me after taking it.", "rating": "5"}, {"helpful": 1, "title": "They are great and easy to take.", "body": "They seem to be helping my stomach issues. I feel stronger and its easier for me to eat. I like the capsules because I can empty the powder onto my food.", "rating": "5"}, {"helpful": 1, "title": "Helps Reduce Lymphedema or Lipodema", "body": "This is one of the supplements I take to reduce lymphedema/lipodema. There's research to back it up - it works. I also take selenium.", "rating": "5"}, {"helpful": 0, "title": "Alabama", "body": "Great for circulation and blood pressure.", "rating": "5"}, {"helpful": 6, "title": "This powerful antioxidant helps my diabetic father with his circulation ...", "body": "This powerful antioxidant helps my diabetic father with his circulation in his fight against peripheral neuropathy or diabetic neuropathy. He takes it every day.", "rating": "5"}, {"helpful": 4, "title": "vitamins", "body": "the body needs supplements to keep it going...this is a great product that works quite well and quickly within 2 days of taking my mum immediately started to feel the \"freshness\" and bounce in her step. will purchase again.", "rating": "5"}, {"helpful": 6, "title": "Product appears to work", "body": "I took this product to help with some skin problems I was experiencing.  After two weeks, my skin condition appeared to improve.", "rating": "4"}, {"helpful": 3, "title": "Five Stars", "body": "I like how I feel on this product. Gives me energy", "rating": "5"}, {"helpful": 2, "title": "Good price", "body": "This is a good priced supplement.  It pays to shop around and compare prices.  The NOW brand compares to the more expensive brands....", "rating": "5"}, {"helpful": 0, "title": "I like this deal", "body": "The price for this product is very good and is very competitive with other vendors. I have used this Brand Name before and I do like the results as a supplemental formula. The shipping was just fine too.", "rating": "5"}, {"helpful": 5, "title": "Grape Seed has excellent benefits! I take this kind as well as ...", "body": "Grape Seed has excellent benefits! I take this kind as well as a combo mix from Swansons, every morning and middle of day if I need extra boost to get me through. I try not to take too late in the day however, as have experienced trouble going to sleep if taken later part of day..... It has helped me with energy level.", "rating": "5"}, {"helpful": 0, "title": "Helps me sleep and reduce menstrual  bleeding", "body": "I am very pleased with this product.  I take 2 of these capsules before bed, and my sleep has improved.  Also mensrual bleeding is dramatically reduced.  Wonderful supplement!", "rating": "5"}, {"helpful": 0, "title": "Great Buy!", "body": "Great Product!  I haven't taken it for long, so I will see how it does over the course of the bottle.  But, it was packaged well, and shipped quickly as promised.", "rating": "5"}, {"helpful": 1, "title": "One Star", "body": "I got it for interstitial cystitis.  It had a form of acid in it and hurt my bladder.", "rating": "1"}, {"helpful": 1, "title": "MADE A BIG DIFFERENCE FOR MY MOTHER", "body": "I'M IN HEALTH CARE & THIS IS AN IMPORTANT SUPPLEMENT FOR PEOPLE TO TAKE!", "rating": "5"}, {"helpful": 1, "title": "No results", "body": "No results that I can tell but it has only been about a month....", "rating": "3"}, {"helpful": 3, "title": "Key Suppliment in my opinion.", "body": "Simply put, I've included this in my diet because it's a KEY antioxidant. I can't/won't go into \"supplement-ology\" with you, but it's as important to me as my Omega3, or Nature's Way \"daily\" vitamin's.", "rating": "5"}, {"helpful": 0, "title": "Grapes Pills", "body": "The grape is very good for the blood circulation. I got this for my mom and works perfectly for her. Her doctor recommends the grape than vitamin E", "rating": "5"}, {"helpful": 0, "title": "Great product!", "body": "Great product!  Fast shipping!  Great experience!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Quality product. Repeat buyer.", "rating": "5"}, {"helpful": 0, "title": "Great Product!", "body": "Can't do without it. Great product.", "rating": "5"}, {"helpful": 0, "title": "Love it, wonderful product", "body": "Love it,  wonderful product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good delivery.  Good price", "rating": "5"}, {"helpful": 1, "title": "Great!", "body": "Slows down ageing. Everyone we recommend this to after two weeks don't want to ever be off of it again. Me? I'd rather eat blue berries, but there you go.", "rating": "5"}, {"helpful": 1, "title": "I like it", "body": "So far, I am happy with the product. I haven't been taking it very long. I think it will take a few weeks to determine how beneficial it will be.", "rating": "5"}, {"helpful": 1, "title": "Vegan!!!", "body": "I like the fact that it is a vegetable capsule and relatively easy to swallow. The capsule is about 7/8\" long and about 1/4\" wide.", "rating": "5"}, {"helpful": 0, "title": "Great Product!", "body": "Can't do without it. Great product.", "rating": "5"}, {"helpful": 1, "title": "Very satisfied", "body": "Ordering was easy, the product shipped quickly and I had it in a few days.  Will reorder again.  Highly recommended.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Taking, the effect is not obvious", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent and Responsable dealer", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Quality product. Repeat buyer.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Good value and a good product!", "rating": "4"}, {"helpful": 1, "title": "Three Stars", "body": "Didn't really notice any difference in taking this product. I took for a couple of months.", "rating": "3"}, {"helpful": 0, "title": "Love it, wonderful product", "body": "Love it,  wonderful product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good delivery.  Good price", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Very good product!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Works as expected", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Use this everyday", "rating": "5"}, {"helpful": 2, "title": "great product, great price..", "body": "I love the NOW products but this one is the best of the best. I give it every day to my son with vit. C. suppose to be an excellent combination for growing kids.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great product", "rating": "5"}, {"helpful": 0, "title": "It is benifit", "body": "It is benifit", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great value!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Thank You", "rating": "5"}, {"helpful": 0, "title": "I love it", "body": "excellent", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Thanks!", "rating": "5"}, {"helpful": 0, "title": "Great price for a good product", "body": "Quality product and a very affordable price.  Natural product vs some products that you can't tell if they are manufactured or real.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "QUICK SHIPPING-GREAT PRICE- GREAT PRODUCT", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent Grape Seed and fast delivery.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Long-term use, have the effect.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Works will buy again.", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "capsules are too large", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "Long-term use, have the effect.", "rating": "5"}, {"helpful": 0, "title": "Smooth satisfying transaction", "body": "Good product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Truly like this supplement!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Love it", "rating": "5"}, {"helpful": 1, "title": "One Star", "body": "THESE ARE MUSTY AND I CANNOT TAKE THEM", "rating": "1"}, {"helpful": 0, "title": "Four Stars", "body": "good product", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "GOOD PRODUCT", "rating": "4"}, {"helpful": 1, "title": "Four Stars", "body": "ok", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "AAA", "rating": "4"}, {"helpful": 2, "title": "seems to ok , excellent service from vendor", "body": "Have used this product for three years. Seems to work, although I don't know how to tell specifically. However every thing I've read pertaining to Grape seed NOW foods are highly rated. Received product promptly, all around good srevice.", "rating": "3"}, {"helpful": 0, "title": "maybe", "body": "This is I help my friends to buy, also didn't use, later to add comments,that is all i for this one,", "rating": "5"}, {"helpful": 1, "title": "I LIKE IT ,I LOVE IT ,,", "body": "I LIKE IT ,I LOVE IT ,,I LIKE IT ,I LOVE IT ,,I LIKE IT ,I LOVE IT ,,I LIKE IT ,I LOVE IT ,,", "rating": "4"}, {"helpful": 3, "title": "Bruising Easily?", "body": "I bruise very easily and that is due to small capillaries and thinner skin at this time in my life.  I was told about this product and even though the bottle says take only one a day, I take two, because that is what is needed for my body.  AMAZING GRACE------I still bruise, but rarely.  The difference is phenomenal.", "rating": "5"}, {"helpful": 0, "title": "Improved my overall health", "body": "I started taking this since it arrived and it has done wonders for me. I also take other supplements but adding this I have noticed a difference to my overall health. Reason for four stars is that I do not know yet if it will continue to improve my health but will see when I get ready to order the next bottle.", "rating": "4"}, {"helpful": 0, "title": "This Grape Seed Extract contains a minimum of 95% Polyphenols!", "body": "I have been taking grape seed extract for about 6 months, then I found out that this Grape Seed Extract contains a minimum of 95% Polyphenols, which from what I understand works better than a standard grape seed extract. This Seller gives you a 6 month supply of 400mg product. I am very satisfied!", "rating": "5"}, {"helpful": 2, "title": "one or 2 pills daily reduced my inflamantion of joints that occur from lack of veggies, dehydration or too much exercise", "body": "one or 2 pills daily reduced my inflamantion of joints that occur from lack of veggies, dehydration or too much exercise", "rating": "5"}, {"helpful": 8, "title": "Great grape seed extract", "body": "Of all the different grape seed extract products on Amazon, this one seems to be the best value. The combination of 180 capsules, 400mg per capsule, and 95% antioxidants was the best combination.  Just received the product – and it’s top-notch!", "rating": "5"}, {"helpful": 0, "title": "Good results, unexpected bonus", "body": "Have worked well for me/  Bought it doctor said it would help my allergies without irritating my prostate/  That worked well, additionally my hemorrhoids starting shrinking and after about a month have disappeared, did not expect that.", "rating": "5"}, {"helpful": 1, "title": "Very high quality and will be something i hope to ...", "body": "Very high quality  and will be something  i hope to be taking for some time. Very excited about having my blood work checked in a few months....this will be THE determining factor.!", "rating": "5"}, {"helpful": 1, "title": "Quick shipping", "body": "Easy to swallow....don't feel any different but sometimes that's a good thing", "rating": "5"}, {"helpful": 0, "title": "Good, quality control could improve a bit", "body": "Seems good, good value.  One capsule was empty so the quality control maybe an issue.", "rating": "4"}, {"helpful": 0, "title": "said good studies on Grape Seed Extract", "body": "Looking forward to blood tests. My Dr. said good studies on Grape Seed Extract.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "very good", "rating": "5"}, {"helpful": 0, "title": "GOOD STUFF", "body": "GOOD STUFF", "rating": "5"}, {"helpful": 0, "title": "Healthy", "body": "I am hoping for the best as Grape Seed extract has proven to be beneficial to heart health.  Prompt delivery.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product!", "rating": "5"}, {"helpful": 0, "title": "All Good So Far", "body": "Bottle arrived safely and this supplement should work out well.  I like grapeseed extract and have used it for a number of years.", "rating": "5"}, {"helpful": 0, "title": "Good product.", "body": "Very quick delivery, safely packaged, reasonable price, value for money.. I will buy it again. Thank you", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great product and very happy with the seller I will be a repeat customer... Fast shipping too", "rating": "5"}, {"helpful": 0, "title": "Bought it", "body": "Great product.  Husband did the research and felt this product met his need best.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Satisfied! Good delivery time and great product.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product and arrived on time.", "rating": "5"}, {"helpful": 0, "title": "Great product for a fair price!", "body": "Great product for a fair price!", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Quality product, fast delivery!", "rating": "5"}, {"helpful": 1, "title": "I think it will be fine according to other reviews and I received the order ...", "body": "I just received the item in the last week or 2 so cannot know whether grape seed extract works to lower my blood pressure or not....I think it will be fine according to other reviews and I received the order in good time.", "rating": "5"}, {"helpful": 1, "title": "Identical to other, more expensive brand", "body": "This product should be fine - I compared the capsule to my other brand that cost much more and the capsules are identical! Glad I found Jazzee!", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Perfect source of grape seed for my vitamin regimen.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great price for an amazing supplement that has so many health benefits.", "rating": "5"}, {"helpful": 1, "title": "Grapeseed extract", "body": "Just started taking the product. Am pleased with delivery and price. Will order again thank you", "rating": "5"}, {"helpful": 0, "title": "Product arrived quickly Very good value for the price", "body": "Product arrived quickly  Very good value for the price.  Too early to judge the effectiveness, but seems good so far.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "excellent product at a price that's much better than the brick and mortar herbal store with BOGO's....", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "These seeds are very beneficial for a good health.", "rating": "5"}, {"helpful": 0, "title": "All Good So Far", "body": "Bottle arrived safely and this supplement should work out well.  I like grapeseed extract and have used it for a number of years.", "rating": "5"}, {"helpful": 0, "title": "Good product.", "body": "Very quick delivery, safely packaged, reasonable price, value for money.. I will buy it again. Thank you", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great product and very happy with the seller I will be a repeat customer... Fast shipping too", "rating": "5"}, {"helpful": 0, "title": "Bought it", "body": "Great product.  Husband did the research and felt this product met his need best.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product and arrived on time.", "rating": "5"}, {"helpful": 0, "title": "Great product for a fair price!", "body": "Great product for a fair price!", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Quality product, fast delivery!", "rating": "5"}, {"helpful": 0, "title": "Product arrived quickly Very good value for the price", "body": "Product arrived quickly  Very good value for the price.  Too early to judge the effectiveness, but seems good so far.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "excellent product at a price that's much better than the brick and mortar herbal store with BOGO's....", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "These seeds are very beneficial for a good health.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product! Very easy transaction no problems!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "It's good.", "rating": "5"}, {"helpful": 1, "title": "but with this one I have to make sure I take it with food like a whole actual meal or I would feel nauseated ...", "body": "I have taken other grape seed extract before and never had a problem with nausea, but with this one I have to make sure I take it with food like a whole actual meal or I would feel nauseated a few minutes after. I am guessing it could be because it's higher mg compared to the ones I took before. So for people who have problem with nausea just make sure to take it with meal, that would be my only concern.", "rating": "4"}, {"helpful": 0, "title": "Fast shipping", "body": "I posting my Feedback now because I was asked to do so, but I think  it is too soon to say something good or bad about this product, I can say....  they came really fast!! good thing.lol....and... so far I haven't have any side effect", "rating": "3"}, {"helpful": 1, "title": "Cancer Begone!", "body": "My DN prescribed this to prevent cancer recurrence.", "rating": "5"}, {"helpful": 1, "title": "Good Product", "body": "Has heled with Grandsons ADHD immensely", "rating": "5"}, {"helpful": 1, "title": "Effective health and cost wise", "body": "Just as good as the stuff from Costco and yet a bit less expensive.", "rating": "5"}, {"helpful": 1, "title": "Good product, fast delivery", "body": "I was so happy finding a high dose and high-quality grapeseed extract supplement.  Thanks for providing a great product.", "rating": "5"}, {"helpful": 2, "title": "Highest mg dose i have found and 3 month supply for price", "body": "Most grapeseed capsules out there are extremely low like 100 mg per capsule and then u have to take 2 of them daily along with you will only receive 60 tabs per order. This is by far best quality ,strength , price, and quantity I've seen. The benefits of grapes ed are proven to kill 83% of most cancer cells in our bodies. Being a previous smoker I need all of that I can get. Plus it's  one of the best antioxidant God placed here on this earth for our bodies. I am very pleased with this company and their product. Thank you", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "GRT PRICE", "rating": "5"}, {"helpful": 0, "title": "Excellent product", "body": "Shopped quickly - no problems", "rating": "5"}, {"helpful": 1, "title": "Great product !!!", "body": "Since I began taking Herbal Secrets grapeseed, I have been feeling much better.", "rating": "5"}, {"helpful": 0, "title": "Could have been a bad batch I guess", "body": "Made my husband and I both sick... Could have been a bad batch I guess.", "rating": "1"}, {"helpful": 0, "title": "Great", "body": "Good product. Fair price. Thanks", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "good product good price", "rating": "4"}, {"helpful": 2, "title": "Highest mg dose i have found and 3 month supply for price", "body": "Most grapeseed capsules out there are extremely low like 100 mg per capsule and then u have to take 2 of them daily along with you will only receive 60 tabs per order. This is by far best quality ,strength , price, and quantity I've seen. The benefits of grapes ed are proven to kill 83% of most cancer cells in our bodies. Being a previous smoker I need all of that I can get. Plus it's  one of the best antioxidant God placed here on this earth for our bodies. I am very pleased with this company and their product. Thank you", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great anti-oxidant!", "rating": "5"}, {"helpful": 0, "title": "Free Radicals.", "body": "as long as it keeps me looking younger I am all for it.", "rating": "4"}, {"helpful": 0, "title": "Four Stars", "body": "good price.  couldn't find locally", "rating": "4"}, {"helpful": 0, "title": "great! product", "body": "Prompt shipping, great! product. A+", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product and fast delivery, thank you.", "rating": "5"}, {"helpful": 0, "title": "This is perfect", "body": "Sometimes difficult to find Grapeseed Extract locally. This is perfect.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "very good supplement", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "great", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "YASS MAN %○[ 》>", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Excellent product", "rating": "5"}, {"helpful": 0, "title": "Super product. Ill stick to this", "body": "Super product.Ill stick to this brand", "rating": "5"}, {"helpful": 7, "title": "its worked for me", "body": "after a week i noticed a drop in my BP  130s/ 90s  to 120s/80s", "rating": "5"}, {"helpful": 3, "title": "Potent and good price for mg/pill count", "body": "I take this with a few other supplements in the morning including vitamin C. My purpose for taking it is the antioxidant effects. Something I did notice though is when I stack this with cognitive supplements, I don't get a headache unlike taking just the cognitive supplements alone.", "rating": "5"}, {"helpful": 1, "title": "Highly recommend. Worth buying to support good health", "body": "Been using Grape Seed Extract for years for immune system support. I never get sick except for an occasional cold. Highly recommend. Worth buying to support good health.", "rating": "5"}, {"helpful": 2, "title": "A good options when need urgently as gift.", "body": "A good option with good price without buying from GNC officall site.", "rating": "5"}, {"helpful": 0, "title": "... for me but the one using it says it's good and feeling energetic", "body": "it's not for me but the one using it says it's good and feeling energetic.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Good job!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "as good as usual, I bought it many times", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "It's nice one with on-time delivery.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Quality product, fast service.  Who could ask for anything more?", "rating": "5"}, {"helpful": 0, "title": "GNC Grape Seed 300 mg", "body": "Lower BP.  So far so good for me.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "I use this everyday.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Always re-order", "rating": "5"}, {"helpful": 0, "title": "One Star", "body": "Did nothing.", "rating": "1"}, {"helpful": 0, "title": "Four Stars", "body": "Very helpful", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Good price and easy to swallow.", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "Love it", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "nice", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good price", "rating": "5"}, {"helpful": 1, "title": "Cheap health supplementary.", "body": "Although I do not see any effect that these capsules have on my body, it's not too expensive to have a bottle which might keep you healthy and young.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Good price and easy to swallow.", "rating": "5"}, {"helpful": 1, "title": "It is just too big to swallow it! I ...", "body": "It is just too big to swallow it! I tried several times, until the outer capsule has been dissolved... I still cannot make it.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "good item! very useful.", "rating": "5"}, {"helpful": 1, "title": "It seems to be working .", "body": "Got this product to help with my BP and so far it seems  to be helping so that makes me happy with it.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I use this everyday.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I will buy it again.", "rating": "5"}, {"helpful": 8, "title": "Two Stars", "body": "Too expensive, the official website of $ 19.9", "rating": "2"}, {"helpful": 0, "title": "Five Stars", "body": "Friend likes it!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Always re-order", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "so far so good!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "cheap and good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Always Great!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good as usual", "rating": "5"}, {"helpful": 0, "title": "One Star", "body": "Did nothing.", "rating": "1"}, {"helpful": 0, "title": "Four Stars", "body": "Very helpful", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Thanks! !!!+", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "GOOD PRODUCT", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "It is nice.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Best", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Very good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "so far so good!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "It is nice.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good as usual", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 4, "title": "good", "body": "actually can buy it in GNC webset, the price is not good", "rating": "4"}, {"helpful": 0, "title": "... take grape seed extract I really do not feel good. So then when I remember and take it ...", "body": "I have come to realize that this GNC brand did not control my hypertension.  The brand I normally use is Healthy Origins which I believe did a better job of lowering my blood pressure.", "rating": "1"}, {"helpful": 1, "title": "Five Stars", "body": "Good gse product", "rating": "5"}, {"helpful": 1, "title": "Three Stars", "body": "I did not feel very useful.", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "Good experience", "rating": "5"}, {"helpful": 1, "title": "Cheap health supplementary.", "body": "Although I do not see any effect that these capsules have on my body, it's not too expensive to have a bottle which might keep you healthy and young.", "rating": "4"}, {"helpful": 1, "title": "It seems to be working .", "body": "Got this product to help with my BP and so far it seems  to be helping so that makes me happy with it.", "rating": "5"}, {"helpful": 1, "title": "It is just too big to swallow it! I ...", "body": "It is just too big to swallow it! I tried several times, until the outer capsule has been dissolved... I still cannot make it.", "rating": "4"}, {"helpful": 2, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "The price of the official website when the activities of high ah, no advantage, the date fairly fresh", "rating": "3"}, {"helpful": 1, "title": "Three Stars", "body": "good", "rating": "3"}, {"helpful": 1, "title": "Five Stars", "body": "i come from china i love it", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "nice", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Best", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Very good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Dietary supplement for women. I hope it can make me much healthier and help antioxidant", "rating": "5"}, {"helpful": 0, "title": "everything is good than you", "body": "This second time order had been well received on time,everything is good than you!", "rating": "5"}, {"helpful": 1, "title": "Three Stars", "body": "good", "rating": "3"}, {"helpful": 1, "title": "Five Stars", "body": "Good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "bought for my dad which is good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Nice Product! Thank You!", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Grape Seed Extract really helps reduce my inflammation!  And it's all natural!", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Speedy service and great prices. Definitely recommended.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Expected effect", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Good product!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good price!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Pretty good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "very good", "rating": "5"}, {"helpful": 0, "title": "seems good!", "body": "Seems good!", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "GOOD", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 2, "title": "nauseous, uncomfortable", "body": "i feel nauseous after taking this extract and won't eat it again. just waste of my money", "rating": "1"}, {"helpful": 2, "title": "One Star", "body": "order 2 bottles 300mg but received 2 bottles100mg，disappointed！", "rating": "1"}, {"helpful": 1, "title": "Five Stars", "body": "Grape Seed Extract really helps reduce my inflammation!  And it's all natural!", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Speedy service and great prices. Definitely recommended.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Good!", "rating": "5"}, {"helpful": 0, "title": "GNC Herbal Plus Grape Seed Extract 300 mg", "body": "Super Antioxidant from a trusted source! Would buy it again!", "rating": "5"}, {"helpful": 0, "title": "I like", "body": "It works for me, I like it", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Send a friend,very nice", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I like this item, thank you.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "GOOD!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "good", "rating": "5"}, {"helpful": 1, "title": "Love it and have been taking this for a long ...", "body": "Love it and have been taking this for a long time. I believe I will see the effect 10 years later. I will take this every day.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "very good", "rating": "5"}, {"helpful": 4, "title": "One Star", "body": "It smells soo bad, like the plastic,I think it's fake", "rating": "1"}, {"helpful": 7, "title": "It is fake. I bought other one on local ...", "body": "It is fake. I bought other one on local gnc store. This powder is defferent from the real one. This powder can see some white powder in it. and also reader than the real one", "rating": "1"}, {"helpful": 1, "title": "good, but not the best", "body": "A good price option compare to buying from GNC official site.", "rating": "4"}, {"helpful": 8, "title": "Two Stars", "body": "Too expensive, the official website of $ 19.9", "rating": "2"}, {"helpful": 3, "title": "waste of money", "body": "why isnt the bottle glass or bpa free. This company has lost its quality and care for its customers. Its literally just out for your money. Its not even organic...... meh. the product didnt work as well as other brands that have higher standards. good job for being better quality then vitamin shoppe and centrum, s***ty for being the biggest vitamin company in the world.... hope you get your act together gnc. I bought this online because even though some employees are nice I didnt want to deal with BS sales for PM's/commission and I know how hard they work for their low pay. I wish this company would go back to being privately owned and revert back to the quality products in the early 2000's I've been a customer for a very long time.", "rating": "1"}, {"helpful": 1, "title": "Five Stars", "body": "works well! and chapter than store!", "rating": "5"}, {"helpful": 2, "title": "Expired!", "body": "The Label on the bottle said it is best by 08/18, it expired already!", "rating": "1"}, {"helpful": 1, "title": "The fountain of Youth", "body": "i have been ordering from BulkSupplements for about 1 year. Each time I try a new product I am more impressed with the quality of this company, and the amount of money I have been saving by buying these supplements in bulk, rather in capsule form. I make smoothies every morning with vanilla yogurt, almond millk , knox unflavored gelatin, and bulksupplements vitamin E, biotin, coq10, grapeseed extract, B12, Hyraluric Acid, cinomon and stevia. All of these products have been recommended by my holistic doctor for getting the necessary nutrients that my body needs, but honestly, I feel so incredible, have unlimited energy, and each time I go into town I run into someone I know and they All make the remark to me about how young I am looking. I am soon turning 65, and they tell me I act 20, and look 40, so as far as I am concerned, this company is the fountain of youth for me. Best buy, best quality, and best service.", "rating": "5"}, {"helpful": 3, "title": "GSE is amazing stuff!", "body": "Love how this is the real deal.  So much better and cheaper than the capsules that have mostly filler 'n such. Also LOVE the company. Super fast shipping and product was just as described. Just a warning, though,  it's an extremely fine powder.. I'm currently putting it in gel capsules.. I don't have a capsule filler, so this is a bit difficult and messy. Also the recommended dosage is 1\\16th of a tsp. A tiny bit goes a very long way, but I do suggest getting the proper tools to make your own caps. I bought the tiny teaspoons and I'm looking into a cap filler.. otherwise you can just sprinkle the powder on cereal or in a drink.. it's just bitter to taste  Hooray for GSE!! If you google GSE and stomach flu.. there are many articles on how it can kill the virus and prevent you from getting it! I'm true testimony to that.. as my family had two bouts of the nasty bug and this along with grape juice (which if you google that, also, may prevent the bug) I've avoided getting it both times! Plus there are many more benefits to GSE!", "rating": "5"}, {"helpful": 4, "title": "A powerful nutraceutical", "body": "In the past, I have purchased other brands of Grape Seed Extract Powder, including NOW, Life Extension and Solgar, all of which come in capsules. I decided to go with BulkSupplements this time around because their product is grown in France and the cost of buying this powder in bulk cannot be beat.", "rating": "5"}, {"helpful": 2, "title": "Anyone got a way to get past the taste?", "body": "Back for more...bought a kilo this time. This is one of those supplements where I can actually feel the difference when taking it. The research I've read is compelling, and this is by far the best price I've found. ONLY PROBLEM is capping it, which I have to do, as I could not find a way to get past the taste (it would be okay in smoothies I guess, but take mostly on empty stomach). Now, I'll put some pretty bad tasting stuff in a shot glass, throw it back, and chase it with more water and an ounce of juice. Can't do that with this...it tastes BAD and stays in your mouth. I'm wondering if anyone has found a way to consume it on a mostly empty stomach without capping it. (capping takes me about 10 minutes for 24 500 mg. caps. - if I weren't retired I'd probably still be buying it in caps). Still FIVE STARS ... great product.", "rating": "5"}, {"helpful": 4, "title": "Necessary for older males", "body": "Received free sample for hubby;", "rating": "5"}, {"helpful": 2, "title": "this is good because it spreads it over all her teeth and ...", "body": "I purchased to add to a DIY potion for cleaning tartar from my dog's teeth. along with the other ingredients it seems to be working..along with the rest of ingredients which include distilled water, coconut oil, spearmint oil (to freshen breath)  & grapefruit seed extract. Most of these ingredients can be found in commercial products, however the products in the marketplace also contain grain alcohol, an ingredient that is harmful for the dog so I opted to do my own mixture. My dog lets me spray her teeth/gums and then she licks it around..this is good because it spreads it over all her teeth and gums so it will clean, freshen and aid in the prevention of gum disease..Seems to be working fine.", "rating": "5"}, {"helpful": 1, "title": "GREAT VALUE", "body": "Made in Europe not China a better percentage of quality product.  THIS IS A GREAT VALUE FOR SUPPLEMENTS.  I started taking it the day it arrived, 5 days ago, and I am noticing a slight energy increase.  I will know for sure after at least a month of continual use", "rating": "5"}, {"helpful": 4, "title": "Great In 00 Capsules - Works Perfectly!", "body": "I love BS products (er, BulkSupplements). I take a lot of BS, every day.  (In all seriousness, zinc glauconite, vit c, Te \"00\" gel caps, I use a lot of BulkSupplements products!)", "rating": "5"}, {"helpful": 1, "title": "I don't know if it was just by chance but the first morning I tried it I felt great that day", "body": "I have just recently got this so I can't tell you about any long term effects. I don't know if it was just by chance but the first morning I tried it I felt great that day. I am going to keep on taking it.  If you are considering buying this I suggest buying capsules to put it in. It doesn't dissolve in liquid very well and is bitter, which is fine with me. I didn't expect it to taste like candy!  Also as far as storing it, I keep it in a mason jar like I do with most of the powdered supplements I get.", "rating": "5"}, {"helpful": 8, "title": "Pure and potent but tastes like tree bark", "body": "I use Grape Seed Extract in both my pre-workout and my lunchtime \"concoctions\".  My research has shown that this product may help cardiovascular, improving both circulation and lowering cholesterol.  It has anti-oxidants which may help skin damage and it can also reduce pms symptoms.  The flavor is a bit bracing, reminds me of what ground up tree bark would taste like.  Recommend mixing it with a fruit juice.  Most of the bulk supplement products I am including in my mixes are very tart/bitter.  I take it like a man though and just mix with water, pinch up my face and then wash it down quickly with a glass of water.  After what came before, a glass of regular water never tasted so sweet...  :-)", "rating": "5"}, {"helpful": 1, "title": "I don't know if it was just by chance but the first morning I tried it I felt great that day", "body": "I have just recently got this so I can't tell you about any long term effects. I don't know if it was just by chance but the first morning I tried it I felt great that day. I am going to keep on taking it.  If you are considering buying this I suggest buying capsules to put it in. It doesn't dissolve in liquid very well and is bitter, which is fine with me. I didn't expect it to taste like candy!  Also as far as storing it, I keep it in a mason jar like I do with most of the powdered supplements I get.", "rating": "5"}, {"helpful": 4, "title": "Potent...But MIX it with something or CAP it", "body": "This is one product that you REALLY want to cap. It's a lot cheaper to buy supplements as powders than via pre-packaged pills, but this one tastes bad, AND it STICKS to your mouth (or anything else) when you try to take it straight with a swig of water (which is what I typically do for my supplements...yeah, tastes awful, but it's cheap and saves me a ton of money and gives the same effects). This one though...eh lesson learned. From a \"does it work\" standpoint though, I'd say so. GSE studies indicate many beneficial properties. I take it to help curb insulin spikes after eating foods with sugar, and while I don't know if it does that, I DO eat less afterwards because the taste is SO bitter that I lose all desire to eat. So, er...yay!", "rating": "3"}, {"helpful": 2, "title": "Exceptional for my energy and circulation", "body": "Very good product, I use it to improve my circulation mainly and I stack it with L-Arginine powder and do I get a boost of energy? YES I DO", "rating": "5"}, {"helpful": 2, "title": "This product is a terrific value and easy to use - I mix it ...", "body": "This product is a terrific value and easy to use - I mix it with water and let it stand for a few minutes so that the water fully mixes with the powder, then I drink it down. I gave the product four stars instead of five only because I would like to be able to purchase some sort of measuring spoon that would accommodate the small amount of powder recommended for use. I haven't been able to find such a spoon (or other substitute). Regardless, now that I know about this company, I'll likely purchase other supplements from them, since the savings are considerable when compared to capsule purchases in a store.", "rating": "4"}, {"helpful": 3, "title": "Great for overall health!", "body": "I will concede that I got a sample from BulkSupplements for reviewing this. They have great service and have a plethora of supplements to choose from. While others may like it and while it may be a benefit to the supplements, I actually don't really like these being in a foil-like zip lock type of container. Small containers with a screw-on cap work a little better for me, especially if you get these in the 10-25g or other small size containers. The 250-500g containers I have no issues with now as the powder is still close to the top. Aside from this, BulkSupplements is great and there are so many great supplements that you can get from them and not from other competitors. I have ordered Milk thistle, Coq10, R-ALA, ALCAR, L-Citruilline, L-Norvaline, Rhodiola Rosea, Creatine, L-Glutamine, L-Tyrosine, DMAE, LongJack, and BCAA from BulkSupplements and I am pleased with each. Using supplements mostly from BulkSupplements and LiftMode have greatly improved my mood, energy levels, stress levels, clarity of mind, and overall health.", "rating": "5"}, {"helpful": 1, "title": "I bought this for all the good it should do long term", "body": "I bought this for all the good it should do long term, which people have to research for themselves to see if this is what they need.  I was surprised to see the deep purple/red color.  It's very potent and it came in a long bag, making it difficult to reach in with a measure spoon without getting this all over my hand and everything else.  Be prepared with a nice little jar.  I had one almost pint size and have more left over in the packet when the jar is empty.  I cut down to where the powder was and carefully spooned it into the jar.  Now I can use a measure spoon and no powder escapes or travels.  Okay, that being said.  This is the real deal.  I always taste any powder I use, and this has a fruity and almost bitter flavor which works great with my morning smoothie.  I don't need anything to sweeten what I already use.  I use BulkSupplements for almost everything for powdered supplements and have never been disappointed.  Of course one can't tell until a long time later if a supplement seems to improve health, but of course I go with the studies and know I'm doing what I can for myself.  This will last me a long time for the price.  Totally pleased!", "rating": "5"}, {"helpful": 8, "title": "I`m Excited!", "body": "I bought the grape seed extract after reading a study \"Beneficial Clinical Effects of Grape Seed Proanthocyanidin Extract", "rating": "5"}, {"helpful": 0, "title": "Their solution is to mix it with apple sauce and it is easily swallowed. So this is how we take it", "body": "I bought this recently for me and my wife, we take 100mg of grape seed extract on a daily basis. This began about 30 years ago after seeing a news story in Atlanta about a woman who suffered from debilitating season allergies. She related that after several weeks of taking grape seed her allergy problems all but cleared up.", "rating": "5"}, {"helpful": 3, "title": "Warm hands", "body": "Feel blood flow to my cold hands within 15 minutes. But EAT something before taking this! It caused nausea on an empty stomach. Also, do not take near bedtime. I was awake until 3:00 AM a few nights when I really wanted sleep.", "rating": "4"}, {"helpful": 4, "title": "Great In 00 Capsules - Works Perfectly!", "body": "I love BS products (er, BulkSupplements). I take a lot of BS, every day.  (In all seriousness, zinc glauconite, vit c, Te \"00\" gel caps, I use a lot of BulkSupplements products!)", "rating": "5"}, {"helpful": 0, "title": "Happy there were conversion measurements on the package label", "body": "Very impressed with quality. I had been  searching for grape seed powder. Happy there were conversion measurements  on the package label.  I will buy from BulkSupplement again.", "rating": "5"}, {"helpful": 0, "title": "Quality Pure Grape Seed Extract", "body": "The quality of this pure grape seed extract is excellent! I will continue to purchase my powder supplements from BulkSupplements. I'm very pleased with my purchases from them!", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "This product seems very strong and pure.", "rating": "5"}, {"helpful": 0, "title": "Pure is best", "body": "This is just another product that I have found to be tantamount to superior....keep up the great products and I'm hoping that I will again find (magnesium-l-theronate) on this site", "rating": "5"}, {"helpful": 1, "title": "Great Product", "body": "Just received my Bulk Supplements Pure Grape Seed Extract 3 days ago and have started taking them. Was very pleased with how fast they arrived. They were very securely packed in bubble wrap so no damage occurred. I am using them in a shake recipe so I have to break open the capsules and poor out the powder. The capsules are hard to get apart so they are put together very well. I chose the capsules over the bulk powder so I would have a perfect 200 mg measurement. So far I am pleased with the results but it's a little early to tell. I think I will be buying more products from this company. Thank you for a quality product.", "rating": "5"}, {"helpful": 0, "title": "Nothing yet", "body": "Just started using it last week. So far I can not tell any improvement yet.", "rating": "3"}, {"helpful": 0, "title": "Recommend", "body": "Exactly what we needed at a great price.  Easy open package.", "rating": "5"}, {"helpful": 0, "title": "great product", "body": "Arrived in expected time frame. Husband seems very happy with this product and its much cheaper buying bulk then it is to buy this product in pill form.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "They are the best. Arrived early and sealed properly.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I Love it it came very fast the product is good quality and pure grape seed extract", "rating": "5"}, {"helpful": 0, "title": "Great extract no fillers!", "body": "I'm so happy to find pure grape seed  extract without nasty fillers, because I like to add it to my skincare. and because they don't have fillers so they are very tiny, so easy to swallow.", "rating": "5"}, {"helpful": 1, "title": "Another home run from Bulk Supplements.", "body": "I bought this product primarily because it has been proven to prevent the body from converting free testosterone to estradiol. I have low t and this was my only thought. I also have ADD however, the inattentive kind. Since I started adding 1000 mg to my morning smoothie, I have noticed a HUGE boost in energy and mental focus. I attribute this largely to the grape seed powder. I also added MCT oil which could also be making an impact. This is a great product, although clumpy. It is very astringent in the mouth and does best for me in a smoothie or stirred in applesauce. Highly recommend. Great quality from a great company.", "rating": "5"}, {"helpful": 1, "title": "High quality product guys!", "body": "This is my first time purchasing Bulk Supplements products and I'm glad I did. I've tried many of the top brands out there that promise premium and quality vitamins. I believed it until I tried Bulk Supplements. Two thumbs up on this pure Grape Seed Extract. The color is rich and my skin is glowing. Will purchase again! Highly recommend. Oh, the packaging sucks though. 5 stars for the product.", "rating": "5"}, {"helpful": 1, "title": "I like taking it about 30 minutes before working out", "body": "I'm very impressed with this product. I purchased the Grape Seed Extract because I had read about its ability to improve your circulation,by increasing your nitric oxide levels,and my experience confirms this. I like taking it about 30 minutes before working out, and the pumps I'm getting at the Gym are \"skin stretching.\" The amount I take in water is 1 teaspoon. This mixes well if you use warm water. I drink it like tea. It's potent stuff. Almost forgot to mention this,but it also works great for enhancing the \"skin stretching\" pumps you need for bedroom workouts,if you know what I mean.", "rating": "5"}, {"helpful": 1, "title": "GREAT PRODUCT FROM BULK SUPPLEMENTS AND AMAZON", "body": "I found Bulk Supplements online and ordered some of this Grape Seed Extract Powder.  I mix this powder in a protein shake.  It mixes very easily and is much less expensive than buying it in the capsule form.  Thanks Bulk Supplements.", "rating": "5"}, {"helpful": 0, "title": "Grape seed extract", "body": "So nice to be able to get the pure (and many) health benefits of grape seed extract without all the unnecessarily fillers! Have had a great experience with bulk supplements for years now, have never had any problems with them, fast shipping, product as described and courteous communication, will order again.", "rating": "5"}, {"helpful": 0, "title": "Quality Pure Grape Seed Extract", "body": "The quality of this pure grape seed extract is excellent! I will continue to purchase my powder supplements from BulkSupplements. I'm very pleased with my purchases from them!", "rating": "5"}, {"helpful": 0, "title": "The taste is terrible, but I guess that is how pure grape ...", "body": "The taste is terrible, but I guess that is how pure grape seed extract is supposed to taste.", "rating": "4"}, {"helpful": 0, "title": "Happy there were conversion measurements on the package label", "body": "Very impressed with quality. I had been  searching for grape seed powder. Happy there were conversion measurements  on the package label.  I will buy from BulkSupplement again.", "rating": "5"}, {"helpful": 6, "title": "Amazing Stuff!!", "body": "This grapeseed extract is amazing stuff! All my adult life I've had what appears to be bruising on the backs of both hands. It's actually tiny vessels that are easily bruised and rupture. I've been taking Bulk Supplements Grapeseed Extract for about six weeks and the bruising is gone! If the extract is strengthening these tiny vessels it's good to know that it's a positive benefit for all my circulatory system. I will use this specific product from now on!", "rating": "5"}, {"helpful": 2, "title": "Excellent Product from Great Company", "body": "Excellent product and seems to be pure.  Improved libido for a very reasonable price.  Can't comment on increased testosterone though, as I didn't use blood work for a baseline (libido and testosterone are related but not cause/effect).  Customer service from this company is phenomenal as well.  Highly recommend.", "rating": "5"}, {"helpful": 1, "title": "Excellent super-antioxidant!", "body": "After googling GSE and reading the positive reviews on this super antioxidant for humans as well as horses, I ordered 500 gm pkg from BulkSupplements. It already seems to be relieving my springtime allergy symptoms and strengthening my immune system.  I first purchased GSE through a horse catalog a year ago as a supplement along with other nutracils,  for my 9-year-old gelding, as a top-dress with his feed daily, as he has exhibited heaves-type cough and wheeze in the past. My boy has been sound without any cough or wheeze at all since starting the regimen so I know it works for him!", "rating": "5"}, {"helpful": 0, "title": "All around great supplement", "body": "I thought I would try grape seed extract after reading of the health benefits: \"they’re rich in antioxidants and polyphenols, such as the testosterone boosting and estrogen blocking resveratrol\".  Like many supplements, this is going to take a while to know the true impact, and I also take other supplements as well.  Still, I am impressed with the value the Bulk Supplements provides, and the quality seems reasonable.  I mix it in with my morning protein shake.  It is a little tricky measuring - the smallest measuring spoon I have is 1/8 tsp.  But I have been trying 1/16 tsp, which is basically half of the measure that I have.  All in all seems to be a supplement worth adding, and Bulk Supplements makes the price easy to give it a try.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "This product seems very strong and pure.", "rating": "5"}, {"helpful": 1, "title": "Increased concentration, focus, and energy", "body": "The pure Grape Seed Extract Powder has really improved my concentration through out the day.  I take 1/8 - 1/16 tsp in the morning on an empty stomach and have seen dramatic improvement in my morning meditations and work output during the work day.  The taste is very bitter, but when diluted in a liter of water it is palatable.", "rating": "4"}, {"helpful": 0, "title": "Excellent but very harsh taste, you should get a capsule maker and make GSE capsules.", "body": "Great product for lowering blood pressure.  Just recently added it to my supplements for cycling performance.  It tastes really bad, you won't want to be dissolving this and chucking it down.  It's very harsh.  You might want to invest in an inexpensive $20 capsule maker and load up a supply of capsule-form GSE.  GSE doesn't appear to require interaction with bacteria in the mouth the same way that beet root extract does.  So do yourself a favor and just make your own capsules and save yourself alot of misery.", "rating": "5"}, {"helpful": 0, "title": "Another great product from BulkSupplements", "body": "I have been very pleased with the quality and affordability of the products from Bulk Supplements. Their shipping times are always fast, their packaging clean and efficient.  It's nice to be able to afford quality supplements at a fraction of the cost in the health food stores.  I am very pleased with this Pure Grape Seed Extract.  It is a wonderful supplement to help lower blood pressure and even aids in the treatment of cancer.  It helps protect healthy cells from the effects of chemotherapy. You can mix it with water or juice or put it in capsules.  1/16 of a teaspoon is approximately 200MG.  Buy with confidence.", "rating": "5"}, {"helpful": 0, "title": "My new go-to product", "body": "BulkSupplements delivers in a timely manner and the packaging is great.  As for the Grape Seed Capsules, I have more energy since I have been using the product.  I am allergic to many fillers and I sense no side effects from these capsules.  Great product. I will definitely buy more after I run out of this badge, which will be well before the expiration date in two years.", "rating": "5"}, {"helpful": 1, "title": "Another nice powdered extract", "body": "This powdered extract is finely milled and of uniform consistency. It goes into solution easily and does not clump. This is my second product made by Bulk Supplements that I have tried and is another quality product.  The manufacturing processes are apparently well controlled resulting in a nice extract powder.  I will purchase again.", "rating": "5"}, {"helpful": 1, "title": "I am very happy that I can purchase just the powder", "body": "The reason I purchase Bulk Supplements is to avoid all the fillers that are put in the capsules.  Almost every vitamin, herb and mineral I have previous purchased has magnesium stearate in it.  I am very happy that I can purchase just the powder.  I put it in my smoothie every morning and don't have to swallow a large amount of pills.", "rating": "5"}, {"helpful": 0, "title": "Great suppliment, could use a better container.", "body": "The supplement is great, the bag it is in - not so much. It has a closing seal built into the bag, mine didn't work that well. I keep the open product in the refrigerator so I put it in a different container that works better there. Not a big deal.", "rating": "4"}, {"helpful": 1, "title": "Welcome the taste!", "body": "I purchased this bulk product to replace daily capsules. I expected that I'd have to also buy a capsule kit due to avoid the taste. At first I tried folding each dose into a bite of food, which worked. Now after several months I just toss it into my mouth before taking another bite or drink during a meal, it's welcome knowing the benefits. ", "rating": "5"}, {"helpful": 0, "title": "Grape Seed Extract - A Powerful Supplement.", "body": "A study done at the University of Maryland indicated that grape seed extract substantially increased blood levels of antioxidants. Antioxidants are the substances that protect cells from damage and may help prevent many diseases.", "rating": "4"}, {"helpful": 2, "title": "red wine or gse from bulksupplements for life!", "body": "After hearing & reading such good things about grape seed extract, I've decided to add it to my diet. I once knew an eldery gentleman, my grocer, (born in Italy) who claimed he was born in a hard winter following the death of his father. His mother was unable to nurse him, so instead gave him wine dribbled from bread. Maybe he was pulling my leg, but he was a robust & handsome man in his 80's. He drank red wine every day of his life. I hope this GSE will help me catch up. Bulksupplements for life!", "rating": "5"}, {"helpful": 0, "title": "Nice stuff. Not as easy to take as a ...", "body": "Nice stuff. Not as easy to take as a capsule but I mix it with soft food and it's not a problem. I transferred powder to a glass container. Easier", "rating": "4"}, {"helpful": 7, "title": "I believe the stuff might be beneficial.", "body": "I bought this product as an experiment because of my severe congestive heart failure, 10% ejection or thereabouts.  I'm willing to try anything to improve my endurance, breathing, etc.  This product was delivered in a timely manner and is precisely as described in the ad.  I've taken it a couple of weeks now and anything positive I say should be taken with a grain of salt-substitute because I began taking taurine and a couple of other supplements recently, as well.  But within a week I found I could do physical activities that would have been out of the question previously.  I'd recommend the product to anyone who believes in experimenting instead of believing everything medical doctors profess.  I didn't have to get anything cut off, didn't get poked with needles and the defibrillator kept on ticking.", "rating": "5"}, {"helpful": 5, "title": "This is an excellent product", "body": "My husband had taken grape seed extract for years in order to reduce recovery times and relieve soreness from workouts and extended hiking sessions, but had been told by a physician to stop.  He is now afflicted with severe arthritis and heart disease and wanted to use it again, and opted to try the Bulk Supplements product.  He consulted with his current physician and pharmacist before taking it, and was told that he needed to pay close attention to his INR levels because grape seed extract has been known to elevate them, but otherwise it would be safe for him to begin using it again.", "rating": "5"}, {"helpful": 0, "title": "The results are worth the taste.", "body": "Quite the Bitter flavor, it really does taste like when you eat a grape seed. I have not been taking it long enough for any results but I think that all will be well if I continue to take it. I take this like I take Rhodiola a little under the tongue and hold for 30 to 40 seconds then swallow and drink something quickly behind it. I do this because mixing it with a drink or other liquids is not easy and it changes the taste in a negative way, this way I get it down and am done with it in 30 seconds rather than drinking it in a smoothie or tea  for an extended period.", "rating": "4"}, {"helpful": 1, "title": "BulkSupplements Pure Grape Seed Extract Powder...", "body": "Happy with product after some difficulty opening packet first time (lesson learned).  Very fine powder was above the seal line when opened, was a little messy.  Will make sure all powder is below the seal line before making cut to open when I purchase next time.", "rating": "4"}, {"helpful": 0, "title": "Recommend", "body": "Exactly what we needed at a great price.  Easy open package.", "rating": "5"}, {"helpful": 0, "title": "Nothing yet", "body": "Just started using it last week. So far I can not tell any improvement yet.", "rating": "3"}, {"helpful": 1, "title": "I have a dog who needs to be on supplements ...", "body": "I have a dog who needs to be on supplements. He has many allergies and using supplements that are pure and without additives are a necessity. The prices very  reasonable for the amount that you get.", "rating": "5"}, {"helpful": 1, "title": "Great Experience with BulkSupplements", "body": "I empty the content of the capsules in my bulletproof coffee or smoothie every morning - I appreciate the benefits of the antioxidants...It has been easy to work with the company and to have questions answered...Good experience with BulkSupplements!", "rating": "5"}, {"helpful": 1, "title": "Best possible product for the price!", "body": "This is the real deal. I don't mind capping my own stuff so Bulk Supplements is like a dream come true for me.  This is the same quality extract that you buy already capped but for pennies on the dollar!  I was impressed by the quality of this extract.  It came in a durable, sealed bag.  I will be ordering more of this product as well as one or two other products they offer.  Bulk Supplements is my new favorite supplier.", "rating": "5"}, {"helpful": 1, "title": "The taste is horrible!!", "body": "The taste is horrible!!! So far the best thing to mask the bitter flavor has been peanut butter. I made low carb peanut butter balls dipped in chocolate and added about a tsp to the peanut butter fudge center. In that a tiny bit I cannot tell is there, hopefully this is as good for you as its touted to be!!!", "rating": "3"}, {"helpful": 0, "title": "Great product, as always", "body": "BulkSupplements has the best price for all great products that are very expensive when they are sold by other companies in pill-form. Only down side is the lack of measuring devices, especially for Grape Seed Extract that has a very small recommended dose.", "rating": "5"}, {"helpful": 4, "title": "5 stars earned", "body": "I haven't long been taking Grape Seed Extract, but few weeks ago I started taking it in pill form for inflammatory issues. It takes a while to notice improvement with any type of supplement or medicine in general, but before I ran out of the first bottle of pills I had , I wanted to order more and found this seller during my search for a better price. I like the fact that it's uncut - that when you order the supplement , there are no fillers. I like the fact that it's bulk, which means you get a lot more of the supplement itself.", "rating": "5"}, {"helpful": 0, "title": "Strong antioxidant....", "body": "I was looking for a replacement for resveratrol and pycnogenol. I decided to order this as it has similar benefits. It seems to be nearly identical to pycnogenol in its actives and much more affordable. This is a DARK brick red powder. It is potent, much more so than a capsuled brand I opened up and compared. It is astringent, but works in dark fruit smoothies. I transferred the powder to a jar as it will adhere to your hands if you reach into the bag with your measuring spoon. Gram for gram, a super deal.", "rating": "5"}, {"helpful": 0, "title": "Whoa", "body": "Outstanding product! I noticed a huge impact on my daily activities and I have to say that this particular product in a side by side comparison I way better than any competitor I have used to date. Going to stick with Bulk Supp's for all of my purchases from now on. The price is 9/10 better and the quality is unmatched.", "rating": "5"}, {"helpful": 0, "title": "Great quality", "body": "I bought this after reading reviews for other grape seed products that said they were moldy inside when they opened the capsules. Putting these into my own capsules is a pain, but it's worth it for being able to see, smell and taste the quality from this company. I bought it to see if it could help reduce my blood pressure. I have been happy with the results so far but I haven't been taking it very long.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "They are the best. Arrived early and sealed properly.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Helps with circulation...", "rating": "5"}, {"helpful": 0, "title": "Bitter and Healthy Good", "body": "I purchased Pure Grape Seed Extract for my diabetes and occasional diabetic pain in my feets and hands . The health benefits are the same as eating natural grapes.  For now, I'm not having diabetic pain. Due to the bitter taste I use some sweet Thai cimmimon with it in a bowl of Honey Nut Cheerio which works for me.", "rating": "5"}, {"helpful": 0, "title": "Pure is best", "body": "This is just another product that I have found to be tantamount to superior....keep up the great products and I'm hoping that I will again find (magnesium-l-theronate) on this site", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "ok", "rating": "5"}, {"helpful": 1, "title": "product exactly as described- smells and tastes surprisingly good! A happy buyer", "body": "quick shipping; product exactly as described-  smells and tastes surprisingly good!  A happy buyer!", "rating": "5"}, {"helpful": 0, "title": "Like the product and that it may have even higher ...", "body": "Seems almost the same substance as the pine bark extract I'd gotten from another company before.  Didn't realize they were so similar.. Would be hard to tell anything apart about them.  Like the product and that it may have even higher percentage of the good antioxidants in the grape seed than what pine bark does, while being a bit lower in price.", "rating": "5"}, {"helpful": 0, "title": "Not As Bad Tasting As Some Reviews", "body": "113-5817866-2135439", "rating": "4"}, {"helpful": 4, "title": "Product expired", "body": "product is set to expire on 4/2015", "rating": "1"}, {"helpful": 1, "title": "Grape Seed Powder great in smoothies", "body": "As usual, the BulkSupplements packaging is very good: light proof, re-sealable, compact.  The powder itself is very fine and has a subtle astringent aroma which is very pleasant.  I only need to use about 1/16 of a teaspoon in my smoothie and it blends well with the rest of the ingredients.", "rating": "5"}, {"helpful": 4, "title": "Product expired", "body": "product is set to expire on 4/2015", "rating": "1"}, {"helpful": 1, "title": "Great Experience with BulkSupplements", "body": "I empty the content of the capsules in my bulletproof coffee or smoothie every morning - I appreciate the benefits of the antioxidants...It has been easy to work with the company and to have questions answered...Good experience with BulkSupplements!", "rating": "5"}, {"helpful": 1, "title": "So far, so good.", "body": "I use grape seed extract to staunch my monthly visitor. This product seems to work just as well as the expensive caps from the store. It is very bitter and doesn't mix into drinks very well so I sprinkle the tiny daily dose on my sprouted grain organic butter ceylon cinnamon toast. Don't even notice it.", "rating": "5"}, {"helpful": 1, "title": "The taste is horrible!!", "body": "The taste is horrible!!! So far the best thing to mask the bitter flavor has been peanut butter. I made low carb peanut butter balls dipped in chocolate and added about a tsp to the peanut butter fudge center. In that a tiny bit I cannot tell is there, hopefully this is as good for you as its touted to be!!!", "rating": "3"}, {"helpful": 1, "title": "Best possible product for the price!", "body": "This is the real deal. I don't mind capping my own stuff so Bulk Supplements is like a dream come true for me.  This is the same quality extract that you buy already capped but for pennies on the dollar!  I was impressed by the quality of this extract.  It came in a durable, sealed bag.  I will be ordering more of this product as well as one or two other products they offer.  Bulk Supplements is my new favorite supplier.", "rating": "5"}, {"helpful": 1, "title": "5 Stars", "body": "I bought this product for addressing circulation and mood issues. When I take this product my circulation and mood both improve. I like that it is only one ingredient and is bioavailable.  Excellent product!", "rating": "5"}, {"helpful": 0, "title": "Nice stuff. Not as easy to take as a ...", "body": "Nice stuff. Not as easy to take as a capsule but I mix it with soft food and it's not a problem. I transferred powder to a glass container. Easier", "rating": "4"}, {"helpful": 0, "title": "Good deal but some drawbacks", "body": "First the positive points. Service was outstanding. I received my order quickly and accurately. They responded to my subsequent email in a very timely manner. I received both the grape seed extract and DHEA. As far as the DHEA, I've have definitely noticed \"testosterone improvement \" effects. For example I experienced an improved mood and more energy. Could this be purely psychological? Perhaps but it worked for me. Also, buying in bulk really makes it cost effective. The negatives. Buying in bulk means you have to measure out each dose. In the case of the DHEA that means purchasing a scale. You have to be careful not to take too much so accurately measuring the dose is essential. The starting dose for DHEA is a very small amount of the powder. A bit of a hassle but overall worth it.", "rating": "4"}, {"helpful": 0, "title": "Excellent but very harsh taste, you should get a capsule maker and make GSE capsules.", "body": "Great product for lowering blood pressure.  Just recently added it to my supplements for cycling performance.  It tastes really bad, you won't want to be dissolving this and chucking it down.  It's very harsh.  You might want to invest in an inexpensive $20 capsule maker and load up a supply of capsule-form GSE.  GSE doesn't appear to require interaction with bacteria in the mouth the same way that beet root extract does.  So do yourself a favor and just make your own capsules and save yourself alot of misery.", "rating": "5"}, {"helpful": 1, "title": "Grape Seed Powder great in smoothies", "body": "As usual, the BulkSupplements packaging is very good: light proof, re-sealable, compact.  The powder itself is very fine and has a subtle astringent aroma which is very pleasant.  I only need to use about 1/16 of a teaspoon in my smoothie and it blends well with the rest of the ingredients.", "rating": "5"}, {"helpful": 1, "title": "Great price, fast shipping", "body": "Seems like a quality product. I bought it because it is reported to be a highly potent antioxidant that reduces inflammation and protects the body against free radical damage.  Too soon to tell if it is effective as I've only been taking it for a week.  I mix it with yogurt or cottage cheese and the taste is tolerable.", "rating": "5"}, {"helpful": 1, "title": "Appears to be Great Quality", "body": "Haven't been taking this Grape Seed Extract Long enough to notice much of a difference.  It does clump up if added straight to liquid.  Better to use in a smoothie or something that gets mixed up very well.  Don't try taking it by itself if you don't like putrid tasting stuff.  This will certainly give you the \"ol' cough syrup head shake\"!", "rating": "4"}, {"helpful": 1, "title": "Good price!", "body": "I can't tell yet if this is working for our intended purposes, but I like that it was a good price!  It is very distasteful (bitter) even when mixed with honey, so I put some in capsules tonight so that my husband will take it.", "rating": "4"}, {"helpful": 0, "title": "Another great product from BulkSupplements", "body": "I have been very pleased with the quality and affordability of the products from Bulk Supplements. Their shipping times are always fast, their packaging clean and efficient.  It's nice to be able to afford quality supplements at a fraction of the cost in the health food stores.  I am very pleased with this Pure Grape Seed Extract.  It is a wonderful supplement to help lower blood pressure and even aids in the treatment of cancer.  It helps protect healthy cells from the effects of chemotherapy. You can mix it with water or juice or put it in capsules.  1/16 of a teaspoon is approximately 200MG.  Buy with confidence.", "rating": "5"}, {"helpful": 0, "title": "I've only been taking the supplement for about a week ...", "body": "I've only been taking the supplement for about a week so it's too early to review. My only complaint and reason for 3 stars is that several capsules were broken and grape seed extract is all over everything.", "rating": "3"}, {"helpful": 1, "title": "... noticed about this supplement was the nasty taste and poor mixability. I purchased this product because of purported ...", "body": "The first thing I noticed about this supplement was the nasty taste and poor mixability.  I purchased this product because of purported antioxidant qualities.  I will give it some more time, but may have to try the capsule form in the future.", "rating": "3"}, {"helpful": 0, "title": "Bitter and Healthy Good", "body": "I purchased Pure Grape Seed Extract for my diabetes and occasional diabetic pain in my feets and hands . The health benefits are the same as eating natural grapes.  For now, I'm not having diabetic pain. Due to the bitter taste I use some sweet Thai cimmimon with it in a bowl of Honey Nut Cheerio which works for me.", "rating": "5"}, {"helpful": 0, "title": "Great product, as always", "body": "BulkSupplements has the best price for all great products that are very expensive when they are sold by other companies in pill-form. Only down side is the lack of measuring devices, especially for Grape Seed Extract that has a very small recommended dose.", "rating": "5"}, {"helpful": 0, "title": "All around great supplement", "body": "I thought I would try grape seed extract after reading of the health benefits: \"they’re rich in antioxidants and polyphenols, such as the testosterone boosting and estrogen blocking resveratrol\".  Like many supplements, this is going to take a while to know the true impact, and I also take other supplements as well.  Still, I am impressed with the value the Bulk Supplements provides, and the quality seems reasonable.  I mix it in with my morning protein shake.  It is a little tricky measuring - the smallest measuring spoon I have is 1/8 tsp.  But I have been trying 1/16 tsp, which is basically half of the measure that I have.  All in all seems to be a supplement worth adding, and Bulk Supplements makes the price easy to give it a try.", "rating": "5"}, {"helpful": 1, "title": "Pure and Effective", "body": "This product seems pure and effective.  I use it as part of a smoothie I make every morning that includes a number of other BulkSupplement powders that are mixed with organic fruits, protein and almond milk.", "rating": "5"}, {"helpful": 1, "title": "Great buy in bulk", "body": "Great buy in bulk. I read other reviews saying it clumps in water. Not true for me it dissolves quite well and easy to take. Great in smoothies also. This will take a long time to use but will buy again.", "rating": "5"}, {"helpful": 1, "title": "Easy and quick", "body": "Grapeseed extract is super effective but I had been frustrated by buying it in capsule form (the powder leaks from many of them). Now I can add the powder to my shake in a cost effective manner. Thanks, BulkSupplements :)", "rating": "5"}, {"helpful": 0, "title": "Like the product and that it may have even higher ...", "body": "Seems almost the same substance as the pine bark extract I'd gotten from another company before.  Didn't realize they were so similar.. Would be hard to tell anything apart about them.  Like the product and that it may have even higher percentage of the good antioxidants in the grape seed than what pine bark does, while being a bit lower in price.", "rating": "5"}, {"helpful": 0, "title": "Grape Seed Extract - A Powerful Supplement.", "body": "A study done at the University of Maryland indicated that grape seed extract substantially increased blood levels of antioxidants. Antioxidants are the substances that protect cells from damage and may help prevent many diseases.", "rating": "4"}, {"helpful": 0, "title": "Great quality", "body": "I bought this after reading reviews for other grape seed products that said they were moldy inside when they opened the capsules. Putting these into my own capsules is a pain, but it's worth it for being able to see, smell and taste the quality from this company. I bought it to see if it could help reduce my blood pressure. I have been happy with the results so far but I haven't been taking it very long.", "rating": "5"}, {"helpful": 0, "title": "The results are worth the taste.", "body": "Quite the Bitter flavor, it really does taste like when you eat a grape seed. I have not been taking it long enough for any results but I think that all will be well if I continue to take it. I take this like I take Rhodiola a little under the tongue and hold for 30 to 40 seconds then swallow and drink something quickly behind it. I do this because mixing it with a drink or other liquids is not easy and it changes the taste in a negative way, this way I get it down and am done with it in 30 seconds rather than drinking it in a smoothie or tea  for an extended period.", "rating": "4"}, {"helpful": 0, "title": "Great Products all the way around!", "body": "This product is very good. I've been adding it to my morning shake for a while now. I like the fact that it is pure with no binders and I don't have to put it  in capsules.", "rating": "5"}, {"helpful": 0, "title": "the product arrived on time and in good condition. It is a dark purple powder tastes ...", "body": "the product arrived on time and in good condition.  It is a dark purple powder tastes very bitter.  even after I put it in hot tea it still has quite a bitter taste. maybe I use too much or the bitter taste is what makes it so beneficial.  Will try to find the best way to use it.", "rating": "4"}, {"helpful": 0, "title": "Feel great!", "body": "i really like this supplement, feel a lot better & not so sluggish, I got the pills instead of the powder, easy2 take with whatever your drinking, if u have problems with inflammation I wud recommend you get this product, not very pricy either=)", "rating": "5"}, {"helpful": 0, "title": "Not As Bad Tasting As Some Reviews", "body": "113-5817866-2135439", "rating": "4"}, {"helpful": 0, "title": "great for blood sugar levels and memory booster", "body": "great for blood sugar levels and memory booster.  i will keep on using this product to maintain healthy levels of both.  cant beat bulk supplements prices and service.  best around.", "rating": "5"}, {"helpful": 7, "title": "Excelent product", "body": "I have been using different Bulk Supplements products with good results and the best price. As for Grape Seed Extract, its antioxidant power is real and you can feel it. After I started using it, I noticed that my gray hair started to turn black again.", "rating": "5"}, {"helpful": 0, "title": "High Quality Product", "body": "I'm very pleased with the quality of the Pure Grape Seed Extract Powder from BulkSupplements. I'm looking forward to seeing the results from this product!", "rating": "5"}, {"helpful": 0, "title": "Excellent as always", "body": "Still by far the best price and quality ANYWHERE on the internets!  And this stuff is such a pretty purple!  I just started using it so I'm not sure about the vasodilator effects yet, but initial results look promising!", "rating": "5"}, {"helpful": 0, "title": "Very Pleased.", "body": "Very fast shipping. Product as described. Very Pleased.", "rating": "5"}, {"helpful": 0, "title": "Great for dry skin and hair", "body": "This product is great; I used it in my smoothies and it blended perfectly compared to flexed. My drink was smooth and creamy.  I noticed a difference in my skin and hair after using it for two weeks. The taste isn't as strong as flaxseed.", "rating": "5"}, {"helpful": 1, "title": "Good price!", "body": "I can't tell yet if this is working for our intended purposes, but I like that it was a good price!  It is very distasteful (bitter) even when mixed with honey, so I put some in capsules tonight so that my husband will take it.", "rating": "4"}, {"helpful": 4, "title": "My naturalist recommended I take grape seed extract to help with my ...", "body": "My naturalist recommended I take grape seed extract to help with my horrible year round allergy's that conventional medicine doesn't do much for. I have only been taking this for a couple of weeks and have had a cold so I cannot yet comment on how well it is working for that. What I can tell you is this is a  much cheaper way to go than buying pre-made capsules. Be warned though it is messy reddish brown powder that likes to stick to everything and stains. DO NOT try to take by itself or mixed in water as I almost vomited from the bitter taste that sticks in your mouth. I have found putting 1/8th of a tsp (approx 300mg) in my morning yogurt or smoothie works best and I can no longer taste it then.  All in all its a good company, with a good clean product (no additives) at a great price!", "rating": "4"}, {"helpful": 1, "title": "Real", "body": "Potent, after 2 days seems promising.", "rating": "5"}, {"helpful": 0, "title": "Economical and offers good control over dosing", "body": "Excellent value. Good service and delivery. It's hard to report on quality itself, since supplement effects are subtle if they exist at all, and they take a long time to become evident. But I like that I can control dosing and am not paying for packaging and encapsulation, etc.", "rating": "4"}, {"helpful": 0, "title": "Helps with excitoxins", "body": "I have a leaky gut and a real problem with glutamic acid over exciting my brain and really messing up my sleep.  I learned that GSE could help control glutamate by protecting the glutamate receptopers and repair nerves in the brain.  Even after the first day I felt a difference.  Very happy to have found something to help.", "rating": "5"}, {"helpful": 0, "title": "Great addition to my smoothies", "body": "I add this powder (in small quantities as directed on the packaging) to my smoothies breakfast and lunch.  I'm very happy with the product.  It doesn't change the flavor or my smoothing (which is important to me).  This powder is a part of my overall efforts to eat healthy and boost the raw foods I eat with super food extracts.", "rating": "5"}, {"helpful": 0, "title": "Very bitter tasting", "body": "This grape seed powder tastes extremely bitter and nasty. Haven't noticed a difference in my blood sugars like I did taking the grape seed capsules. Not so sure this is the best way to get the greater affects of the grapeseed supplement", "rating": "3"}, {"helpful": 0, "title": "Great product, as expted Its a good extract with ...", "body": "Great product, as expected.", "rating": "5"}, {"helpful": 0, "title": "Excellent qualilty product", "body": "As with the other BulkSupplements products I have purchased (I've tried about six of them) I find them to be both of high quality and also an excellent value for the money. This product appears to be an excellent value and I highly recommend the brand/product.", "rating": "5"}, {"helpful": 2, "title": "Worth a try, but buy the smaller size.", "body": "I had never tried grape seed extract before, but have read about it's benefits as a supplement similar to the 'Fountain of Youth'. I mix the extract in smoothies, & so far so good. That is, as long as you use the recommended every other day dosing. Which is approximately 1/16 of a tsp (aka a 'pinch' will do, a dainty pinch). In hind site, I should have purchased the smaller sized bag. I can't imagine finishing this bag this year or next.", "rating": "5"}, {"helpful": 0, "title": "Economical and offers good control over dosing", "body": "Excellent value. Good service and delivery. It's hard to report on quality itself, since supplement effects are subtle if they exist at all, and they take a long time to become evident. But I like that I can control dosing and am not paying for packaging and encapsulation, etc.", "rating": "4"}, {"helpful": 0, "title": "Good to have", "body": "Seems good. Studies say it's good for many things. Supposed to be good for many things such as high content of antioxidants, lowers cholesterol, Just be careful if you have high blood pressure. Can't tell any immediate effects. Might have to be observed long term.", "rating": "5"}, {"helpful": 0, "title": "Pure powder perfect for adding to a smoothie", "body": "Nothing but pure grape seed extract powder.  Good packaging.  The picture on Amazon shows a different serving size.  My packaging shows a single serving is about 1/16 teaspoon.  Adding it to a 16 oz breakfast smoothie doesn't impact the taste.", "rating": "5"}, {"helpful": 0, "title": "Fast shipping, great color, pure!", "body": "Just received it, beautiful dark color.  I like that the product is pure and has no fillers.  I use the powder to fill capsules.  Not really a supplement you \"feel\" but I do find a slight improvement in concentration.", "rating": "4"}, {"helpful": 0, "title": "BulkSupplements Pure Grape Seed Extract Powder", "body": "This grapeseed extract was more potent than the product we have regularly used. It is used as an antioxidant in our family", "rating": "5"}, {"helpful": 1, "title": "Easy and quick", "body": "Grapeseed extract is super effective but I had been frustrated by buying it in capsule form (the powder leaks from many of them). Now I can add the powder to my shake in a cost effective manner. Thanks, BulkSupplements :)", "rating": "5"}, {"helpful": 0, "title": "Great", "body": "The packaging is nice and I've been using this in my smoothies for 3 days, seems to be working well", "rating": "5"}, {"helpful": 1, "title": "Pure and Effective", "body": "This product seems pure and effective.  I use it as part of a smoothie I make every morning that includes a number of other BulkSupplement powders that are mixed with organic fruits, protein and almond milk.", "rating": "5"}, {"helpful": 1, "title": "Great buy in bulk", "body": "Great buy in bulk. I read other reviews saying it clumps in water. Not true for me it dissolves quite well and easy to take. Great in smoothies also. This will take a long time to use but will buy again.", "rating": "5"}, {"helpful": 0, "title": "good price. Should last a while", "body": "Fast delivery, good price. Should last a while. Resealable package does not always close easily.", "rating": "4"}, {"helpful": 0, "title": "Happy with product and quick delivery", "body": "Quick delivery, carefully packaged in reseal packet. I  use it as an ingredient in a tasty drink to help reduce blood sugar.", "rating": "4"}, {"helpful": 0, "title": "Two Stars", "body": "Tried them in a health recipe and it was horrible....undrinkable.  Will not use them ever again I think.", "rating": "2"}, {"helpful": 0, "title": "Pure powder perfect for adding to a smoothie", "body": "Nothing but pure grape seed extract powder.  Good packaging.  The picture on Amazon shows a different serving size.  My packaging shows a single serving is about 1/16 teaspoon.  Adding it to a 16 oz breakfast smoothie doesn't impact the taste.", "rating": "5"}, {"helpful": 0, "title": "great quality! It's bitter when you mix it in ...", "body": "WOW! great quality! It's bitter when you mix it in water but I know it's good for me!", "rating": "5"}, {"helpful": 1, "title": "Switched to powder and won't buy pre-made capa again", "body": "I substituted this for the grape seed extract it was using from another company in pill form. The price is unbelievably better than buying capped. A capping machine is about $15 so I'm using that to make these. I see no difference in efficacy from the previous brand to this one. My cholesterol will be tested in May and I can update with specidic numbers then.", "rating": "4"}, {"helpful": 1, "title": "5 star no complaints", "body": "BulkSupplements is awesome super fast shipping!! As far as the grape seed extract I purchased it to use as an antioxidant which I feel is working. The weather here is getting colder & people are getting sick especially those taking flu shots smh. To prevent that im doing what I can naturally. As far as the taste ive read comments on I put them in capsules mixed w/ another herb so I cant chime in on that. Overall I feel that this is a great product & price from BulkSupplements will buy again when finished", "rating": "5"}, {"helpful": 1, "title": "Would buy again.", "body": "Great seller, happy with product but again, issues with the \"zip\" bag closure not working", "rating": "4"}, {"helpful": 1, "title": "One Star", "body": "I had terrible reaction to it (including vomiting). Be careful when you buy it!", "rating": "1"}, {"helpful": 1, "title": "Five Stars", "body": "I love the Product, It serves it purpose in my body. Thank You So Much!", "rating": "5"}, {"helpful": 0, "title": "Grape Seed extract for skin.", "body": "Bulk Supplements did give me a free product for my review. However I have no reason to not be honest in this review.", "rating": "4"}, {"helpful": 1, "title": "Four Stars", "body": "Got here fine. If it does what it is supposed to it will be great.", "rating": "4"}, {"helpful": 3, "title": "not because the product is not good, but I tried it one time", "body": "I am giving it 1 star, not because the product is not good, but I tried it one time, and I can take pretty much anything regardless the taste but after I took it within 5 minutes I had to vomit. yikes.....that was the first and last time I would ever take it :(", "rating": "1"}, {"helpful": 2, "title": "Works i Will say That", "body": "Ok, no i don't love it, I don't like taking anything, I hate pill, capsules, eye dopers, powders and what i hate worse than anything, is these dang pill the doctors want to throw at me to take. gee how dumb are sheep that trust there doctor when there life is at stake.Here i am and here's my story, if it helps so be it if you are another that doesn't have a ear to hear and an eye to see, so be that to. I don't mind hurting someone's feeling if its the truth. Look at us folks, in the last hundred yr's or so we were so strong healthy and proud our people didn't need these things we are taking. Why? What has Changed? We have, We forgot to do the right thing, violated the laws God, and nature, Six yr's we plant and one yr to rest the land. So what grew on the land when it rested? Weeds,,,, Weeds and More Weeds, hope you see my point here, And when planting season all these weeds got turned under to rot. Where do we get today most of our vitamins? Someone Smart is growing Weeds oh how we hate them in till our health starts falling apart. God said life is in the seed. Oh really? well funny thing that with todays crops try regrowing a seed from a GMO plant. plant grows with no fruit no seeds. Now me i have type 2 diabetes 60 Yrs of age, and iam not settling for this and with the help of the book {Let's Get Well By Adelle Davis also sold here on Amazon} I have already started seeing results in what i am now taking for this, Bulk Supplements Pure Grape seed and Pure Pine Bark Extract, Now Adam Superior Men's Multi, Now  Choline & Inositol, Now B 100, Now E 400, Now C 1000, Now A,, D 3, Hope you enjoyed this short story, don't make the doctor rich, do some home work, Search and you shall find, Knock and the door will be opened. This review will be posted on other reviews of Mentioned vitamins above, hope this helps, have lost average of 50 points on morning readings", "rating": "5"}, {"helpful": 0, "title": "Great product for good price", "body": "My dad was having bad sciatica pains and could barely walk because of it.  Some people had told me about gse for relieving the inflammation so I did some research on it.  I found it was much cheaper and I could get more by just buying it in bulk so I ordered from bulk supplements and got it in a few days.  Within a few days of taking it my dad was walking without a cane and back to work.  Praise God for such a simple remedy!", "rating": "5"}, {"helpful": 2, "title": "The product itself is a rather fine powder the color of rust or terracotta with a ...", "body": "The product was shipped promptly and is well packaged in a plastic/foil resealable bag. The information on the label is clear and concise, though possibly a bit scant for a consumer  who might wish to drill down a bit more on the product, as there is no  mention of country of origin or method of extraction, the latter of which can influence the procyanidin polymerization profile and thus bioactivity / bioavailability. The label on my shipment states that it expires six months from now. Unfortunately, given that it holds 1250 single servings, if I take it once a day or every other day as advised it would last me between three and six years, well beyond its expiration.", "rating": "4"}, {"helpful": 1, "title": "Real", "body": "Potent, after 2 days seems promising.", "rating": "5"}, {"helpful": 0, "title": "BulkSupplements is my preferred brand for supplement and this grapeseed extract seems to be of very good quality.", "body": "I purchase a lot of bulk supplements here on Amazon and BulkSupplements is my favorite brand. There prices are always among the best here on Amazon and all of their products I have tried including this grape extract powder to be of good quality and I have never found any foreign matter in the bag as I have with some of the other brands. The bags are also strong and easy to reseal unlike some of the other brands which I often must reseal with clips and have also arrived with tears and holes.", "rating": "5"}, {"helpful": 0, "title": "great for blood sugar levels and memory booster", "body": "great for blood sugar levels and memory booster.  i will keep on using this product to maintain healthy levels of both.  cant beat bulk supplements prices and service.  best around.", "rating": "5"}, {"helpful": 0, "title": "But the product itself is great.", "body": "I think that they should just put one bag in the picture. I shouldn't probably do this, but I go off of photos. I was expecting a bigger bag. But the product itself is great.", "rating": "4"}, {"helpful": 0, "title": "It's very good quality powder and packaged very nicely so that the ...", "body": "It's very good quality powder and packaged very nicely so that the bag recloses.  My husband is using it in his smoothie every morning.  It helps with glaucoma.", "rating": "5"}, {"helpful": 0, "title": "High Quality Product", "body": "I'm very pleased with the quality of the Pure Grape Seed Extract Powder from BulkSupplements. I'm looking forward to seeing the results from this product!", "rating": "5"}, {"helpful": 0, "title": "Grape Extract - a great alternative to grapes in a shake blend", "body": "Adds a pleasant taste.. I have just started using this with my daily shake instead of grapes... will keep this review update over the course of a month", "rating": "5"}, {"helpful": 0, "title": "Mixes well with everything", "body": "I was excited ti get this product with the great reviews I have seen. In my estimation, the quality is excellent and it mixes well with everything.", "rating": "5"}, {"helpful": 0, "title": "Love ordering from bulk supplements", "body": "Love ordering from bulk supplements. The product always arrives fast and the variety is vast. The quality is high and the products deliver results.", "rating": "5"}, {"helpful": 0, "title": "Highly Recomend", "body": "Great phigh quality product.  I'm very happy with this compared to our last purchase of grape seed extract from another company.  Highly recomend.", "rating": "5"}, {"helpful": 0, "title": "Love love this product", "body": "Love love this product. I take half spoon dissolved in water in the morning and half spoon in the evening!! It gives so much energy. I feel energized after taking this product.  It tastes a little bitter, but it is worth ....", "rating": "5"}, {"helpful": 2, "title": "Five Stars", "body": "Fast shipping & great product. I will definitely be buying from Bulk Supplements in the future!", "rating": "5"}, {"helpful": 0, "title": "or the taste is horrible. Very effective as a workout supplement", "body": "Almost immediate extra energy.  Take mixed in with food, coffee, etc. or the taste is horrible.  Very effective as a workout supplement.", "rating": "5"}, {"helpful": 0, "title": "It is so nice to get a pure product like this", "body": "It is so nice to get a pure product like this, and shipped so quickly.  The prices are fabulous.  I won't buy from any other!!  Love!", "rating": "5"}, {"helpful": 0, "title": "Very fine bitter powder", "body": "I should have purchased the capsules.  Very fine bitter powder.  Saves $$ in bulk if you can the taste.  Using fruit & yogurt helps.", "rating": "4"}, {"helpful": 0, "title": "Satisfied with it", "body": "I liked this product despite not noticed it's effect on hypertension but as an antioxident I think it is a good and cheap source .", "rating": "5"}, {"helpful": 0, "title": "BULK MADE EASY", "body": "ORDER RECEIVED AS PROMISED. INSTRUCTIONS ON LABEL ARE VERY CLEAR IN RESPECT TO MEASUREMENT/DOSAGE.  PRODUCT CLEAN AND PACKED WELL.", "rating": "5"}, {"helpful": 0, "title": "High Quality Supplement", "body": "Fine quality grape seed powder - it is bitter, it doesn't mix easily but that can be expected and it is extremely effective.", "rating": "5"}, {"helpful": 0, "title": "Happy with product and quick delivery", "body": "Quick delivery, carefully packaged in reseal packet. I  use it as an ingredient in a tasty drink to help reduce blood sugar.", "rating": "4"}, {"helpful": 0, "title": "Fast shipment, high quality product", "body": "Product shipped promptly, appears to be of highest quality!  Looking forward to trying other products from Bulk Supplements.", "rating": "5"}, {"helpful": 0, "title": "BulkSupplements Pure Grape Seed Extract Powder", "body": "This grapeseed extract was more potent than the product we have regularly used. It is used as an antioxidant in our family", "rating": "5"}, {"helpful": 0, "title": "The product works and is very pure but tastes horrible! If you wanted something that tastes good eat ...", "body": "The product works and is very pure but tastes horrible!  If you wanted something that tastes good eat a spoonful of sugar.", "rating": "4"}, {"helpful": 0, "title": "I think these products are a great deal. I saved alot of money using bulksupplements ...", "body": "I think these products are a great deal.  I saved alot of money using bulksupplements and they are high quality as well!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Quality product with a fair price. Fast delivery. Will purchase more from bulk supplements in the near future", "rating": "5"}, {"helpful": 0, "title": "Excellent value!", "body": "I always give 5 stars to these guys! Great products & prices! I love 'em and will continue to buy from them.", "rating": "5"}, {"helpful": 0, "title": "Cost-effective quality supplement", "body": "An excellent and cost-effective way to get this very beneficial antioxidant supplement. I have been taking it for a week now and am well pleased. I would recommend that one purchase the mini measuring spoons (available in a few styles from several vendors here on Amazon for cheap) in order to measure out the recommended dosages. I simply add this to my daily smoothie and it blends in nicely.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I add it to some mashed banana or peanut butter with some cinnamon!  Works great to mask the bitter taste!", "rating": "5"}, {"helpful": 0, "title": "Grape seed extract", "body": "Liked the way the product was packaged and the fact I could get it in a powder form rather than capsules.", "rating": "5"}, {"helpful": 0, "title": "Two Stars", "body": "Tried them in a health recipe and it was horrible....undrinkable.  Will not use them ever again I think.", "rating": "2"}, {"helpful": 0, "title": "I put it in my oatmeal", "body": "I have been taking this for over a month now.  So far so good.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "I add it to some mashed banana or peanut butter with some cinnamon!  Works great to mask the bitter taste!", "rating": "5"}, {"helpful": 0, "title": "Quality and price cannot be beat", "body": "as with all of the products from Bulk Supplements, I have been impressed with this one as well.", "rating": "5"}, {"helpful": 0, "title": "Three Stars", "body": "ok but very bitter would suggest capsule form", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "Really good product", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "Good product, but very hard to mix.", "rating": "2"}, {"helpful": 0, "title": "Great detoxifier.", "body": "It's exactly what you ask for. Pure simple extract powder no additional ingredients. Great detoxifier.", "rating": "5"}, {"helpful": 0, "title": "The product works and is very pure but tastes horrible! If you wanted something that tastes good eat ...", "body": "The product works and is very pure but tastes horrible!  If you wanted something that tastes good eat a spoonful of sugar.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "Great supplment", "rating": "5"}, {"helpful": 0, "title": "I use it to get better!", "body": "Very good item", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "fine powder. i mix a small amount into protein shakes. ordered another bag for family.", "rating": "5"}, {"helpful": 0, "title": "Besides that as long as it does its job I am happy.", "body": "It does not mix AT ALL in liquids. Besides that as long as it does its job I am happy.", "rating": "4"}, {"helpful": 0, "title": "great quality! It's bitter when you mix it in ...", "body": "WOW! great quality! It's bitter when you mix it in water but I know it's good for me!", "rating": "5"}, {"helpful": 0, "title": "nice product, good company", "body": "fast shipping, nice product, good company, will do business again, highly recommended", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "I love the product it is fresh and the company has awesome customer service as well.", "rating": "5"}, {"helpful": 0, "title": "great price and should last a long at the dosage ...", "body": "hard to find on open mkt.  great price and should last a long at the dosage I need.", "rating": "5"}, {"helpful": 0, "title": "5 Stars", "body": "I am trying all most all of the products from BulkSupplements.. so far so good", "rating": "5"}, {"helpful": 0, "title": "Ok", "body": "Only used for a few days. Nothing noticable yet. Will stay on for a few weeks.", "rating": "2"}, {"helpful": 0, "title": "Great Bulk Supplement", "body": "Great way to get Grape Seed Extract. Great to mix in with your daily smoothie.", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "Thank you", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "fine powder mixes well in a smoothie, and a small amount goes a  long way", "rating": "5"}, {"helpful": 0, "title": "Good stuff!", "body": "Quality and quantity at such a great price! What more could you ask for!?", "rating": "5"}, {"helpful": 0, "title": "a bit bitter but easy to dissolve into fruit juice", "body": "It's the real thing, a bit bitter but easy to dissolve into fruit juice.", "rating": "4"}, {"helpful": 0, "title": "The Best Grape Seed Extract in market", "body": "This is the best and the purest Grape Seed Extract that I've ever tried.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product - Good price - I mix with a protein drink - It mixes well", "rating": "5"}, {"helpful": 0, "title": "seems like the right stuff", "body": "very tart, seems like the right stuff, fast shipping, price was good.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Very good, pure, easy mix, exactly as advertised. Very satisfied!!!", "rating": "5"}, {"helpful": 0, "title": "I put it in my oatmeal", "body": "I have been taking this for over a month now.  So far so good.", "rating": "4"}, {"helpful": 0, "title": "Powerful antioxidant", "body": "Great antioxidant! A must for stacks.  Arrived pure and fast!", "rating": "5"}, {"helpful": 0, "title": "taste is bad.", "body": "I just started taking the product.If it has a benefit I would expect it to require at least several weeks if not months.The package is excellent and the delivery is first class.It does not taste good,but when in a smoothie it is more than tolerable.Certainly when the benefits come to fruition.", "rating": "5"}, {"helpful": 0, "title": "Excellent quality", "body": "Excellent quality Grape Seed Extract powder for the price.", "rating": "5"}, {"helpful": 0, "title": "Bad taste.", "body": "Need to encapsulate this due to taste. Generous amount.", "rating": "3"}, {"helpful": 0, "title": "well worth the money", "body": "It was a huge pouch that will last me for a long time.", "rating": "5"}, {"helpful": 0, "title": "great quality, unbeatable price", "body": "great quality , unbeatable price , highly recommended,", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "This works great in conjuction with the Almond butter", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Seems to be a good product and bulk is a good savings", "rating": "5"}, {"helpful": 0, "title": "Green Seed Extract powder", "body": "Good quality, purity, consistent with expectations.", "rating": "5"}, {"helpful": 0, "title": "Great product and a good value!", "body": "This is a great quality product and economical too!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product. I add this to my skin care products.", "rating": "5"}, {"helpful": 0, "title": "Great Product", "body": "This grape seed powder is perfect for my smoothies.", "rating": "5"}, {"helpful": 0, "title": "Good stuff!", "body": "Quality and quantity at such a great price! What more could you ask for!?", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good stuff, good price", "rating": "5"}, {"helpful": 0, "title": "Powerful antioxidant", "body": "Great antioxidant! A must for stacks.  Arrived pure and fast!", "rating": "5"}, {"helpful": 0, "title": "Great Product", "body": "This grape seed powder is perfect for my smoothies.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "FAST shipping and exactly as described.", "rating": "5"}, {"helpful": 0, "title": "Very happy with the service", "body": "Quick shipping, easy to take.", "rating": "5"}, {"helpful": 0, "title": "great quality, unbeatable price", "body": "great quality , unbeatable price , highly recommended,", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Very pleased...will purchase again!", "rating": "5"}, {"helpful": 0, "title": "Great Bulk Supplement", "body": "Great way to get Grape Seed Extract. Great to mix in with your daily smoothie.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great price and quick delivery", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "love it fast delivery", "rating": "5"}, {"helpful": 0, "title": "Grape Seed extract for skin.", "body": "Bulk Supplements did give me a free product for my review. However I have no reason to not be honest in this review.", "rating": "4"}, {"helpful": 0, "title": "Five Stars", "body": "fresh, pure,very effective", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "great product!", "rating": "4"}, {"helpful": 2, "title": "Worth a try, but buy the smaller size.", "body": "I had never tried grape seed extract before, but have read about it's benefits as a supplement similar to the 'Fountain of Youth'. I mix the extract in smoothies, & so far so good. That is, as long as you use the recommended every other day dosing. Which is approximately 1/16 of a tsp (aka a 'pinch' will do, a dainty pinch). In hind site, I should have purchased the smaller sized bag. I can't imagine finishing this bag this year or next.", "rating": "5"}, {"helpful": 1, "title": "I tried the whey protein supplement because I am looking ...", "body": "I tried the whey protein supplement because I am looking to build more muscle as well as lower my blood pressure.  I've tried the whey for about 14 days adding it to my smoothie breakfast drink.", "rating": "4"}, {"helpful": 1, "title": "Switched to powder and won't buy pre-made capa again", "body": "I substituted this for the grape seed extract it was using from another company in pill form. The price is unbelievably better than buying capped. A capping machine is about $15 so I'm using that to make these. I see no difference in efficacy from the previous brand to this one. My cholesterol will be tested in May and I can update with specidic numbers then.", "rating": "4"}, {"helpful": 1, "title": "5 star no complaints", "body": "BulkSupplements is awesome super fast shipping!! As far as the grape seed extract I purchased it to use as an antioxidant which I feel is working. The weather here is getting colder & people are getting sick especially those taking flu shots smh. To prevent that im doing what I can naturally. As far as the taste ive read comments on I put them in capsules mixed w/ another herb so I cant chime in on that. Overall I feel that this is a great product & price from BulkSupplements will buy again when finished", "rating": "5"}, {"helpful": 0, "title": "BulkSupplements is my preferred brand for supplement and this grapeseed extract seems to be of very good quality.", "body": "I purchase a lot of bulk supplements here on Amazon and BulkSupplements is my favorite brand. There prices are always among the best here on Amazon and all of their products I have tried including this grape extract powder to be of good quality and I have never found any foreign matter in the bag as I have with some of the other brands. The bags are also strong and easy to reseal unlike some of the other brands which I often must reseal with clips and have also arrived with tears and holes.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Really good product", "rating": "5"}, {"helpful": 1, "title": "Love the Concept", "body": "But in order to take the amount that I'm supposed to take, I need to locate a 1/64 teaspoon. Instead, I just put a titch on the end of a toothpick or knife edge and hope I'm getting what I need. Otherwise, it's great. It has a super strong flavor that tastes a bit like really strong, bitter black tea that has been boiled down to a syrup. It's not awful, but it's not nice either. Still...it's a much cheaper way to take grape seed extract than capsules.", "rating": "3"}, {"helpful": 0, "title": "Five Stars", "body": "Very nice product.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great supplment", "rating": "5"}, {"helpful": 1, "title": "Five Stars", "body": "I put these in my Smoothie every weekend to keep my body going", "rating": "5"}, {"helpful": 0, "title": "I use it to get better!", "body": "Very good item", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product.", "rating": "5"}, {"helpful": 0, "title": "Four Stars", "body": "great product!", "rating": "4"}, {"helpful": 0, "title": "Keep m the flu bugs away by building  your.immune system", "body": "Great product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great quality", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great product", "rating": "5"}, {"helpful": 0, "title": "healthy start", "body": "good product", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product", "rating": "5"}, {"helpful": 0, "title": "Yuk", "body": "From China", "rating": "1"}, {"helpful": 0, "title": "A+++", "body": "Great deal", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Love It", "rating": "5"}, {"helpful": 0, "title": "BulkSupplements Pure Grape Seed Extract Powder", "body": "Another great BulkSupplement I can add to my morning smoothie. Mixes well & tastes good.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "GREAT", "rating": "5"}, {"helpful": 0, "title": "Diet Plan Use", "body": "Good", "rating": "5"}, {"helpful": 0, "title": "So far only two dosages taken; but it blends ...", "body": "So far only two dosages taken; but it blends well with my protein drink. I expect to really see results after about 5 days of taking it daily", "rating": "4"}, {"helpful": 0, "title": "still not far enough along to make a good judgement on this", "body": "still not far enough along to make a good judgement on this.. taste isn't overpowering so I'm able to mix it in my pre-workout well enough.", "rating": "4"}, {"helpful": 0, "title": "IT'S OKAY BUT NOT FOR ME, TOO TART", "body": "THIS IS AN OKAY PRIDUCT BUT THE BUTTER TASTE OVER POWERS EVERYTHING YOU ADD IT TO.  I WILL NOT BE PURCHASING THIS AGAIN.", "rating": "3"}, {"helpful": 0, "title": "Worst stuff I have ever put in my mouth", "body": "Worst stuff I have ever put in my mouth.  Suppose to help lower estrogen. . I will let you know after next blood text", "rating": "3"}, {"helpful": 0, "title": "very good. love it.", "body": "A-1", "rating": "5"}, {"helpful": 0, "title": "Tastes fine, mixes well", "body": "Product came as advertised. Tastes fine, mixes well, nice packaging. Would buy again.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Good product. Seems to work. I would recommend to others.", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Part of my BP cocktail with the Citrulline Malate", "rating": "5"}, {"helpful": 0, "title": "Excellent Product!!!", "body": "Very good product, really love the quality!!!", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Very fine. Great consistency, blends well.", "rating": "5"}, {"helpful": 0, "title": "Inflammation fighter", "body": "Great stuff.  Quelches inflammation.", "rating": "5"}, {"helpful": 1, "title": "One Star", "body": "Absorbs moisture too quickly and gums up.  It is too messy to try to put in capsules.", "rating": "1"}, {"helpful": 0, "title": "Five Stars", "body": "great product", "rating": "5"}, {"helpful": 0, "title": "Gives you more power", "body": "Great stuff", "rating": "5"}, {"helpful": 0, "title": "Five Stars", "body": "Great!", "rating": "5"}]